[
  {
    "game_name": "Ashley: The Emptiness Inside",
    "game_description": "Ashley: The Emptiness Inside is a third-person psychological horror game in which you explore the restaurant that burned down many years ago. This place keeps many dark secrets covered in ash. Learn the history of this mysterious place from its founding to the fire in which many people died. Hidden caches, secret passages and mysterious puzzles are waiting for you on the way. Look for information everywhere and you will find answers to your questions. Why the restaurant rose from the ashes? How did this happen? This you have to find out on your own.You play as a girl named Ashley, trapped in the restaurant from her dream that turned into a nightmare. You see the walls approaching you, the dusk envelops the corners of rooms, and your heart beats more and more. The cozy place where you felt happy became quiet and empty. You hear the whistle of the cold wind instead of the visitors laughter, you see dim lamps instead of bright festive lights, you feel loneliness instead of joy and you smell death instead of the fresh dishes aromas.Uncover the secrets of a mystical restaurant in atmospheric third-person horror game. Unfulfilled dreams and real nightmares waiting for you. For many years the grim restaurant has been keeping echoes of the passed holidays, the clink of broken glasses and the smiles of people whose bodies become ashes for long ago. meet face to face with the revived nightmares filling the hidden corners of this placefind secret passages and explore the caches left here many years agosolve mysterious puzzles on your way to freedomuse the equipment to find a way out of the circumstancestry to distinguish truth from lies and reality from dream"
  },
  {
    "game_name": "KRUM - Edge Of Darkness",
    "game_description": "KRUM - Edge Of Darkness is hardcore action RPG set in a fantasy world. The player goal is to survive and reach the end of the story by fighting his way through gruesome enemies and blood-thirsty bosses await adventurers as he traverse through a devastated but still beautiful world.KRUM has a unique combat system that is simple to learn but tricky to master that’s unlike almost any other action video game out there. It’s nothing like a click-and-slash button masher. Button mashing will only get you killed. Each weapon has a few easy to execute but brutal combos. The nature of the fights suggests that you will have to wait your turn and plan your timing, in order to strike or parry at the very best moment. The game leans heavily on action, but when the combats are so perilous and gritty you'll often find yourself in what feels like a stand-off. Either battling monsters or common warriors, you will be eagerly waiting for your turn to come. You will face countless fearsome mobs and grotesque beasts, hidden deadly traps, powerful demon knights and dragons.THE STORYYou are a noble man living in a small and peaceful village. One day you return from the forest with some wood and see your village ravaged and left in ruins. Your friends and family dead or taken away. One of the few survivors, was able to tell you what happened in his last moments:Unknown demon forces came and destroyed everything without a reason, taking away the ones you love. There is no other way for you but, go on a quest to save them... As you progress in your path, you realize, that there is something more, something bigger, something terrifying behind this."
  },
  {
    "game_name": "A Fistful of Gun",
    "game_description": "When the evil railroad baron Clayton Boon decided to build a track to Hell, he didn’t reckon on a crazed shaman raising a posse of embittered psychopaths from the dead to stop him. Now they’ll pursue him across the whole Wild West, fighting their way through hordes of bandits, bears, braves and boogeymen just to find Boon and repay their debt with… A FISTFUL OF GUN!Select one of eleven unique playable gunslingers and seek revenge as a lone wolf or with your friends in local and online co-op. Master the specialized controls of each character, collect gold from fallen foes to purchase upgrades, and imbibe a bit of liquid courage and unleash a tornado of lead across the dusty plains.FeaturesMisfits and Outlaws: Choose between eleven different gunslingers each with their own unique control scheme and methods of attack to master. Some characters require the finesse of a gamepad while others are strictly bound to mouse controls to mount their offensive.Multiplayer and Co-Op Modes: Gather a posse of gunslingers for chaotic local multiplayer or connect online cooperative modes or square off with other gunslingers at the corral in the white-knuckled versus mode.Story and Arcade Modes: Take up arms against those that stand opposed and blast your way through the colorful landscapes of the west against dozens of unique enemies. Grab a horse, forge a river, ride a train – there’s never a dull moment in the lawless lands of the Wild West!"
  },
  {
    "game_name": "Cyberpunk Messenger",
    "game_description": "Add Cyberpunk Messenger to your wishlist!Check out game from our friendsAbout the GameGet yourself into trouble by dealing with shady people in the city. They don’t care who will deliver their packages. So be sure that other messengers will try to steal the stuff from you to earn the money. Drive fast.Take part in fast-paced street races. Risk your life being the fastest driver or… Use your knowledge about a city and find some shortcuts. The only thing that matters is who’s first at the finish line.Upgrade your vehicle or buy a new one. Customize your needs and your style.Feel the speed and let your heart beep a little faster in this cyberpunk city!"
  },
  {
    "game_name": "Creeping Terror",
    "game_description": "Trapped below a creepy abandoned mansion deep in the forest, a group of friends find themselves on the run from a terrifying monster. Using only her wits and what's around her, Arisa must uncover the secrets of the mansion, and figure out how to escape...before it's too late."
  },
  {
    "game_name": "Embrace of Ocean: Story of Hope",
    "game_description": "We are proudly present a new game in Hidden Object genre from game dave studio AVES GAMES . You are must try absolutely incredible game in steampunk style which takes place in a world that survived the flooding of the whole earth. Help a young girl named Blue Hope find her father and discover the secrets behind his scientific activities. Unravel the web of intrigue and mystery that enveloped the underwater city of Pearl. Only you are able to investigate the disappearance of the brilliant scientist, and to raise to the surface the mysteries that hide in the ocean depths.\n\r\nKey features:\n\r\n- Unique mini games\r\n- Gorgeous storyline\r\n- 3D premium graphic\r\n- Flawless soundtrack"
  },
  {
    "game_name": "The LEGO® NINJAGO® Movie Video Game",
    "game_description": "Find your inner ninja with the all-new LEGO NINJAGO Movie Video Game! Play as your favorite ninjas, Lloyd, Jay, Kai, Cole, Zane, Nya and Master Wu to defend their home island of Ninjago from the evil Lord Garmadon and his Shark Army. Master the art of Ninjagility by wall-running, high-jumping and battling the foes of Ninjago to rank up and upgrade the ninja's combat skills. Only in the LEGO NINJAGO Movie Video Game will you experience the film across 8 action packed locations each with its own unique Challenge Dojo.  And with the Battle Maps, play against friends and family in competitions for up to four players!"
  },
  {
    "game_name": "Human Fall Flat",
    "game_description": "***NEW LEVEL 'CANDYLAND' AVAILABLE NOW***Get ready for a sugar rush with the release of a brand-new level for Human Fall Flat, Candyland!Step into this sweet new level and start exploring sugar crystal spires, marshmallows soft enough to munch on, a castle complete with crisp chocolate portcullis and a waffle-y devious selection of new obstacles to overcome!To infiltrate this castle, you’ll need to gingerly navigate seesaw platforms, use candycanes to slide down ziplines, ride waffle rafts down a chocolate river, bounce between the marshmallow blobs blocking your way - and plenty more besides!Includes 29 great levels. Over 50 million players across all formats. More than 5000 levels in the workshop!  Human Fall Flat is a hilarious, light-hearted physics platformer set in a world of floating dreamscapes.Each dream level provides a new environment to navigate, from mansions, castles and Aztec adventures to snowy mountains, eerie nightscapes and industrial locations. Multiple routes through each level, and perfectly playful puzzles ensure exploration and ingenuity are rewarded. Need a hand getting that boulder on to a catapult, or need someone to break that wall? Online multiplayer for up to 8 players transforms the way Human Fall Flat is played. Your Human is yours to customise. With outfits from builder to chef, skydiver, miner, astronaut and ninja. Choose your head, upper and lower body and get creative with the colours! The Human Fall Flat Workshop, unique to Steam, is a fantastic tool which, used alongside Unity, enables players to build their own Human Fall Flat content and share it with others around the world. Not interested in building levels, lobbies or skins yourself? You can also download more than 5000 different levels and explore other people's creations directly from Steam! Streamers and YouTubers flock to Human Fall Flat for its unique, hilarious gameplay. Fans have watched these videos more than 3 Billion times!"
  },
  {
    "game_name": "100 Worlds - Escape Room Game",
    "game_description": "Mya set out on yet another adventure. She found herself stuck in an ancient magic book and now has to solve various problems, riddles and puzzles in order to travel from one world to another and eventually escape from the magic book. There is a variety of magical and fantastic worlds, all very different from one another. Your task is to work out the solutions with Mya. In case you get stuck, you can use hints and other help to pass the levels. Play 100 Worlds — Escape Room Game and dive into yet another adventure with Mya!Game features:- 100 mind bending levels, more coming soon- A variety of magical worlds to explore- Hints to help you when you’re stuck- Amazing graphics- Exciting puzzles with hidden objects and conundrums to solve- Cool game mechanics: move in time and space and combine objectsPut your brain to work and help Mya get out. Are you ready to give it a try?Genre: logic puzzle, escape the roomAge: 12+Benefits of Brain GamesIn addition to boosting brain activity, brain games have proven beneficial when it comes to improving concentration and providing a sense of accomplishment. While playing the 100 Worlds — Escape Room Game, you will have to use logical thinking and get your brain cells to work. Not only will you remove boredom, but also the puzzles and riddles in this room escape game will help enhance your memory and improve the step by step thinking process.Family friendlyYou can play 100 Worlds — Escape Room Game as a family and see who’s got the fastest skills. The puzzles and riddles have been adjusted to players above the age of 12 so get your teens together and explore the variety of worlds while solving logic tasks."
  },
  {
    "game_name": "FATED: The Silent Oath",
    "game_description": "Set in the mythical age of Vikings, FATED: The Silent Oath tells a tale of courage and sacrifice where an everyday father and husband must do the impossible to save his family from the destruction of the world at the hands of giants of old. \n\r\nFATED is a first-person movie-length narrative-adventure game in virtual reality. This immersive game with stunning visuals showcases the best that VR has to offer, proposing a strong story-driven, narrative experience that focuses on emotion over gameplay.\n\r\nKey Features:\r\n• First-person virtual reality action-adventure game\r\n• Highly polished visuals\r\n• Fully immersive and emotional journey\r\n• Enchanting and captivating musical atmosphere\r\n• Strong story-driven, narrative experience"
  },
  {
    "game_name": "Ryewood Town",
    "game_description": "Find the secrets behind Ryewood Town, with relaxing, RPG-Style adventure!Key Features:Start From zero until you reach the hero!  Chop the trees, cut the grass, seed the ground, raise the animals and decorate your place!Fully Customization, hence unique adventure! Customize your house, your character, and your farm as you want! Nothing stops you from forming your dream farm!Tame wild animals! From small animals to the big monsters, you can tame them all!Explore the whole world! from the town center, to deep inside the mountain caves, every place has its own mystery!Unique deep systems! It's whether animal care, leveling up or villager's relationship every system has its own uniqueness!Technical Features:Supports both Xbox One and PlayStation 4 Controller! New generation controllers will be supported soon!"
  },
  {
    "game_name": "Bounty Star",
    "game_description": "Bounty Star is an over-the-shoulder 3D action game that marries mech combat and customization with farming and base building. The player takes on the role of a broken but powerful ex-soldier named Clem, a war veteran, talented fighter and expert mech pilot. Clem attempts to shed the guilt and shame of her past and become a legitimate force for good in the Red Expanse, a post-post-apocalyptic version of the American Southwest.Key Features:Customizable Mech ActionYou pilot the Desert Raptor MKII, a Mech of extraordinary power. It is a highly-customizable battle vehicle that can be equipped with a variety of offensive systems: heavy, high-powered melee weapons, steam powered hydraulic siege weapons, explosive firearms, and more. It can also be equipped with a variety of defensive systems; high-speed thrusters, boosters for dashing, riot shields, among others.Become a bounty hunterThe Red Expanse is a rich farming and mercantile region plagued by violent criminals and dangerous beasts. The government that remains outsources justice to experts like Clem—bounty hunters who are free to pursue their targets into whatever dangerous corners of the world they hide. She'll fight her way through many corners of the region and deal with these marks as she sees fit.Repair and upgrade your homesteadClem comes into an isolated and run-down garage that serves as a suitable base of operations and home—just barely. Build out water and power supply lines, grow and cook food, produce ammunition and fuel for combat, and raise animals. This decrepit ruin has a lot of potential, but it will have to grow alongside Clem."
  },
  {
    "game_name": "Super Rhythm Duel",
    "game_description": "About UsIf you have any question or suggestion, you can join our !About the GameHello everyone!This game is my personal gameplay experiment, trying to combine rhythm + fighting gameplay to present an exciting fighting gameplay. The game is not finished, and there are still some bugs, but you can experience the gameplay!----------INTRO----------In Rhythm City, crime and chaos are disturbing. The balance between gangs is out of balance, the government is rotten, you must defeat the powerful enemies in Super Rhythm Duel, and restore the order of the city. Super Rhythm Duel is a rhythm-based action game. Follow the beat, master the rhythmic patterns and posture system to beat them all.Features:Fighting in retro 2D spritesLearn to input rhythmic patterns to perform versatile skillsEach enemy has tricky combat style, and you need to counter their actions to beat themTry to equip different gears and upgrade skills to make combat easier--------MENU--------Arrow keys: move arrowsX: map options, confirmationZ: CancelYou can configure skills and equipment in the options, and you can also shop in the store!--------FIGHTING--------Z: Place a blue note at the current location (combat)X: Place a red note at the current position (combat)M: Collect yellow notes to increase energy (combat)Use Z and M to play red and blue rhythm moves according to each section of the move table, and pay attention to collecting energy at the same time!Attack Skill: Inflict direct damage to the enemyDefense Skill: Resist the enemy's damageSpecial Skill: add buff or recoveryThere is a Posture Meter above the battle interface, and the two sides see each other. When one side is suppressed to the head, it will be dizzy and vulnerable.When both sides attack at the same time, the one with the heavier attack (not the more damage) will overwhelm the other's Posture.Defending the opponent's normal attacks will reduce the stance. However, if the dangerous attack is blocked, it will greatly reduce the opponent's posture.The enemy has several special attacks, all of which have corresponding countermeasures, some need to be defended, some need to be interrupted"
  },
  {
    "game_name": "Barony",
    "game_description": "You have entered the Barony of the vile lich Baron Herx!His curse has all but destroyed the town of Hamlet, and daring adventurers are the people's only hope. Prepare to face devious dungeons that demand your resourcefulness, wit, and vigilance.The dungeons are brutal; Full of vicious monsters and deadly traps, but legendary treasures, magical artifacts, spells and equipment will empower you throughout the adventure.Features:Put your skills to the test with perma-death, cryptic dungeons, and no handholdingCooperate with 1-4 players via split-screen, wireless play between Switch consoles, and the internet including crossplay with other platforms!Master 13 classes ranging from familiar warrior, wizard, and rogue classes to unique sexton, joker, and arcanist classesConquer or be killed by surprises around every corner in a new dungeon every time you playLearn deep RPG systems with loads of loot and stats to analyze and synergizeDiscover and utilize tons of adventuring weapons, equipment, lore, spells, & legendary artifactsHaunt or help your party even after death by spawning as a ghastly ghost with spooky powersExperience ongoing free updates from an active team that loves the game and is active in the Barony communityGo deeper with 2 DLCs offering alternate ways to play with new character classes and monster races which offer even more playstyles!Barony is a love-note to RPG classics like Ultima Underworld, System Shock, & Daggerfall, created by fans of the classics."
  },
  {
    "game_name": "Bloom: The Forest Burns",
    "game_description": "INTERESTED? WISHLIST THE MAIN RPG HERE!About the GameA free stand-alone chapter from the world of Bloom: Memories.The dreklings have been drawn to the forest and they are threatening everything with their fires! You must find help and stop them before it's too late in this action adventure RPG.How will you do it? Peacefully? With careful preparation? Or will you charge in and battle your way through? It's up to you.Features: Creatures that use hearing, smelling, vision AND emotions to sense the world!Varied gameplay including stealth and other peaceful optionsUncover imaginative plants and abilitiesAnd much more!!"
  },
  {
    "game_name": "Love In Drawing",
    "game_description": "Our games you might likeAbout the Game Reflect and draw! Love In Drawing is a game that aims to make you reflect to solve levels where you need to gather red and blue balls. The goal remains simple in appearance, but the more you advance in the levels and the more your brain will be strained!  Will you be able to finish all levels?   Features: ■ 100 different levels!■ Difficulty variable!■ Addictive gameplay!■ Good music!"
  },
  {
    "game_name": "Tiny Barbarian DX",
    "game_description": "October 2017 Update!Tiny Barbarian DX is now officially complete! The current version includes all four Episodes, new unlockable game modes and an all-new two-player cooperative mode to double your barbarian brawn!About the GameA Kick-Ass Blast of 16-Bit Sword-and-Sorcery Action!Steel yourself for a relentless display of might and muscle…of brawn and bravery…of magic and mayhem! Can you cleave your enemies’ skulls, plunder all the booty and flex to impress the barbarienne of your dreams? Inspired by heroic fantasy fiction, Tiny Barbarian DX combines engaging 2D platform action and combo-based hack-and-slash combat with retro-style pixel art and a loincloth-stirring chiptune soundtrack.Tiny Barbarian DX is now officially complete! The current version includes all four Episodes, new unlockable game modes and an all-new two-player cooperative mode to double your barbarian brawn!Four lengthy episodes with dramatic boss battles and secret surprises!Two-player cooperative mode to double your barbarian brawn!Bonus game mode “vs. The Horde” plus top-secret unlockable game modes!Hidden health-power-ups, valuable coins and mysterious diamonds to collect!Multiple homages to classic 8- and 16-bit action games in each episode!2.13:1 super widescreen presentation!"
  },
  {
    "game_name": "Depth Hunter 2: Deep Dive",
    "game_description": "Depth Hunter 2 offers 25 exciting missions in 3 huge locations around the world. Players will hunt different fish species and face the difficulties of breath-holding spearfishing, an ancient fishing method. \n\r\nPlayers will also have to find treasures and get the possibility to take underwater photos to capture the beauty of the simulated, detailed and lively underwater worlds they’re exploring also in a exploration mode. \n\r\nSpearfishing and Underwater Hunting are ancient fishing and hunting methods, used to catch fish by using a mechanical harpoon. Today, spearfishing is a sports activity in many countries around the world, especially in the UK, around the Mediterranean Sea and in South America. Spearfishers hunt while diving apnea, holding their breath, so have to coordinate their energy carefully while monitoring their prey, especially in tactically challenging hunting situations."
  },
  {
    "game_name": "Lamia Must Die",
    "game_description": "AbstractLamia must die! was a contest entry done for Encounters of Boss Kind. Since it actually placed 3rd of 28 entries (going for a tie with Demon Slayer Z), I went ahead and improved the game with improved graphics and more depth involving battle system before release to general public. It has an opening, the fight against Lamia herself and then the ending which is afflicted by which of the heroes survive. If all four heroes survive, there's a special ending. The battle can be somewhat tricky and requires use of strategy. The difficulty is medium-hard to hard, depending on how familiar with RPG mechanics you are.StoryA horrible monster has been terrorizing the local town for years, doing terrible, unspeakable things to the citizen. One day, a paladin leads several other heroes towards the cave where the monster lies in, them being the final hope for the town of Clearmill and to save it from total devastation.Characters You have a party of four characters, with the ability to choose between two paladins, a mage and archer. You also have Bishop and Rogue who join your party in your quest to defeat Lamia.Eric Eric is a Paladin who fights using a sword and shield. He is very sturdy and is able to withstand mighty blows, even though his heavy armor slows him down.JanetJanet is a Paladin who fights using a spear. She is very nimble and is able to deliver strong attacks, even though she is lacking in her defenses.UrsulaUrsula is a mage knowing many spells that can hinder numerous foes at once.VivianVivian wields a mighty bow that can hit any single target with an incredible power."
  },
  {
    "game_name": "Skytropolis",
    "game_description": "You have secured a contract to build the world’s first vertical megacity – the Skytropolis. Start with a plot of land and build your dream tower up into the sky! From the architectural design to every part of the interior, you are in full control of creating your skyscraper. Do you rush growth and use resources from surrounding cities, or do you invest in sustainability with eco-friendly infrastructure? Be warned - the more you build, the more you need to balance your Skytropolis’ needs.You are the architect. Design your dream skyscraper the way you want it.Balance is everything. Make your Skytropolis sustainable by going green, improving the lives of your citizens, and managing your economy.Prefer a hands-on approach? Play in virtual reality! Don’t own a VR headset? Play on traditional monitors in desktop mode.Tower mogul or inspired architect? Grow your empire in career mode or explore your creativity in sandbox mode.Unlock more than 50 modules to enhance your megacity.Meet demanding challenges to earn rewards and grow even faster.Proud of your work? Share your Skytropolis on Steam Workshop!Great care has been taken so that Skytropolis can be played both in room-scale VR or on your desktop (non-VR). Whether you prefer managing your city behind a monitor, or walking amidst your citizens, the choice is yours."
  },
  {
    "game_name": "Starfighter General",
    "game_description": "Epic Story time:       Behold...             The first & most ambitious MMORPG ever designed by man is now fun and improving!           Conceived in 1984.            Designed in 1989 as Pencil and Paper RPG with 50,000 man hrs play test.                 Hailed by all who played it as \"THE BEST PNP RPG\" ever!10,000 hours of code since 2017, and now we have Clash mode and a MMORPG with story + things never seen before in any video game ever coming as I continue to improve it. IN ACTION MMORPG -While others do less than others, we took what others did well and shot for the stars beyond them.  -Designed for end game. No level/power cap- Reason most mmos get boring is they ain't end game focused.-Networking that breaks rules-   Infinite Players Networking!-Inexpensive server(NEVER SHUT DOWN SERVER AND LOSS OF YOUR CHARACTER likely)  Server cost: 10,000x cheaper!-GALACTIC NEWS TICKER TAPE for quests and flavor/lore/comedy using randomly chosen AI for graphics for the news event.-MULTICORE TECH: 100-100,000x things rendered with new UNITY tech that unlocks more than just one core that most video games use. -Lore/Game Mechanics based on a custom TTRPG (Intergalactic Bounty Hunter) that most everyone liked more than any RPG. -6500 Ascended Masteries Talents To guide through a tree to train-Items have solid/heating/gaseous points, fire flash points when your ship heats, it can cause a chain reaction in the cargo bay-Items are based on real molecular so crafting will be the same as crafting materials in real life(educational scientific).Clash:Build a Starbase, Research new ships, build a huge fleet of a variety of ship types, and upgrade each ship individually.Take your fleet of ships, and fight other fleets of ships and bases in first person starfighter piloting along your wingmen in action combat. Take their resources and upgrade your fleet/base faster than theirs!Upgrade your Command Center to get more buildings (Max level 20)Other buildings can level up to 1000 and beyond!Use your Factory to Assemble more ships to battle on your side!User Research Lab to unlock the ability to research higher tier ships.Upgrade Hangars to store more craft.Upgrade Computrons to use more of your fleet in battle with a chip.Mine for Xmatter with mining operations.Store matter with Silos.Get Power Plants to speed building.Get a Triderium Reactor and farm virtual currency at an ever increasing rate!Upgrade your ships individually.Defend your base when you are offline with turrets.Raid bases and shoot mining operations or silos to gain Xmatter.Kill Ships/Buildings for scrap to build/research ships.Put debris buildings like walls, asteroids and space pets in the way of frontal assaults.Fans think this game is legit good now, and it will be better, likely better than any space game on the market.COMING SOON:-More Story + Techs along side.-Easter Eggs: Will contain literal Easter Eggs. You find an Easter Egg in a quest. Then you hide somewhere in space. Every day it isn’t found by another player, you get a daily reward that increases. When they find it, they get an instant reward! Then the egg comes back to you. Enjoy. Go find some place obscure in the game, space is big.-Space Dungeons: Competitive zones with different rules, find em, dominate em, and can you find the clues around space to find the one which will be dropping special event rewards?-Resource Trading / Crafting but also factory building Your economy and drones can build stuff up, but make sure no pirate, NPC or player tries to sabotage your supply chain. There will be illegal substances like fictitious drugs and contraband weapons which you can profit from greatly, but you risk your cargo being scanned by a random and getting a bounty on your head.  Little to no Bind on pickup/equip.-PVP bounty system. Everyone can PVP at all times. Stakes are low if your ship explodes. If you get attacked without declaring aggressive mode or an opponent to duel, the aggressor gets a bounty on their head in accordance with the damage dealt to you. If this bounty gets high enough, and they get caught, they will be put in jail. When they log on for the next few hours or days, their character can play only in jail, and visitors come see him and such. Enjoy roleplaying being a prison inmate, or just use a different crew member on your account. Developing many crew members is a thing for when you fly capital ships.  This gives no one a reason to bully a low level player, and reason to not just leave your mining fleets unguarded with fighters.-Grand Space Opera-4x emperors around you trying to conquer the galaxy They ain’t even players at first, just NPCs waging war. Who’s side will you choose? Will it be based on morality or space bucks? Ok soldier of fortune, what it will be? Do it for the money, until you realize money doesn’t mean anything living under a totalitarian empire.-Omnipotent roleplay: Earn your right into a a movie anime by great roleplay! Live game masters in about 6-12 months after the content updates roll through. We bias people with Founder's RP tokens some and good manner role players who stay in character(we have chat logs and even game logs). This promotes good role play even when not live GMing. Who doesn't want to bring their friends to a movie and surprise em with their own character in it? So stay in character for a better game! -Punky-Pulpy action, Levels, stats, skills, talents, items, fleet amassing, and great apocalyptic space plots, trippy Lewis Carrol level Mad Hatter humor along the way. It’s really weird to see how this synergizes from a game design standpoint. Players naturally want to level up and power up… That’s the twink min maxer in all of us. So when humor, plots, intrigue, or NPCs getting your blood boiling to action vs them happens, you get stoked, rewarded, happy and tossed off your axis. Then when resolved, you look back and get serious about powering up. The core of a RPG gamer is always powering up, it is something we can’t get rid of, but the core of a game designer is to get you out of a spreadsheet mindset temporarily… And then you appreciate both more. So tacky humor, along serious pulp action and serious leveling up game mechanics… It is like a symphony of fun.-Skills-16 Magic realms-Modularia to modulate socketed itemsREHASH OF WHAT WAS SAID ABOVE:The MMO will contain \"Space dungeons\" which are special zones that all players compete for a big reward.  Each Space Dungeon has a different win condition and goals.  Onemight be ffa. Another might be FFA highlander mode. Another might be science based.  Another might be team vs team.  Another might be chess team (aka you kill the king) youwin.  Another might be who kills a boss fastest.  Long story short, once a day, theseplaces will drop really good loot predictably either on a timer, or via clue sheet.  Thenmost players will know where to be.  And the same guy won't win every 'Space Dungeon'because the rules are dif for each.There will be resource trading, aka, buy aluminum or other metals one place and sellanother.There will be a PVP bounty system.  Everyone can PVP at all times.  Stakes are lowif your ship explodes.  If you get attacked without declaring aggressive mode or an opponent to duel, the aggressor gets a bounty on their head in accordance with thedamage dealt to you.  If this bounty gets high enough, and they get caught, they will be put in jail.  When they log on for the next few hours or days, their character can playonly in jail, and visitors come see him and such.  Global chat disabled.There will be illegal substances like fictitious drugs and contraband weapons which you can profit from greatly, but you risk your cargo being scanned by a random and gettinga bounty on your head.There will later be grand space opera.  AKA Live Game Masters will observe the game, and allow players to permanently change the history on their server.Then later, the ability to touch down on ground, and your player get out FPS style will come.I have other plans, but this will be a very fun game to come along for the dev ride. Enjoy updates and get yourself strong now, so when later the Space Opera comes out,you can be one of the big dawg influencers of the universe.Thank you for your interest!Love is the way!Big AAA corps don't need your money... Indies like me do, we make better video games when we can afford food, gasoline, and water for showers.  AAA just end up shutting down competition, internet search and see it's true.  AAA want to see you recycled culture, but indies make new culture.  So with your limited resources, vote for better games, by voting indie... If you like our art forms we're presenting.  In my lifetime, I made less than one cent per hour making games, due to contractual violations and the difficulty of making games... Yes, I've made less than one cent an hour... I make video games you WANT to play, the ways of the world's finances are inconsequential to true soul video gamers who make video games because we believe in the spirit of video games.  I could make these video games better and awesomer if you helped support me...But I've made video games for over 40 years making less than 1 cent an hour on my games, and I'll keep making video games the rest of my life even if no one helps.  I love and appreciate my fans and the small bit of support given... So it'd be awesome if people really got behind Starfighter General, there's galaxies that haven't even been made yet to explore.,James W. Sager III"
  },
  {
    "game_name": "Sunflower",
    "game_description": "This is an adult only game, with graphic sexual content.\n\r\nSuflower is a Visual Novel centered around a girl named Alina. Alina is a southern belle and loves walking around her sunflower fields near her house. When Alina is not relaxing at her house, she is busy attending LVN University. Alina is a student enrolled in the LVN News Reporting program. With her friends Ivanna and Nadiya, they try their best to investigate a mysterious student that has caused trouble for them in the past.\n\r\nSunflower also includes a comic book subplot about a girl named Captain Yuri. Captain Yuri is a super hero who can travel between dimensions. Captain Yuri is a funny parody of the super hero genre.\n\r\nSunflower features background music by Bittersweet Entertainment and Joel Steudler. It also has artwork by gin-1994 (background art) and DemonLordDante (CGs)."
  },
  {
    "game_name": "Super Worm 3D",
    "game_description": "Super Worm 3D is a 3D platformer game.Player navigates Super Worm through levels by collecting the key and reaching the gate. Player faces many kind of entitites in each level such as trolls, mosquitos, spiders, frogs etc. Player can collect and use dynamites for them.There are three difficulty levels in the game: easy, medium and hard."
  },
  {
    "game_name": "Cubetractor",
    "game_description": "WINNER: IGF China award for BEST GAME!Cubetractor is a neo-retroesque action-strategy-puzzle hybrid where you defeat enemies through an unconventional cube-pulling, turret-buildling mechanic. The game carries elements of a reverse tower defence and a grounded bullet-hell dodger to deliver a unique gameplay experience presented in a classic top-down perspective.You play as Endroi, a menacingly happy-go-lucky quadrubot as he strives to master the art of Cubetracting -- the art of attracting Cubes. It's a deceptively straightforward skill that involves dexterity, acute awareness, multi-tasking and tactical positioning. You'll have to strategize, solve and fight your way through multitudes of enemy installations to achieve your coveted goal.Features 40+ maps for you to pull, crush and build: Levels carefully designed to bring out the emergent dynamics in a unique mechanic. Symmetrical Balance: Why do bad guys always have to be stronger than you? In Cubetractor, the enemy structures are exactly the same as yours, other than they got there first. Defeating them is a matter of thoughtful timing and positioning. Purely indie-made: Done by 2 people, living off their savings, working off random coffee joints. Hardcore Awards for Hardcore Players: The main levels are designed for speedruns. Collect all the batteries, reach the finishing goal within impressively tight time limits -- do all that without a scratch -- to earn the most coveted of accolades. Don't worry, there are also options for those of us that are more human."
  },
  {
    "game_name": "Hockeysplit",
    "game_description": "Play as the one team to defeat the other one!Choose up from 10 colors of team!Learn the dribbling to get the advantage!Play with mouse and shoot wherever you want to the net and score the goal!Practice your accuracy to improve your quality!Learn the goalie reflexes"
  },
  {
    "game_name": "Revhead",
    "game_description": "Revhead is a car racing simulation game, where you have to build your own race car.You have a friend Charlie, who is busy with building race cars. He would need some help from you and he invites you to Australia. You start your journey somewhere in a small town in Australia, where the only way to get recognised if you are able to build the fastest and best racing car around. You have Charlie, his expertise and his garage. The rest is up to you!You have to think as a real Revhead! You can buy or sell cars and components, fix and tweak your car to make it the fastest around. However, a good race car is not always about the fastest or strongest, but the one which matching with it’s driver. Set your car the way it fits for your driving skills and racing conditions.Revhead is about to build and race with your dream car and while all of your racing skills will be required to beat others on a track, you also have to master mechanical skills to be able to fix, maintain or re-build your car.A real car is built up from thousands of components. Each connected to each-others and they are working together as a car. In this game, every car is built up from dozens of individual components, connected to each-other the same way as in reality. Each component can be removed, replaced and swapped between other cars. This way, you can not only customise your paint work and outlook, but the handling and performance of the car as well.Understand your car!Watch your car when driving, how is it handling, how smoky is it or what noise coming from the hood. All these can help you to identify the real problem.You need a 4x4 but you don’t have the budget? Buy a wreck cheap car and transfer it to a 4x4 supercharged racing beast, using wrecked cars and used components from the newspaper.You engine is strong, but your car don’t reach the speed you want it to? Make sure your gears and differential also match with your goals!Racing and what is behind itIn the reality, racing is about 80% mechanical work, 19% testing and 1% racing. In this game, we try to get closer to this, while we still wanted to keep the fun. If you like cars, if you do understand that a car is not only about 4 wheels, 1 motor and a steering wheel, if you don’t afraid of mistakes, if you dare to challenge others, even when you are with your most loved car, then Welcome in Noordu, the land of Revheads!"
  },
  {
    "game_name": "Hentai Animation Puzzle",
    "game_description": "Pinky Soul GamesAbout the GameHentai Animation Puzzle is a puzzle game, in which all you need is to swop pieces, in order to make the pictures and animations restored.This game is aiming to make you relax and enjoy life, with a bit of challenge.The \"?\" button can help you pass all the levels, if you are having problems with them.-Nudity or sexual content-All scenes within the game are consensual-Not suitable for watching at work-Not suitable for all ages-All characters in the game are over 18 years old"
  },
  {
    "game_name": "Balacera Brothers",
    "game_description": "Balacera Brothers is a run-and-gun action game set in a world plagued by crime and darkness. Join heroes Harold and Benny as they take a break from their ska band to battle the merciless Nugnur and his army of evil skeletons in this adventure inspired by classics like Sunset Riders and the original Contra. Featuring: Classic Run And Gun action that captures the spirit of run-and-gun classics of the 80's and 90's.Four different weapon upgrades: Spread Shot, Flamethrower, Laser Gun, and Homing Gun.Ability to hold up to  two weapons simultaneously, and switch between them anytime.3 difficulty levels: easy, normal and hard.2-Player Local Co-op: Team up with a friend for double the fun and chaos!Energetic Ska SoundtrackGlobally Inspired Stages: Explore levels inspired by real-world locations. Variety of foes: Including Medusa (Athens), Rougarou (New Orleans), and the Wildmaa (Basel)  \"Crime ran rampant through the streets, but Harold and Benny played every club and dive to spread that sweet sound of music to every ear that could hear.However...Crime breeds fear, and fear feeds the dark. The ghosts and ghasts reach out and eat more than the boys can beat! When music alone can't stop these bad bones, it's time for a little balacera!\""
  },
  {
    "game_name": "Narrow Escape",
    "game_description": "Narrow Escape is an indie horror game in which you try to escape from different buildings alone or with up to three other players without being killed by a monster.You play in the first person perspective and look for the three fuses and the master key to escape from the respective building.You can try it alone or with up to three other players. But the more you are, the greater the chances of escaping.There are also more points to be earned when playing with multiple players.EscapeGoal: Try to escape the building you are trapped inside. Therefore, you will need three fuses (red, green and blue) which are distributed randomly in the rooms.To search the rooms, you must crack the lock with your pickgun (which you always have along with you) in case you don’t have the right key with you fortuitously.Using the pickgun also slowly reduces its performance. But don't worry ... you can restore the pickgun's performance during the game.But beware!Don't be killed by the monster walking through the building. As soon as a door is unlocked, the monster can break through it. If you're caught by the monster, you can wait for help (if you are playing with multiple players). Or you have a first aid kit with you. Then you can also heal yourself.Upgrade your pickgunImprove the pickgun of your characters individually in order to be able to charge faster and to create more capacity.Escape RouteGradually complete your missions to get more points. You can complete one mission per session.More charactersCollect points and your level will rise. The higher your level, the more characters you can unlock."
  },
  {
    "game_name": "Basic Car Repair Garage VR",
    "game_description": "For car shows, trade shows and car people. A basic auto repair garage where you can run vehicle lifts up and down, look at animated transparent engines, install transmissions, and interact with mechanic tools and automotive parts."
  },
  {
    "game_name": "HORSE",
    "game_description": "HORSE is a short psychological horror game about a victimised man tormented by his recent past. Eaten away from the inside by sexual hangups, and unable to tell dreams from reality, our protagonist finds himself lost in his own familiar surroundings, as demons from his recent past infiltrate both his dwelling and his mind.\n\r\nFeaturing a dense atmosphere, evocative visuals, elegant sight mechanics, and deeply oppressive sound design, HORSE is a visceral, disturbing, and unforgettable experience.\n\r\n---\n\r\nFriendly warning: This game contains horror, dread, and imagery that pertains to sex and violence, sometimes in tandem.\n\r\nThis game is not suitable for children.\n\r\nThis game is available in English, Spanish, French, Traditional Chinese, and Simplified Chinese."
  },
  {
    "game_name": "Orwell: Ignorance is Strength",
    "game_description": "Inspired by the rise of fake news, social media echo chambers, and the displacement of truth, Orwell: Ignorance is Strength is the second--darker--season of the award-winning surveillance thriller, Orwell. With the power to both uncover and play with \"the truth\", you must decide for yourself how far you will go in the service of your country and whether the truth is sacred or ignorance is strength.Inducted into “The Office”--a top-secret department of the government’s Orwell security program--you’ll take on the role of an investigative agent during a time when civil unrest threatens to become a major political crisis between the Nation and neighboring country Parges. Reporting directly to Orwell adviser, Ampleford, you‘re tasked with uncovering the truth behind the escalating political tension, and delving deep into the lives of Raban Vhart, editor of The People’s Voice and self-proclaimed guardian of truth, his wife, Karen, and his brother, Illya, to uncover their potential involvement. To assist you in your task, you will be given new tools and mechanics that provide opportunities to control and impact the narrative. A new “time of day” system puts you in time-sensitive situations, making who you chose to investigate and when, more important than ever. You can also research more widely and dig deeper into citizen’s lives, gathering additional information to influence the way events are reported and perceived by the public.FEATURES:Investigate the agitators - Enter the world of Orwell and join a top-secret department of agents known as “The Office” during a time of civil unrest and political tension. Profile persons of interest by exploring web pages, social media and private communications. Make connections. Find the information you need to know.Uncover the truth - Separate the stories from the facts, the propagated myths and fake news from what’s really happening. Identify the hidden agendas of all those involved and expose them. Manipulate the information - Use Orwell’s upgraded toolset and the information you have uncovered to create your own version of the truth. Then use that to gain influence and control over the situation.End the threat - Expose the truth. Destroy the lives and influence of those who seek to bring harm to the government and diplomatic relations with neighboring countries. Put an end to the civil unrest threatening to destroy the Nation.Releasing over three episodes - The game will release on PC, Mac and Linux across three bi-weekly episodes, with episode one available February 22. Be part of the investigation as it unfolds.Praise for Orwell:“Grabs the problem of how we balance our own liberty and our safety and turns it into a thrilling adventure.” – Polygon“In an age where so much personal information is willingly released by so many, Orwell brilliantly explores the implications of this data being misinterpreted.” – GameSpot\"A harrowing look into a reality where Big Brother is always watching\" - Rock Paper Shotgun"
  },
  {
    "game_name": "Operation Valderon",
    "game_description": "You have been personally selected by the emperor to command the finest fleet in Valderon against the incoming enemy forces. Your job is to position the fleet so NO enemy forces pass through. Glory to Valderon.Operation Valderon offers a unique twist to the classic tower defense structure, with unique towers and versatile enemies which make for an addicting gameplay. Select your fleet and place them strategically onto one of the 400 possible spots, and save the greatest planet in the universe from the exponentially growing enemies."
  },
  {
    "game_name": "WWII Partisanen",
    "game_description": "World War II, Poland, partisans…What springs to mind when you hear these words? How much do you know about role of the people’s guard units in the war that engulfed half of the world in the middle of the last century?WWII Partisanen is a collectible card game where you take on the role of the leader of a Polish partisan squad during World War II. The game is done in a humorous, cartoonish style.At the beginning of the game, you will lead a small guerilla squad. Recruit rookies into your ranks and welcome volunteers. Teach your soldiers new trades, improve their skills, and over time your squad will be a real threat to the enemy.Go from being a leader of partisans to being a commander of a well-trained guerrilla group!Capture town after town, moving gradually towards the capital cities in Campaign mode. Succeed in special missions and earn additional rewards and bonuses. You can also participate in ranked battles to win the title of best of the best."
  },
  {
    "game_name": "Remaya Idle",
    "game_description": "Remaya Idle is a new incremental game which supports full idle and full active. Choose your way and beat the game.There are many types of items in Remaya Idle, such as:-Potions: drink potions to increase your damage.-Equipment: equip different types of gear to enhance your stats.-Books: use books to modify any item in the game, farm rare ones to become stronger.-Dungeons: look for the rarest type of items in the game and manipulate them to generate loot.NEW:  Knowledge Level and Knowledge Tree.A new end game option where you can grow stronger. Reach high levels and rebirth to gain damage multiplier and knowledge points. Allocate knowledge points in knowledge tree to enhance your playing style."
  },
  {
    "game_name": "Kabaret",
    "game_description": "\"The truth is this, every monster you have ever met, was once a human being.\"Cursed into a monster, Jebat journeys into a realm called the \"Alam Bunian\". Taken in by the charismatic owner of Kabaret, known only as The Caretaker, Jebat is tasked with providing tea ceremonies to the dwellers in an effort to gather information on how to break his curse. Kabaret is a dark fantasy folklore adventure game. The story unfolds through the eyes of Jebat, a cursed boy who is uprooted from his small town to a mystical, violent, and unforgiving monster realm. Astray and lonely in a place of unfathomable cruelty, Jebat confronts monsters both supernatural and human in the Kabaret. Each of the mythical creatures who visit the Kabaret come from Southeast Asian folklores and legends. Listen to their unique stories, give advice through performing a tea ceremony, and find a way to break the curse.Experience the story through the eyes of our main character, JebatExplore Kabaret by interacting with more than 20 different Southeast Asian-inspired mythical creaturesPave your own way through the 6 different endings, each with its own unique routePerform tea ceremonies and get to know the dwellers of KabaretTake on a match in Guli and Congkak, our Southeast Asian-inspired minigamesManage a stage performance and help to put on a dazzling showFeaturing sounds of Hello Universe and Sambasunda IndonesiaKabaret brings together mythical beings from Southeast Asian folklore in a mystical realm. This game is hand drawn stylised art and is complimented with traditional musical soundtrack. It is a dark fantasy folklore visual novel with traditional Southeast Asian games, tea brewing, musical gameplay and multiple endings."
  },
  {
    "game_name": "Gooblins",
    "game_description": "Gooblins is a First-Person Shooter for the HTC Vive that pits the player against never-ending waves of Gooblins. These cute but deadly creatures are hell-bent on using plasma blasts, fireballs, and kamikaze attacks to destroy you. As you progress through waves, Gooblin firepower and defense capability increases. Survive long enough to unlock your machine gun to make quick work of unshielded Gooblins. While mowing them down is satisfying, high scores on the leaderboard can only be achieved by killing Gooblins in the color order indicated on your weapon display.    Various Gooblin types with distinct personalities, all tying to kill you in their own special way!   Play in 360 degrees for the full experience, or 180 degrees for when your Vive cable starts to look like spaghetti.   Use the energy shield in your other hand as defense against plasma and fireballs!   Grenades launch with gun grip button, detonate with shield grip. Perfect your timing for mass destruction!   Free updates as more game features become available!    See full details in the Quick Reference."
  },
  {
    "game_name": "The Tarnishing of Juxtia",
    "game_description": "The Tarnishing of Juxtia combines dark fantasy visuals and a hauntingly beautiful score with challenging Souls-inspired 2D action RPG gameplay and a sinister narrative. An innovative and rewarding combat system, a staggering variety of equipment and abilities, highly-detailed pixel-based environments, and terrifyingly Tarnished bosses work together to make The Tarnishing of Juxtia an unforgettably immersive journey.Risk Versus Reward Combat: A unique Energy Rush system encourages calculated risks: After landing consecutive attacks, bold players receive a super-charged boost of stamina and mana regeneration. Utterly Vicious Battles: Push the limits of your will and skill in explosive, multi-phase boss battles against corrupt saints, ancient war machines, Tarnished creatures, and vengeful gods.Haunted, Layered World: 15 unique environments, beautifully detailed visuals, deep and twisting lore, and a myriad of side quests await in this 20+ hour action RPG.Turn the Tide: Store and charge Relics from fallen bosses. In your most desperate hour, release the Ultimate power they contain. Develop Unique Character Builds: Weapons, armor sets, magic abilities, Relics, and other hidden items offer nearly unlimited possibilities for unique character builds. Players’ individual visual and combat style can sing."
  },
  {
    "game_name": "Battle of the Boros",
    "game_description": "Battle of the Boros is an action adventure RPG set during a mysterious invasion and occupation of New York City.\n\r\nYou play Kristen and the team of survivors she assembles to investigate what happened and reclaim the city.\n\r\nYou control a team of up to three characters at a time, each of who fights a little differently.  Some specialize in attack, some in defense and some in support.\n\r\nThrough camping and chatting with your teammates you form friendships and can become even stronger!"
  },
  {
    "game_name": "The Royal Marines Commando",
    "game_description": "Join the Elite!\n\r\n1941 and the German War machine is ravaging Europe. The British intelligence obtains classified documents detailing the development of a new type of German deadly weapon.  It will give the Nazis worldwide naval supremacy and a great advantage over the allies. The Royal Marines Commandos are sent into action.\n\r\nLead the British commandos on intense missions in France, Africa, Scotland and Norway\n\r\nBattle the Axis armies using realistic weapons originally used during the World War II\n\r\nExperience astonishing graphics, dynamic lighting and breathtaking effects"
  },
  {
    "game_name": "Roguebreaker",
    "game_description": "Growing up, I spent most of my summers indoors playing video games, trying to beat that one final level, trying to get just a bit better and beat my own high score. Roguebreaker is my love letter to that time of my life, when you could just lose yourself in a colorful world for a little bit. Beat a level, unlock a new upgrade, and repeat. It's a small, simple game designed to be played in a short sitting, just long enough to zone out and have a good time for a few minutes and relax.  I hope you're able to feel a little bit of that as you play. If not, I'd be happy to hear why and what I could do to make it that much better for you.Thanks so much for giving it a shot,Josh Bergasse - The World OutsideBreak enough bricks and you make a choice between two upgrades. Beat 10 levels and you've got a totally different set of upgrades compared than the last run.Each level is randomly chosen from a preset pool, so you have a general understanding of what's next, but you can't be sure.The higher your score, the faster the ball. The more balls you get the more fun you have. It's simple.Restarting a run means totally different handcrafted levels and a unique set of choices to make.Break bricks like nobody's business. Hearty bricks, moving bricks, pickup bricks, innocent bricks, it's got bricks for days.It's got all the pickups you can imagine. Multiballs, extra speed, extra score, extra style, extra fun. Too much fun though and things get hard, be careful.After you beat a level, you choose an upgrade, go slowmo, suck the ball back to the paddle, fire missiles, tilt the board and bounce the ball, it's great. If you game over though, you start from scratch.The more you play, the more you unlock, the more you understand, the better you play.After mastering all 20+ of my handcrafted levels you can start adding your own. Just create a map and drag it into the custom maps folder and you're good to go.Trailer music was generously provided by Dance With The DeadOfficial workshop support is in progress, but can create and share levels without it! Please don't hesitate to contact me if you're unhappy, I want to make sure you enjoy the game as much as I did making it!"
  },
  {
    "game_name": "Mars 2030",
    "game_description": "Suit up for the first manned mission to Mars! MARS 2030 is a virtual reality simulation that gives players the opportunity to explore the mysterious red planet like never before. MARS 2030 centers on open world exploration. Taking on the role of an astronaut, players traverse Mars and collect geological samples that uncover the planet’s past. Make discoveries across 40 square kilometers of open Martian terrain, accurately-mapped and -modeled using NASA's Mars Reconnaissance Orbiter HiRISE satellite data. Along this journey, players discover a world rich in history that, much like our own planet, once looked very different from what exists today. MARS 2030 can also be experienced in non-VR.Key features include:Full Martian days, with the orange hues of day transitioning to blue at nightRealistic weather conditions, atmospheric pressure, and Martian gravityGeolab workstation equipped with a VR Microscope to study collected samplesA habitat base, modeled after the design from NASA Langley’s Evolvable Mars CampaignInteractive VR music, performed and recorded by the London Symphonic OrchestraAmbisonic sound covers audio sources from every direction and propagates sound realisticallyFull support of motion controls to operate equipment and Mars rover, and navigate the terrainMars 2030 was developed by FMG Labs, a division of Fusion Media Group, in partnership with NASA. It is available on PC for HTC Vive and Oculus headsets, and will be available on Playstation VR at a later date (TBD)."
  },
  {
    "game_name": "Attack of the Earthlings",
    "game_description": "Attack of the Earthlings combines turn-based combat and stealth in a dark comedic single player campaign, where you the player, take control of the native alien race to defend your home world from the invading humans.Galactoil, a comically dysfunctional energy corporation, are hell-bent on harvesting the known universe for energy and will drill anything in its incessant quest to line its pockets with profit. However, their latest foray into energy exploration on Planet X13, has placed them into a bit of a pickle. The Swarmers, the native insectoid species, have another idea - to eat all the workers!You take control of the Swarmers, a highly aggressive insectoid species, who must convert human flesh into alien muscle, upgrade their units and even find the time to gatecrash a birthday party.To put a stop to the invasion, the Swarmers must plan attacks carefully. Take control of unsuspecting workers, set traps, emerge from vents and hiding spots to take your human prey by surprise, and assault in groups to kill multiple enemies at once. The more earthlings killed, the more corpses can be consumed and transformed into new units with specialized roles and unique abilities. The flesh of their own workers is the key ingredient to developing a successful alien insurgency against Galactoil.  Voice actor and Vine extraordinaire, SungWon Cho A.K.A ProZD (A Hat in Time, Paradigm)[/b], lends his brilliant voice to X13 mining operation Regional Manager Dennis Dickinham; a man both massively unqualified and massively overpaid. A gregarious fellow who finds joy in everything, be it catching a few rounds of golf with the boys or rerouting power from sickbay to the massage chairs in the boardroom, Dickinham's a delight to be around! Just never, NEVER utter the phrase \"bad idea\" in his presence.The game also features an original soundtrack by composer Mikolai Stroinski (Vanishing of Ethan Carter, The Witcher 3: Wild Hunt, Blood & Wine)."
  },
  {
    "game_name": "Achievement Lurker: You are going to have to work hard for these nuts",
    "game_description": "One of the last 5,000 achievement games you will see!  Get your points in now before it's too late!\n\r\nIt is a dark day in the land of eternal forest. Our hero Jacob can not find any nuts. Go on this fast paced adventure! along the way you will fight in turn based combats against various monsters of the Forrest. You will achieve great levels as you advance in the built in XP leveling system.   Explore the dimensional map to uncover all that is hidden.\n\r\nRPG Combat\r\nLevel UP\r\nShop\r\nInventory system"
  },
  {
    "game_name": "Budget Cuts",
    "game_description": "You are an employee at the mega conglomerate TransCorp, and it's your job to stamp papers and file files! Unfortunately for you, TransCorp is an expert in the business of manufacturing cost-cutting robots, and now you are about to be fired. Built for Virtual Reality from the ground up, Budget Cuts is a stealth game set in a dystopian office-scape with tons of evil robots and even more knives (for throwing and stabbing them with!) Use your TransLocator gun to teleport through the many departments of TransCorp. Sneak around corners, hide behind air vents, or go nuts with lots of robot-killing action!Budget Cuts Arcade (accessed through the arcade machine in the main menu room) is a free update that now comes with the base game automatically, and adds four new bonus levels to the game, new difficulty levels, as well as a new Arcade Game Mode with high scores for the best runs! Full patch notes are available on our steam newshub.\"‘Budget Cuts’ Showcases an Impressive Grip on What Makes VR Great\"RoadtoVR\"Budget Cuts is the future of VR right freakin' now\"Eurogamer“It's a rush that I might never have experienced in a game before.”Polygon“Budget Cuts reminds me of classic Valve single-player games. That’s a very, very exciting thing.”Kotaku“I can’t wait to play more of Budget Cuts, which might be the best, most interesting VR game I’ve played.”IGN\"Virtual Reality Sneak ‘Em Up Budget Cuts Looks Ace\"RPSPLEASE NOTE! We would NOT suggest that younger children play this game. Available for Arcades on SpringboardVR"
  },
  {
    "game_name": "Judgement",
    "game_description": "WARNING: Some players may find the theme/content of Judgement disturbing. If you are sensitive to disturbing thoughts/images, play at your own risk.\n\r\nJudgement is a story-driven, decision-making adventure game, where your Judgement can mean the difference between life, death, or somewhere in between. It's a game of morality and how gray it can be. In addition to a polished combat system, Judgement features a dynamic story where each decision leads to a different outcome in the game. In all, there are thousands of different combinations of choices the player can make, so each player (or playthrough) will have a different experience and a different ending.\n\r\nThe game is trickled with collectible notes, which offer food for thought when it comes to decisions that the player will make, or already has made, in the game or in real life.\n\r\nJudgement, in its first form, was created when the designer was at the angsty age of 15. The perspectives and themes have their origins in a 15-year old boy trying to tell a story. It's been worked on here and there and has reached the point that it's at today."
  },
  {
    "game_name": "Hentai Case Opening",
    "game_description": "Our games you might likeAbout the GameHentai Case Opening is a totally classic case opening simulator with a slight Japanese touch ...Your goal will be to collect all the items in the game! To do this you will have to open cases ... The case number 1 is free but the items inside have a low value. By reselling these items you will be able to open more expensive cases and get more rare items!Will you be able to collect all of them?Features :■ 4 cases!■ More than 42 items!■ Beautiful Artwork!■ Inventory system!■ Sales system!■ Good music!"
  },
  {
    "game_name": "Anarcute",
    "game_description": "Anarcute is a rampaging riot simulator, combining adorable aesthetics with huge-scale chaos, colourful destruction and crowd-beat’em all gameplay!These are dark times. A group of evil corporations has taken over the major cities of the world. They took control of the media, brainwashed the police and now shamelessly dictate the citizens' lives from the heights of their skyscrapers.It is time to act! Take control of the revolution to face the terrible Brainwash Patrol who’s dominating the world.United we stand!In Anarcute you’re not controlling a single character but rather a whole crowd! The bigger the crowd, the more powerful it gets. Wake up your fellow rioters in the cities and grow the revolt to unleash devastating abilities!The city is your playgroundPhone booth, fire hydrants, trash cans, bikes, cars… use objects from the city as projectiles. If your crowd gets big enough, you’ll even be able to take down whole buildings and make them collapse on your opponents!Fight the Brainwash Patrol Your opponents will stop at nothing and they will use all of their impressive equipment to stop you from completing your objectives. Lasers, Electric Turrets, Spider Robots, Helicopters and Mortars are some of the many traps and enemies that will stand in your waySpread the revolution across the GlobeDuring your adventure, you will get through 5 cities with unique visual and audio settings. From Tokyo to Paris and going through Reykjavik & Miami, the Brainwash Patrol won’t give you any rest. Explore every corner of the cities to find all the animals and customize the crowd to your taste!It is time for the cute revolution!Key Facts :Lead a group of adorably cute rioters and wreak havoc all over the world in your fight against evilPick up any object in the streets and throw those at the Brainwash PatrolTake down any building on your path and take advantage of the city’s layoutFight the Brainwash Patrol, a terrible force ready to do anything to stop youExplore the world and set it free!"
  },
  {
    "game_name": "Soccer Battle Royale",
    "game_description": "100 Players are fighting in a huge battle area and you are one of them. You have to keep your goal clear to survive. At the same time you should try to shoot as many goals as possible to eliminate as many enemies as possible. Only the last man standing will be the winner of the complete round. During this round the circle of goals becomes constantly smaller to keep the action and thrill high.\r\nYour potential enemies have several strategies to become the best player. Try to find out what they are doing and beat them with their own weapons. There are several difficulty levels to start easy and slowly become a real master. The magic of the game is handling the struggle to rush forward to beat all you competitors and be defensive at the same time so that you do not give your enemies a weak spot by an open goal. You as your only teammate are a combination of the goalie and striker.\r\nThis game was a submission to the game jam ludum dare 41. The theme of the game jam was “combine two incompatible genres”.\n\r\nThis variant contains:\r\n=> Single Player (different. Challenges)\r\n=> Multiplayer\r\n=> Gamemodes: Classic, Football, Bomb\r\n=> Powerups: Frostgun, GravityGun, Speed, Bricks, Protector"
  },
  {
    "game_name": "Rogue Agent",
    "game_description": "PrologueIn a future war, the world is on the brink of a global force domination. The nations devised the final plan to restructure the order or to conquer it in their favor. They signed an agreement to activate their latest assets: the Rogue Agents. They would reshape the world!You have been invited to accept this mission.In-Game Drops CollectionMarketable/Tradable flags are random dropping during your playtime. These items can be applied to Item Showcase profile session and have no value in-game.Notes*The content of community’s page may differ from actual in-game content due to updates."
  },
  {
    "game_name": "Hunter X - Begin",
    "game_description": "# Feature\r\n - Stylish action game using the sword.\r\n - There are several combo skills. (You can see it as a tip in the game.)\r\n - There are 3 types of special attack.\r\n - Control yourself, kill zombies.\r\n - The action takes place with the birth of the hero (Hunter X) and the story of catching the villain (Dr.Jod).\n\r\n# Control\r\n - Game Play: Keyboard\r\n  => Move: W, S, A, D / Attack Key: J, K, L / SP Attack Key: U, I, O \r\n - Menu: Mouse\n\r\n# Character description\r\n + Hunter X (Hero)\r\n  - By chance Dr.Jod's zombie gas awakens his superpowers, and he's trained by the Hunter Group for three years. After that, he goes to catch Dr.Jod, who makes zombies.\n\r\n + Dr.Jod (Villain)\r\n  - A mad scientist who invades visible cities and towns while continuing to make zombies."
  },
  {
    "game_name": "BEATris",
    "game_description": "BEATris : Rhythm! Puzzle! Action!  Survive the block-hell situation until the end of the music. Control the blocks falling with the beats and fill the lines to destroy them. Enjoy the music while the level shifts with the rhythm.BEATris presents a new wave in rhythm game genre. Inspired by the classic puzzle game Tetris, the game gives you a strategic gameplay with the rhythmical flow from the music.Features Various EDM Soundtracks to enjoy Unique levels that are brutally fun Make creative levels with your favorite music on Level Editor Share your levels on Steam Workshop With Steam Cloud integration, create your level anywhere everwhere"
  },
  {
    "game_name": "Chaos Domain",
    "game_description": "Chaos Domain is a game about shooting bad people in the face.Apart from that, it is also a run and gun platformer, powered by Unreal Engine. The game is highly influenced by games from 8-bit and 16-bit era, including Contra/Probotector series, as well as titles like Abuse and Doom Troopers. The game is set on a huge spaceship occupied by chaos cultists, where the main character (who clearly looks like a hi-tech version of the god Anubis) must kill everyone in sight. The game is obviously not story-driven, it’s all about action.Players can upgrade weapons and purchase special items that can boost their performance. Local co-op for 2 players is available.FEATURES• Classic gameplay.• 10 levels split into sub-areas, which gives us about 30 stages.• Upgradable weapons and a range of special abilities to choose from.• Pure hardcore run and gun action.• Traditional 2 Player local co-op."
  },
  {
    "game_name": "Lost Astronaut",
    "game_description": "You must fly safely to a landing areaAvoid dynamic obstaclesUse the elements of the scenario to your advantageBe quickBe careful of the trapsControl a spaceship and attempts to land safely on blue platforms.Featuring:Story Mode: You are guided by an artificial intelligence that is constantly questioning your own existence.Casual Mode: Play without being interrupted by the dialog boxes.Speedrun Mode: A timer is started! Try to finish the game as soon as possible.20 scenarios with characteristics that make each one unique.3 different types of spaceships with different levels of difficulty."
  },
  {
    "game_name": "Kaisuo",
    "game_description": "Kaisuo is a single-player puzzle game about opening Chinese puzzle boxes that unlock surreal worlds. Journey through a strange landscape and discover new uses to old things. Slide open panels, discover secret compartments and change the way you see the world.\n\r\nExplore a gorgeous and mysterious world through 360° gameplay. Use the Oculus Touch controllers to precisely interact with the world via complex items and tools that deliver fine haptic feedback and move the world at your finger tips."
  },
  {
    "game_name": "EnviroGolf",
    "game_description": "A text-based sport game with a focus on the environment? What more could you want!Envirogolf is a short text-based golf game (read: less than 15 minutes). Experience golf through the written word and learn about the environmental impact of your actions* while playing this white-collar leisure sport. Pick between three golf club options and strength levels in this digital three hole game. How is your recreation destroying the environment?* Let's find out!The perfect length game to enjoy between putts.*No EnviroGolf facts (EnviroFacts) have been verified by any legal, scientific, or governing bodies."
  },
  {
    "game_name": "Cat on a Diet",
    "game_description": "Soft, fluffy, and a little on the chunky side — the podgy pussycat Dr. Meow can’t stop munching on delicious cookies and needs your help getting his greedy little paws on more! While his owner sleeps, steal away into the kitchen and help tumble this tubby tabby cat into the prized cookie jar.\r\nGet stuck in!\r\nSwipe and prod to claw away at wooden blocks, unscrew bolts, control powerful magnets and explode highly volatile uranium – anything to reach those cookies!\r\nThe hand that feeds?\r\nWhat are the owners hiding from you? Find out as this pot-bellied kitty’s journey for sweet treats takes him up into the attic and down into the secret laboratory.\r\nSnack happy!\r\nMunch all the snacks in each level and spend them on new power-ups, hats, masks and even more cookie-heisting helpers.\n\r\n- witness the shenanigans of Dr. Meow in a Physics Puzzler for all ages\r\n- visit 4 game worlds (Dr. Meows Home, Spooky Attic, Mysterious Laboratory and visit the middle ages!)\r\n- Over 100 challenging levels to complete\r\n- two diverse game modes\r\n- Collect over 50 fabulous cat costumes\r\n- Use fun tools and inventive methods to reach the cookie jar!"
  },
  {
    "game_name": "Drying Paint Simulator VR",
    "game_description": "After a long and cold journey, \"the artist\" has finally arrived at his deserted cabin in the woods.The perfect peaceful place to create his final masterpiece. The artist's Magmum Opis.Drying Paint Simulator VR is the narrated exhilarating story of an artist (you) creating their last painting. A masterpiece.Take shelter from the raging snowstorm outside in a cozy candle-lit log cabin whilst enjoying the view of your masterpiece drying.Features Incredibly cozy log cabin Paint easel Lots of interactable Locomotion support Teleport support Some weird locals that seem to appear at night.."
  },
  {
    "game_name": "Cosmo's Cosmic Adventure",
    "game_description": "Cosmo's Cosmic Adventure is an exciting journey across a forbidden planet full of dangers and surprises. Can he save his parents before they're lightly seasoned and devoured?Cosmo is a lovable extra-terrestrial with a special ability: He has hands that work like suction cups! He can cling to walls, ledges, and all sorts of things. Using his suction hands, Cosmo is able to avoid dangers, scale cliffs and get to places other aliens can't reach.FeaturesCreature Closet: Over 20 unique and surprising creatures.Superstar: Cosmo has many tricks, such as scaling walls with his suction hands.Size and Simplicity: Massive but easy-to-explore levels. Save Your Game: Game saves, built-in hints, and much, much more.Controller Support: Partial Xbox 360 Controller support."
  },
  {
    "game_name": "Fifo's Night",
    "game_description": "THE GAMEFifo’s Night is a 3D puzzle-platformer set in and around an enchanted, sprawling mansion. Explore elaborate rooms within, find hidden collectibles, fight a variety of monsters, and solve puzzles in an exciting game for all audiences.Fifo’s Night lets you relive old-school 3D platformers with a renewed artistic approach with a spooky atmosphere!THE STORYThe Magical Candies that keep order among the supernatural creatures living inside Candywood Mansion have mysteriously disappeared. Fifo, our ghostly protagonist, awakens from his slumber, determined to set things right.Make your way through the haunted Mansion – its luscious gardens, dark labyrinths, and twisted libraries – tracking down the lost candy, and the entity that stole them. Restore the Candies to their pedestals in the Basement, defeat the bosses corrupted by the missing Candies, and return Candywood Mansion back to normal.FEATURESClassic 3D platforming gameplay.A humorous, light-hearted story.Huge levels filled full of detail, secret areas, and collectibles.Enemies and bosses bursting with personality.Challenging obstacles.Funny, yet difficult puzzles.Several different collectibles to find and gather."
  },
  {
    "game_name": "Life Game",
    "game_description": "Welcome to the Life GameThe life simulation game you've been always dreaming  In the Life Game you can create your own cubic character and start living in the open world mechanics. The Town you live is Old Town. In this (Open World) town you are free to do everything. When you enter Old Town, you will see that almost everything is interactable. You are more inside the life now with the first person view and full control. Live, Eat, Sleep, Work, Love etc. Write your own story.  Create and customize your characters Play with 1 (alone) character or up to 8 characters and set up your Family Build your own dream home (Use your own creativity) Find a job, earn money, buy goods, foods, books, clothes and more to meet all the needs of your family members. Meet new people, and call them with your mobile phone. Use PC or mobile phone for shopping, finding a job etc. Find your dream love With your own car or by walking or with taxi or with public bus or trains, travel anywhere you want. (Beach, work, disco, school, clothes store, barber, grocery, dining, hotel, etc) All will come as a feature in our early access period. and more to come in our early access period like other towns, beach clubs, more fascinating house and furniture designs, burglar career, heist missions, farming, business tycoon mechanics (opening your own store), farming (planting or animals), pets and  seasons..."
  },
  {
    "game_name": "Jumping Jax",
    "game_description": "Jax is your teleporting cyborg corgi. A Cyborgi, if you will. \n\r\nJax wants to play. To him, that means teleporting around the city while you chase after him!  You'll have to use interesting movement mechanics (bunny-hopping, portals, bounce-pads and more!) to bring Jax home before dinner.\n\r\nCyborgis still need their exercise - take Jax for a walk with the help of the Steam Workshop!"
  },
  {
    "game_name": "Captain Disaster in: Death Has A Million Stomping Boots",
    "game_description": "Captain Disaster takes a job delivering a package from Acturus-1 to Proboscis Major - not realising that he is actually transporting something that will put the entire galaxy in danger!  Though just getting the package in the first place is quite a challenge in itself...Our intrepid nitwit investigates interesting peculiar people, puzzling places and panicky problems along the way to saving the day, once he finally realises that something is wrong.  Expect lots of laughs and head-scratching dilemmas before you reach the shocking conclusion and find out what all this \"Million Stomping Boots\" business is actually about!Game Details:- Classic point-and-click adventure gaming action with a few new twists- Retro 320x200 resolution graphics- Fully voiced - Epic music score - Plenty of puzzles - Plenty of adventure- Plenty of comedyThis game has been a labour of love by 2 devs (CaptainD and TheBitPriest) - who should know better, but just can't help loving the genre - with help from multiple other people over time.   We were inspired by the classic adventure games produced by Lucasfilm Games and Sierra, and believe we have created something that will hopefully, like those games, stand the test of time.\"Death Has A Million Stomping Boots\" is a love letter to the classic adventure games we loved in the 90s - CaptainD inspired mostly by the masterpieces published by LucasFilm Games, TheBitPriest owing more of his point & click memories to Sierra's titles.  Combining these elements into one game with a few modern game design features thrown in, the co-devs has sought to create something that looks and feels just like it could have been a game made in the 90s but never released at the time (though we promise you this was not in fact the case!).In Stomping Boots you play the role of the eponymous Captain Disaster as he struggles to save the galaxy, having inadvertently nearly caused its destruction.  It features a 2-click interface (left-click Interact, right-click Look), with the game divided into 3 Acts, set on two different planets and a space ship.  There are a variety of people - aliens - well, aliens are people I guess - to talk to, many inventory objects to use, misuse and possibly combine, and of course a mountain of different types of puzzles to solve.   If you like comedy sci-fi, pointing, clicking and puzzle solving, this is the game for you!"
  },
  {
    "game_name": "Z Dawn",
    "game_description": "IntroIn the burst of the Z virus, the world everyone knew ceased to exist. Lead a group of survivors throughout a zombie apocalypse in a fast-paced turn challenging game. Survive, interact, loot, explore, build, craft, defend, attack!DescriptionZ Dawn is a fast-paced turn-based with roguelike elements in which you have to survive in the aftermath of a zombie apocalypse. The ultimate goal is to find a cure and evacuate the survivors. To survive, you must scavenge for supplies and deal with many random encounters. Build, upgrade your encampment and deal with zombies, zombie bosses, raiders and much more!● Explore the wilderness left behind and find different locations● Search for resources, weapons, ammunition, clothes, food, medicine● Manage survivors individually and equip them accordingly to their favorite skills● Build, upgrade and fortify your encampment to withstand the hordes of zombies● Assign survivors to different tasks like farming, a guard in a watchtower, builder, mechanic● Explore many different locations for items, help strangers, invite them to join your group● Craft and upgrade equipment● Deal with different events and choose many possible outcomes● Deal with other survivors and their respective encampments● Repair and upgrade vehicles to drive and defend● Deal with hundreds of thrilling events with many possible outcomes...And much more!"
  },
  {
    "game_name": "Porsche Hall of Legends VR",
    "game_description": "The Hall of Legends is an exciting VR brand experience based on momentous stories: Witness iconic moments from the history of Porsche Motorsport, discover the secrets behind the success of Porsche, and collect the Porsche DNA to unlock the new Porsche Formula E car.From the past into the futureThe main components of the Hall of Legends are five vehicles that symbolize Porsche's decades of success and demonstrate Porsche's innovative character. The vehicles Egger Lohner C.2 Phaeton (1894), 550 Spyder (1954), 917 (1970), Tag Turbo (engine; 1981) and 919 Hybrid (2018) can be virtually explored. Each vehicle offers you information and anecdotes, together with an influential individual from the respective era.On top you can \"relive\" iconic moments from Porsche Motorsport history e.g. like waving the checkered flag, while standing on the Le Mans racetrack as the Porsche 917 crosses the finish line to perform the first overall victory at Le Mans in 1970. Or you can become the co-driver in the 550 Spyder at the Mille Miglia 1954, where Hans Herrmann and Herbert Linge ducked away under a railway barrier at the last moment and thus escaped the approaching train. Find out how these and other stories are related to Porsche's numerous victories. As a reward, you will get an insight into the future of Porsche Motorsport: the new Porsche Formula E vehicle. And not to forget: Meet Ferry, the virtual Archivist, keeper of all knowledge from 70 years of Porsche.WARNINGApplication not suitable for people with fear of heights.Some may experience discomfort (nausea). Don’t play this game if you are susceptible to motion sickness."
  },
  {
    "game_name": "SCALPERS: Turtle & the Moonshine Gang",
    "game_description": "Scalpers: Turtle & the Moonshine Gang is a fast paced, action packed and skill-based multiplayer shooter where you enlist with the infamous Scalpers in a frantic hunt for bounty!Play together with your friends, solo or join other Scalpers online in this intense explosive and bullet filled co-op shooter. Take down giant bosses and their swarming hordes of minions.  Choose from a range of weapons, abilities and characters that fits your play style and compliment the team. Master this hardcore co-op through different difficulties with progression based loot system, and fight for your team’s survival and success.FeaturesFast-paced multiplayer action in an epic western setting.Epic boss battles with challenging and advanced mechanics. Up to 4 player online co-opUp to 4 player local co-opUp to 8 player PvPFully re-bindable gamepad supportObjective based levelsFour difficulties to master Expert+ mode (infinite difficulty scaling)LeaderboardsA variation of load-out options at your disposal; weapons, abilities and characters.Collect upgrades via progression based loot systemTelegraph-based battle system"
  },
  {
    "game_name": "Train Ride Simulator",
    "game_description": "You are about to discover an incredible railroad experience. Travel like a real train driver through the stations of California. Do you like train and railroad driving simulation? Train Ride Simulator lets you drive the iconic locomotives on high-speed services, on long freight runs or in precise commuter traffic.Show great control, carefully managing power, speed and brakes, and be careful not to derail your train. Feel the thrill of a hyper-realistic train simulation game.More than 10 types of trains, each with different skins.Drive with passengers and material delivery to real locations in the state of California.Select the railroad you want to travel on.Weather and day/night effects.Connect wagons to complete different quests.Track your progression.Easy train control.Realistic graphics and sound effects. Continuous updates with new quests and trains.From the developers of 'Theme Park Simulator', a game that already has over 500,000 downloads.If you are looking for a train game with an amazing driving experience, Train Ride Simulator: Train & Railroad Driving is your game."
  },
  {
    "game_name": "Shipwreck",
    "game_description": "Shipwreck is a top down adventure game in which you must travel the land, explore dungeons, and defeat monsters to earn safe passage off the island on which you are stranded."
  },
  {
    "game_name": "X-Plane 10 Global - 64 Bit",
    "game_description": "X-Plane 10 Global is the latest version of a simulator that has been in development continuously for almost 20 years. This latest version of X-Plane 10 brings numerous improvements and enhancements for PC, Mac and Linux virtual pilots, unleashing the power of modern systems with its 64 bit processing and multi-core support.Designed to be the most flexible flight simulator it has a fully open structure that allows the enthusiast to change every part. With thousands of compatible add-ons there is no kind of flying craft that is not simulated and there is a whole world to explore.Boasting a 20 year old pedigree, X-Plane utilizes Incredible cloudscapes to bring the sky to life whilst the ground depicts real-world roads, cities, towns and more to ensure the most realistic flying experience possible. The completely new rendering engine shows the world around you in high detail and with global illumination so lights behave like real lights.The  core is a virtual wind tunnel that creates the most realistic flight modeling available on a desktop.  Equally capable of simulating every type of aircraft, the virtual pilot is able to experience the challenges of flying big airliners or tiny ultra-light aircraft. The realism of X-Plane 10 Global is proven by the fact that X-Plane is used as a certified training tool. Each aircraft flies just as it should, from the glider to the Space Shuttle!Air Traffic Control will guide you from startup to shut-down and also controls the other aircraft around you. Those other aircraft are not robotic as they are in other simulators, but they interact with the world in the same way as your own aircraft does. They will fight the same cross winds and turbulence as you encounter, they will need more runway to stop when the weather conditions are not favorable. Just like real pilots do, you will watch their take-off to be prepared for what your take-off will be like. It’s still simulated but it gets very close to real aviation!X-Plane 10 Global is built with the future in mind and makes full use of the hardware in your system. If you own a fast multi-core machine you will be able to simulate more aircraft around you and see more details but even with a moderate machine X-Plane 10 Global is capable of displaying a tremendous amount of objects without slowing down.FeaturesSuper accurate flight characteristics using a virtual wind tunnelIncludes 30 aircraft, from gliders to the Space ShuttleOnline flying with other virtual pilotsAir Traffic Control actually controls the other aircraft around youAccurate terrain, roads and moreGlobal ‘Plausible World’ auto generated sceneryNew rendering engine with innovative global lighting64 Bit optimizedTotally flexible and extendable with thousands of existing add-ons (and many more to come)Includes super-detailed scenery for Nice (LFMN), Paderborn-Lippstadt (EDLP) and Faro (LPFR)printed “Quick Start Guide” includedDefault SceneryHaving installed the software via Steam you only have the main simulator as well as the Seattle region. More scenery has been divided into various free and optional DLCs. Installation of said DLCs is quite simple and is done very fast. Guide:"
  },
  {
    "game_name": "Spartoi Meadow",
    "game_description": "Main featuresARPG where you explore the area, defeat the boss, and aim for the next area.Find warpable checkpoints to make your adventure easier.You'll be able to see through the enemy's actions, level up, get better equipment, and defeat the enemies that stand in your way!If you feel that the battle is not going well, take a look at the situation.Guard, which completely prevents damage, activates when you're not doing anything.It also activates while walking or dashing.[Those who might enjoy this game]Those who like hunting action and fighting game boss battles.Those who like to avoid or deal with attacks without using invincible moves.Those who like to observe and make predictions."
  },
  {
    "game_name": "No Longer Home",
    "game_description": "Bo and Ao are graduating university and preparing to leave the flat they’ve lived in together for a year. Thanks to visa limitations, Ao is forced to return to Japan, leaving Bo in England. Disillusioned by post-educational life and shoved aside by a government who doesn’t want them there, both are trying to come to terms with their uncertain futures. And deep under their South London flat, something grows...Wander through an intimate flat and examine the everyday belongings of Bo and Ao. Have BBQs, play video games, and stay up late just talking in bed. Follow the day to day activities and conversations of two queer, non-binary students and their friends.  Get to know Lu, the multi-eyed, animal-like new flatmate. No Longer Home was born when the developers were similarly forced apart after university, and decided to stay in touch by working on a game together. Development duo Hana and Cel chose this project as a way to explore and express the emotions that came with saying goodbye."
  },
  {
    "game_name": "Nanairo Reincarnation",
    "game_description": "Content WarningAbout the GameStoryKagami Makoto is in his 3rd year of college when he inherits the estate of his late grandfather and starts planning out what he's going to do with his newfound home. However, his plans are foiled when his childhood friend Iyo, who turns out to be a zashiki-warashi, introduces herself, looking exactly the same as he remembers her from over a decade ago. Then, a woman named Kikyou, who claims to be a demon, also appears before him. After that, it isn't long before a pretty detective at the police department comes knocking on his door, imploring him to take up his family's duty of helping wandering spirits pass on to the afterlife and assist the police with any and all supernatural crimes reported in town. But when a case that's bigger than any of them ever imagined comes his way, will he be able to handle it? With the power of clairvoyance, an ability passed down through his family that allows him to see spirits, maybe he and his demon familiars can pull through, and he can be a proper successor to his family's legacy.CharactersFeaturesMultiple routesBased on the original Japanese PSVITA versionArt by Sumeragi KohakuFully voiced in Japanese (except for the main character) Scenario by Kazuki FumiMusic galleryCG galleryScene mode"
  },
  {
    "game_name": "Shadows Peak",
    "game_description": "MY NEW HUNTING HORROR GAMEAbout the GameShadows Peak is an atmospheric, open-world horror game focused on exploration that doesn't hold your hand.The main focus of the game is on the atmosphere, story, and exploration. Unlike most horror games, Shadows Peak allows you to explore large environments and progress through the game in a non-linear way.You play as the writer Tom Blair who has decided to visit a mysterious place called Shadows Peak to gather materials for a new book about legends. A number of people have gone missing in Shadows Peak. Some people claim that they saw something that they shouldn’t have been able to see there and, of course, there are some dark legends surrounding this place.Key FeaturesLarge environmentsNon-linear gameplayNo hand holdingMysterious storyHaunting atmosphereGamepad support for 50 controllers"
  },
  {
    "game_name": "Lawnmower Game",
    "game_description": "IntroductionLanwmover game where player drive lawnmower and cut grass in big open world which contain grass, houses and other obstaclesGameplayDrive lawnmover in open world and only job is to cut every cuttable grass in open world. After cutting all grass, it will respawn.Lawnmover has also fuel consumption. Pick-up Jerry cans and add fuel. After fuel is empty player will respawn to start locationThere is score system that player can get score with any grass player has cutted. Enjoy the game, cut all grass and be the lawnmower king......"
  },
  {
    "game_name": "Ghost Cleaner",
    "game_description": "Ghost Cleaner is a combination of arcade game and puzzle game. At first glance it is very straightforward, as you use a gun to destroy pink bricks. But the game requires you to use both strategy and tactics to finish every level. Try it once, and you'll be coming back for more! Physics BasedLots of variety across all the levels.100 levels to complete!Low price for fun game that's easy to play."
  },
  {
    "game_name": "Starkid's Obstacle Course",
    "game_description": "STARKID’S OBSTACLE COURSE is a skill-based game that has you problem solving the whole way through. There is no shooting, there are no explosions, and the rules are very simple; Find your own path through each level without getting hit. There are 60 levels in the game, 10 levels for each of the 6 courses. Each level demands a unique understanding of its patterns in order to be beaten. Respawns are instant and the levels are short. Savour your failure as you come to understand the subtle secrets of each level. Think you're up for the challenge?A perplexing challenge lurks beneath this game’s simple appearance.Lose yourself in focus.Inspired by The World's Hardest Game, I Wanna Be The Guy, and the complex patterns found in bullet-hell boss fights."
  },
  {
    "game_name": "Boinks",
    "game_description": "Populate the screen with the happy Boinks. Fill enough of the screen to progress to the next level. USE THE MOUSE - LEFT CLICK AND HOLD TO INFLATE THE BOINKS! RELEASE TO DROP!Boinks will pop if they hits a foe while inflating! Move away from danger by moving the mouse.Boinks will drop early if you bump them into other objects.FEATURES:16 unique character voices8 seasonal environmentslarge giggling ballswholesome fun for the whole familyfriendly foesdeviously addicting puzzle elementbest personal scoreeasy to play, impossible to masterdid you read the bit about the large giggling balls?"
  },
  {
    "game_name": "EURGAVA™: Tomb of Senza",
    "game_description": "Decades after all the events in EURGAVA™ - Fight for Haaria, everyone in Shartemen face a much bigger problem than raiders or goliaads: A lethal miasma is spreading throughout all realms. Death by dormant magic. It has no cure. People fall ill to it, and eventually die within a year. You know there will be no hope for you if you give in to the sickness. And so you came to the Tomb of Senza, in the mountainous lands of Dokia, to find out how to end the miasma...Know that you are not the only one involved in this struggle. The Naga Cult is onto you. The Pilgrims cannot help you yet. And the locals are too scattered and wary to stand their ground against all the monstrosities in Dokia. Will you survive?A sidescroller beat-em-up where battles are segmented in areas and rounds.Start as a foreigner in a land where the locals are wary and suspicious about you.As you make your fame and fortune, the people will open up and tell you what to do.Some of them may even fight on your side, in their own way. But...Remember your sickness. Time is NOT on your side.Pay attention to the day count!Many weapons to collect and master, each possessing two types of attack style. Have fun!Many types of magic charge that can get stronger as you grow with experience.Dodge or jump away from enemy attacks!Benefits from equippable trinkets and usables.Autosave your progress every time you stop at the resting point. Don't worry!Talk! You cannot help the locals if you do not know what they need.Decisions, decisions... Can't make everyone happy, after all...Use your map well. Don't get lost!==========RECOMMENDED : Xbox or similiar controller"
  },
  {
    "game_name": "CurryKitten FPV Simulator",
    "game_description": "Ever wanted to try flying a racing drone?  The CurryKitten FPV Simulator lets you try.  Take charge of a powerful and acrobatic quadcopter and learn to fly it around the mountainous landscape.   Rip through the partly-constructed building, bash into the beach ball, chase cars or fly up close and personal with an AI plane.  Play alone or online with friends.  This sim is friendly enough to learn on with a basic game controller but will excel when combined with a hobby-grade RC radio.This simulator is being constantly being developed and new features are arriving regularly.  The community all get a chance to have their say into what is developed next, but current improvements/features include - - Interactive flight training - Quad ball, the online football-like game.... but with quads - More interactive buildings, like cranes and bridges - increases customization in camera FOV"
  },
  {
    "game_name": "Super Jigsaw Puzzle: Monuments",
    "game_description": "If you like to make puzzles, Super Jigsaw Puzzle: Monuments is your game.Visit some of the most relevant monuments in the world enjoying its comfortable and intuitive interface and its relaxing music that will allow you to concentrate on the difficult task of solving these beautiful photos that suppose a real challenge for puzzle lovers.Solve puzzles to unlock new ones even more difficult. Up to 30! You will always have several available, do not get stuck!Drag the pieces to their position, form groups with them or use the available boxes to divide them by colors.Configurable snap system to avoid stress. Features 30 different puzzles Autosave, you will not lose your progress 4 levels of difficulty (40, 80, 200 and 400 pieces)  You can form groups with the pieces and combine them together  Configurable snap 5 different interfaces Relaxing music and atmosphere"
  },
  {
    "game_name": "HYPERCHARGE: Unboxed",
    "game_description": "HELP SGT. MAX AMMO TO DEFEAT MAJOR EVIL AND SAVE THE HYPERCORE!There was once an ancient line of action figures, who created a magical power source that would allow humans to keep their favourite childhood memories of their toys. This ancient power source is known as the Hypercore. Inside the Hypercore are the beloved memories of our favorite toys. If Major Evil destroys it, these memories will disappear forever. Defend it with everything you've got, or see our cherished toys turn into lost treasures of the past!If you grew up watching classic toy movies and playing with action figures, get ready for the ultimate action figure game! Hypercharge takes you back to the original drawing board of action shooters, with no pay-to-progress, weapon meta, or slide cancelling. Just simple, light-hearted, casual fun!  Key Features1-4 player online/local co-op. Full split-screen support including online/local. Single player/offline play with player bots. Difficulty scales based on the number of players. Wave-based shooter with story campaign. Classic PvP game modes. (up to eight players) First and third-person camera modes.PLAY CO-OP WITH YOUR FRIENDSWork together as a team to defend the Hypercore. Grab a friend, break out of your toy packaging, and get ready to fight waves of classic toys. Prepare for each wave by searching for weapons, resources, and even hidden secrets. OFFLINE PLAY FOR SOLO PLAYERSNot everybody likes to play online. Hypercharge supports Offline, Split-Screen and Local play. You can progress and unlock everything in-game while playing solo. SPLIT-SCREENGrab a second controller and jump in! Hypercharge lets you play the entire game in Split-Screen, with up to four-player co-op and PvP, both Online and Local. Team up and experience it all side-by-side on the couch.PLAYER BOTSDon’t have a team to play with? Don’t worry, we’ve got you solo players covered. Player bots listen to your commands, collect resources, and even help to build defences. UNLOCK ACTION FIGURESEarn unlocks the old school way, in-game with hard work! No Pay-to-Win nonsense. PLAYER VERSUS PLAYER MODESGo head-to-head against other action figures as you fight to become top of the scoreboard! Classic PvP modes include Deathmatch, Team Deathmatch, Capture the Battery, Infection, and King of the Hill."
  },
  {
    "game_name": "Asterix & Obelix XXL 2",
    "game_description": "By Toutatis! The indomitable Gauls are back with a new video game!More than 10 years following their last appearance on games consoles and PC, Asterix and Obelix are back and in better shape than ever! Asterix & Obelix XXL 2 is a superb blend of action and adventure for all ages, with a winning combination of comedy and brawling.But where has Getafix gone? The long-bearded druid has disappeared after betraying his own people for Julius Caesar! The Gaulish village is in uproar! They must find out the truth! Always ready for a fight, Asterix and Obelix are sent to Rome on a mission by their chief Vitalstatistix. There, they find a new amusement park - Las Vegum - built by the famous Roman emperor. To what end? What is Getafix hiding?play As Asterix and ObelixExplore Las Vegum with the inseparable Asterix and Obelix, not to forget their faithful companion Dogmatix, who will be no small help in facing the Roman legionaries. And he will not be your only ally, as the unrivalled magic potion remains your number-one weapon against the Romans!Switch between the shrewd Asterix and the superhumanly strong Obelix to take on the hordes of Romans, solve puzzles and overcome the many challenges that lie in wait!a Unique and Immersive AdventureDiscover the huge amusement park Las Vegum, never before seen in the franchise! Our two happy adventurers make their way through this richly detailed and colorful world, which remains faithful to the iconic series of comics created by Goscinny and Uderzo. Playing Asterix and Obelix is an experience that is truly worth a trip all the way back to 50 BC!a Game For All AgesWhether you're a diehard fan of the Gaulish tribe or have just discovered their adventures, Asterix & Obelix XXL 2 is an accessible game that's enormously fun to play. You can also enjoy the many references to be discovered. It's hard to not to love the game's endearing characters and environments. There are special bonuses to be found and a new difficulty mode for the more experienced players.an Updated VersionAsterix & Obelix XXL 2 brings the experience of the original game to an unparalleled level. The enhanced graphics pay tribute to the comic books and the gameplay has been totally redesigned to make fighting the Romans even more fun! It also features a new system to improve your attacks and the ability to set yourself special challenges!"
  },
  {
    "game_name": "Magic Blast VR",
    "game_description": "\"Have you ever wanted to fight with magic?\"\r\n\"Magic Blast VR\" is an action game to fight with magic in VR!\r\nIn this game you can create original magic, and fights a lot of enemies.\n\r\nThis game features \"Magic Form\" system.\r\nIt can set your own form and shoot magic!\r\nYou may be able to reproduce the special movement of your favorite character..."
  },
  {
    "game_name": "JASEM: Just Another Shooter with Electronic Music",
    "game_description": "Do you need any reason to shoot your enemies in game? Because JASEM doesn't give you one - just you, your weapons, crazy beats and enemies. And you need to shoot every one of them, and it's up to you to make it the most hilarious and explosive way.So, JASEM: Just Another Shooter With Electronic music - is:Whirlwind gameplay;Gunfight non-stop;Fighting enemies, no dancing around their slow bullets;Juicy low-poly effects;Crazy physics - you can do improvized stealth or create shortcuts;Epic Bosses;No story, narrative and even texts at all (except of seizure warning, because, you know, if you know the way of warning about it with no text, pls let me know).Taking into account the last item, here is the perfect place for game credits:Game design, programming, bugs creation and a lot of stuff you don't want to know about - Stas Shostak;Music: Ira Lobanok;3D-models: Aleksandr Palmov;Testing, creative help, insulting of devs and other invaluable help - Max Efimov, Sergey Mozharovskiy  and other awesome guys."
  },
  {
    "game_name": "WOODS Part I",
    "game_description": "Everything happened so fast… And even if people could have seen it coming, what could they have actually done? David was one of the ‘lucky’ ones. Far from the chaos, yet he felt the impact all the same. Now, trying to understand everything that happened, he found himself returning to a place that called to him. A place that offered the best possible chance for his survival… The Woods.In spite of everything, David is determined to survive. So with his trusty ax he spends his days chopping and preparing wood -Keeping the fire stocked to stay warm and fend off from the creatures of the night -And to help clear his mind and relax, even play his guitar -However, don’t get too comfortable. When Winter ends he will find himself having to fend for himself all the more with fishing, trapping, and hunting.But in the end, will this be enough?Welcome to the Woods. In the first Part of Woods you have the seemingly easy task of simply keeping a fire going, and protecting yourself from the cold in winter. Chop wood, feed the fire, and survive. A simple task at first, but once Winter wanes, the challenge is increased as David will have to learn to fish, make traps to catch small animals, and eventually learn to hunt to survive. Along the way, learn about Davids story from his past and why he must survive.In the Woods there are no heroes. Just you, the elements, and the will to survive."
  },
  {
    "game_name": "SIMULACRA",
    "game_description": "From the creators of Sara is Missing, SIMULACRA is a spiritual sequel to the highly acclaimed \"found phone\" horror game.You found the lost phone of a woman named Anna. In it, you see a desperate cry for help in the form of a video message. The phone behaves strangely as you dive deeper into it. You talk to her friends and they have no idea where she is. Her texts, emails and photo gallery provides fragments of information. It's up to you to piece it together.Recover lost files, piece back corrupted data, and retrace her final steps. Find her before it's too late.SIMULACRA is an immersive narrative thriller using the interface of a mobile phone. Like all phones, you have messages, emails, gallery and all kinds of apps to look through. With a strong focus on realism, the game's characters are played by live actors and shot at real locations. Dive into Anna's life as you look at her private photos, go through her dating app or view her personal video logs.FeaturesExplore a fully realised world through the lens of a mobile phone.Enjoy a unique gameplay experience through popular phone apps, including a dating app, a social media app and a web browser.An expansive narrative with hours of gameplay that leads to 5 possible endings.Filmed with live actors and an extensive VO cast.Solve the recurring image and text decryption puzzles to learn more about Anna’s story."
  },
  {
    "game_name": "Monster Girl Incursion",
    "game_description": "On a small island in the west of the kingdom, the residents have been fighting against more and more aggressive monsters recently and all other adventures have failed so far. Your unconventional fighting methods have already gained a reputation among the adventurers and the guild headquarters asked you to solve the emerging problem as a last resort.Monster Girl Incursion combines simple and fun gameplay with cloth losing monster girls.Fight against 24 different opponents, each with unique mechanics that mainly require reaction, cleverness and practice."
  },
  {
    "game_name": "Astronomy Lab on PC: Relativity, Lunar Landing, Space Flight, and Interstellar Travelling",
    "game_description": "Astronomy and geography laboratory (spacecraft, solar system, earth, moon, relativity, flying over the world, etc.)The laboratory contains 4 sub-games. Through these sub-games, you can experience the magnificence of the universe, the beauty of the earth, the spectacle of the moon and the completely different world you see while driving a spaceship at a speed close to the speed of light. The influence of relativity. Our team comes from the California Institute of Technology and the Department of Physics at Oxford University, and integrates physical science formulas into visual effects.Laboratory scenario 1: Traveling in the lunar systemYou will find yourself in the satellite control room and can observe this beautiful planet in the geostationary satellite orbit. You will see the Himalayas, American metropolitan areas, Amazon forests and densely changing clouds. We have shaped the earth that simulates the world with extremely high resolution! Of course, there is also the moon. You will experience the Apollo landing on the moon, come to the surface of the moon in person, see countless impact craters, and experience the special gravity field of the moon (far lower than that on the earth). Please remember not to fall into a meteorite Impact craters, because some meteor impact craters are several kilometers deep. Together with your children, you can observe the earth’s terrain, clouds and the bright lights of the night city from a completely different perspective.Experimental scenario 2: Wanderers in the solar systemWe are used to being numb and chasing fame and fortune. When do we really calm down and take a look at the world we live in? Let go of your worries and drive your spaceship to travel through the solar system and explore the planets.Lab Scene 3: Travel around the world in a hot air balloonTravel in a hot air balloon and enjoy the colorful world, such as:Castles on the island, volcanic eruptions, urban ruins, eastern villages, etc.; here you can move the hot air balloon through the keys on the computer keyboard.We will continue to add more attractions, and then release new updates.Experimental scenario 4: Traveling at 80% speed of lightThis is a simulated laboratory that can take you to travel in a world where the speed of light is slow. This allows people to have a direct experience of the special theory of relativity, which has the same spirit as George Gamow's \"Mr. Tompkins Adventure\" (1939). We have experienced various relativistic effects (for example, length contraction, time dilation, Doppler shift, optical aberration) during travel-to gain insights and deepen our intuition for the basic concepts of special relativity."
  },
  {
    "game_name": "Robotic Learn",
    "game_description": "Incorporate the role of a robot that aims to go through several puzzles to increase the intelligence and cognitive capacity of Artificial Intelligence it serves.\n\n\r\nIn Robot Learn, you need to solve puzzles to find the exit and advance through the levels.\n\r\nThe game has a first person view, with simple mechanics, where you must pick up the boxes of each of the connectors to activate elevators, points and mobile platforms to reach new points in the levels.\n\r\nMain features:\r\nUse energy blocks intelligently to activate platforms, elevators, bridges and doors to access new levels of the factory.\r\nUse all your skill to get through all the traps that are present in each level."
  },
  {
    "game_name": "Block Legend DX",
    "game_description": "Block Legend DX is a retro puzzle JRPG. Travel through different regions as a wide cast of characters, fighting monsters, visiting towns, and completing quests. The DX version introduces improved and additional features and soundtracks! \n\r\nKEY FEATURES-- \n\r\n• Addicting puzzle tile-breaking gameplay. \r\n• Huge selection of heroes to choose from. \r\n• Tons of monsters to fight. \r\n• Take down powerful bosses. \r\n• Visit multiple regions. \r\n• Over 100 quests to complete. \r\n• Unique adventures every play through. \r\n• Controller and multiple aspect ratio support! \r\n• Brand new Steam Achievements! \r\n• All new modes to explore! \r\n• Brand new music and collection! \r\n• And many other surprises! (it wouldn't be fun if we spoiled EVERYTHING now would it?) \n\r\nCONTACT DOT WARRIOR GAMES-- \n\r\n• Twitter: @DotWarriorGames \r\n• Facebook: facebook.com/blocklegend \r\n• Web: dotwarriorgames.com \r\n• General: dotwarriorgames@gmail.com \n\r\nTHANK YOU-- \n\r\nFrom us here at Dot Warrior Games. Thanks for checking us out and we hope you enjoy the game! ありがとうございました！"
  },
  {
    "game_name": "Dangerous Lands 2 - Evil Ascension",
    "game_description": "The evil lord was destroyed, everyone thinks peace will go back to these Dangerous Lands.But everyone was wrong, a new evil is becoming greater, minions are coming to get revenge on his master.Join the dark side to bring prosperity in the evil ascension.Choose your servant and bring chaos to these lands.Game features: - Action RPG game combat mechanics- Simple storyline to follow- Level up your character to increase stats and activate new magic powers- Use new magic to get an advantage over enemies- Fight with lots of different enemies- Get coins to purchase items and equipment that will make your journey easier- Use potions and ethers to recover your HP and MP- Complete Sidequests to receive experience and coins to become more powerfulDon't forget, always save your game, this game doesn't have auto-save features. You can save the game in the pause menu."
  },
  {
    "game_name": "READY AIM FIRE",
    "game_description": "Have you ever dreamed of becoming a tank pilot? What if you are on an elephant toy battling around in your child-hood toy room? Operate your favorite toy tank mechanically but easily to explore through the cartoon-styled world. Search for the targets, and Ready, Aim, Fire! Feel the burst of pleasure and taste the joy of victory! Break through the wall to carve out new path. Defeat the enemies and win the random spawning treasure box. Build up your skills by battling against AIs of different levels. Team up with your friends and enjoy the fulfillment of brainstorming through tactical winning.\n\r\nIn Ready Aim Fire you get to ride on your favorite toy tank that looks like an animal. Tell your toy to move front or back, turn left or right by reaching out and pulling intuitive levers or handles. Grab the bomb you like and load it to get ready for firing. Aim the target by turning around with levers and tell your toy to Fire by pressing a button at the desirable timing."
  },
  {
    "game_name": "Delicious! Pretty Girls Mahjong Solitaire",
    "game_description": "The Pretty Girls are back and they're delicious! Check out an upgraded version of Zoo's top selling Pretty Girls Mahjong Solitaire with 8 new girls and a new candy flavored theme. Match pairs to reveal a Pretty Girl in a sexy outfit hiding beneath the mahjong tiles. Do you have what it takes to clear all the tiles for your Pretty Girl surprise?!■ Classic Mahjong Solitaire rulesFind pairs of tiles to delete them.Delete all tiles before time runs out to clear a round.Think strategically when deleting tiles, or you might run into a dead end!100 patterns of tiles.The tiles get shuffled every time you play, making it fun to play again and again.■ Pretty Girls are waiting for you!The game contains 7 Pretty Girl characters and a bonus character when you complete all stages. In each stage, once you make it to the third round a girl in a sexy costume begins to reveal herself as you delete tiles. As you clear stages, the girls get more and more delicious! All characters include sexy voices in Japanese.*This game is a character and theme replaced version of \"Pretty Girls Mahjong Solitaire\".*This is a puzzle game with sexy characters but no nudity.*Characters and character images used under license from their respective owners."
  },
  {
    "game_name": "Blocks!: Julius Caesar",
    "game_description": "Blocks!: Julius Caesar is a local and online two-player wargame that brings the drama of the Roman Civil War (49-45 BC) to life. The two players take control of the legions of Caesar or Pompey and fight to determine the future of Rome: Republic or Empire. Famous characters like Marc Antony, Cleopatra, Octavian, Scipio and Brutus all also play key roles, along with legions, cavalry, elephants, ballistas, auxilia troops and galley ships.The victor will become the sole Master of Rome!The map board depicts the major theaters of operations during the Roman Civil War, i.e the Mediterranean sea and surrounding areas, from Spain to the Middle East.The object of play is to seize as many as possible of the Victory Points cities on the map. Major cities Rome and Alexandria are worth 2 VPs, the other eleven cities are each worth 1 VP. Killing the three enemy's leaders also bring 1 VP for each. The first player at 10 VP wins the game.Will you become the Master of Rome, like Caesar, or will you perish, as Pompey did historically?A game can be played against the Artificial Intelligence and in 2-player local Hotseat or online Multiplayer (NEW!) with your friends and fellow players on Steam."
  },
  {
    "game_name": "100 hidden eternals",
    "game_description": "My first 3D game!About the GameArt by Anatoliy LoginovskikhImportant informationPress \"N\" for night mode.Press \"Del\" then \"Esc\" to reset all achievements.Hidden object game in a surreal style.Black and white hand-drawn style.Animated puzzles.Mind blown.In the game you need to find 100 hidden eternals - the idols in the form of men. Some eternals are easy, some are hidden in puzzles. Remember that puzzles require extraordinary thinking!"
  },
  {
    "game_name": "Story of the Survivor : Prisoner",
    "game_description": "Story of the Survivor Prisoner is a Action RPG Game than takes place during a zombie apocalypse. \n\r\nThe world is dead and now there is no one to stop you from escaping the Prison.... or is it? Follow the story of Steve and his prison mates as they try to make their way to freedom. Use your thief skills to open lockers and doors to gain some useful items, create new weapons with crafting system. But as always remember zombies aren't the only thing you should watch out for.\n\r\nFeatuers : \n\r\n3 Playable Characters\r\n250 Items\r\n60 Weapons\r\nBosses\r\nCrafting\r\nHunger and Thirst System\r\nYour Mission is Escape from Prison Full of Zombies!"
  },
  {
    "game_name": "Nock: Hidden Arrow",
    "game_description": "Nock: Hidden Arrow is a stealth archery dungeon crawl that eschews the resource-management elements you'd normally see in a dungeon crawl in favor of focusing on an immersive dungeon delving experience.  The entire focus is on action and theme.  The ideas is to have minimal (ultimately no) UI, with all necessary information received through visual and audio cues, and physical feedback.Core gameplay consists of:Sneaking around to avoid detection.Luring monsters into more advantageous positions (eg alone) so you can happily murder them or slip past them unseen.Shooting stuff in the face.  Or the back of the neck.  I don't judge.More shooting stuff in the face.Throwing stuff.Solving classic dungeon puzzles.Note: Nock is a smallish VR game by today's standards, with a campaign that takes about an hour to complete, and an archery range to hone your skills on."
  },
  {
    "game_name": "Sexy Miss",
    "game_description": "Tonight we are up to meet 12 beautiful women! \r\nYou will meet them face to face, spend some time with them. \r\nMeet girls before the competition in 6 unique locations! \n\r\nYou can even place the women's minaitury in the world by yourself and then teleport to them to enjoy their beauty. \r\nYou control girls, you can change their position, animation and create your own show.\n\r\nDuring the competition you’ll be the judge - there may be only one SEXY MISS!\r\n3 special scenes are ready for the show!\n\r\nDon’t keep them waiting!\n\r\nFeatured:\n\r\n- Twelve Girls\r\n- Different outfits\r\n- Vote miss\r\n- 3 Different competition stages\r\n- 6 Different house stages\r\n- Miniature women stage\r\n- Pole dancing stage\r\n- Full control of the girl"
  },
  {
    "game_name": "Smash Ball",
    "game_description": "APPLY FOR THE CLOSED ALPHA TOURNAMENTJOIN THE CLOSED BETA @JOIN THE COMMUNITY ON DISCORDJOIN THE DISCORD COMMUNITY @About the GameCome one and all to the greatest competitive game in the Mech League! Smash Ball is searching the galaxies for mechletes, like you!Join us in arenas across the galaxy, playing in tournaments where you have two main goals:      1. Tear down enemy defenses in order to score goals.      2. Smash your opponents into the ground until they become nothing but a combusted pile of metal! Play this intense, high-octane game solo or with a partner. There is nothing that says “friendly bonding experience” more than cooperative destruction and chaos!Choose a variety of customization options to suit your mech's needs. Do you have a need for speed? You got it! Protection and tankiness? You got it! Health so you aren’t a frail mech that’ll burst into fire from the wind? You got it! If that isn’t enough, arm yourself with special power-ups to make your matches a bit more explosive. You never know what action might happen from match to match since no game will ever be the same!Play various tournaments in beautiful arena locations and with different game modes and power-ups to keep you on your toes. Dodge, defend, and destroy anybody that stands between you and total victory. Join different teams and showcase your pride as you secure victory from planet to planet. Smash your way to the top! After all, champions aren’t just born, they’re built!KEY FEATURESBite-Sized BattlesDominate the arena through quick and action-packed matches. Rally against your opponent as the ball gains more speed and destructive power. Utilize boomballs and power-ups to throw your opponents off their game.Fun with FriendsPlay 1v1 or 2v2 matches with or without power-ups! Get your friends to join in on the fun by playing against each other or just hop in an online game with your partner by your side.Team UpJoin one of the many teams available and represent their name and values as you climb the Smash Ball League. Want to be part of the gambler’s den or fight for Her Majesty of Aqualius? Go ahead!Customize Your MechChoose unique parts from a variety of manufacturers to put together your dream mech. Specialize your mech in health, speed, defense, power, energy, or a mix of them all! You can even customize your booster cards for a bit of extra damage during your matches.Cultivate the CrowdsGrow your fanbase as you climb the ranks of the Mech League! Go from rookie to champion as you unlock new parts and potential teams along the way.Easy to Play, Hard to MasterEveryone is welcomed in on the fun in Smash Ball, with simple objectives and controls to get you started. Of course, that doesn’t mean that you can’t pull off intricate plays with curved shots to KO your enemies to oblivion. Only the best of the best will truly be able to claim the top spots in the Mech League’s Smash Ball, after all. Fatally FunSmash Ball takes a futuristic approach to your favourite sports games with customizable mechs, loads of explosions, and a ton of chaos. Anything can happen in the Smash Ball arena, keeping the gameplay fresh and exciting. This means that while you’re focusing on keeping your goal safe and not getting smashed to bits by a ball that may or may not be on fire, you might have to watch out for flying mines, missiles, and much more headed your way!"
  },
  {
    "game_name": "Boom Island",
    "game_description": "Imagine being stranded on an island in the early 1900's, being a only survivor in a experimental plane crash. However, the island you crashed on is not a normal island, its Boom Island! Engage yourself in this arcade style first person shooter, where the main objective is to shoot highly explosive bouncing beach balls while staying alive. Immerse yourself with vintage effects and arcade style gameplay.     Gamemodes:Survival:A classic style of play where your objective is to survive an infinite amount of beach balls in various waves, as you survive the waves, your difficulty will gradually increase until you get blown up. EconomyIn economy mode, you will survive the balls while collecting money by killing them. You can use that money to buy various weapons, ammo, and health in the in-game shop.Protection:Similar aspect to survival, however your arsenal and mobility has greatly changed. Get strapped in to a giant mounted machine gun on your destroyed plane, as you flawlessly penetrate the explosive beach balls with ammunition, not being a problem.     More features:Partial Controller Support.Boom island allows you to use a controller to play. However you need to navigate through the menus with a mouse, as well as manually configure the controller binding in the control settings. Graphics CustomizationYou can adjust a ton of video settings such as v-sync, textures, Anti Aliasing and many more.Custom ControlsChange keys and their mappings to your own liking in the settings.What are you waiting for? Go head to the island and good luck."
  },
  {
    "game_name": "Super Glitter Rush",
    "game_description": "30 cute and unique bosses are waiting for you in a colorful world of pixel art.But don't let your guard down just because they're cute! These bosses shoot lots of bullets!The hail of bullets might look hard.But don't worry.With special bullets that catch your opponent's bullets, you can shoot them all back!The more you catch, the stronger you get!FeaturesPerfect for people who like cute things and want a game they can start enjoying right away.30 unique bosses!8 playable characters with different abilities!Supercute chiptune soundtrack!"
  },
  {
    "game_name": "Hentai! Zombie! Defense!",
    "game_description": "All the ladies of the world have been consumed by a ravenous hunger. As the last man on earth it's your duty to slay as many as you can. The more you slay, the more Hentai you unlock... so go forth and slay them all!Wield a variety of weapons including! Heavy Machine Gun AK-47 Revolver Alien Ray Gun Pump-Action Shotgun 5-7 PPSh-41"
  },
  {
    "game_name": "Piñata Attack",
    "game_description": "Piñata Attack is a party experience where the headset wearer attempts to defeat the Piñata in as short a time as possible. Whats the catch? The rest of the party gets to control the Piñata on the main monitor! Oh, and the Piñata fighter is blindfolded in VR. Peer through the blindfold, catch the rope with your bat, do anything you can to cheat your way to the fastest time.\n\r\nControls:\r\nMouse XY:       Horizontal Piñata Placement\r\nMouse Scroll:  Vertical Piñata Placement\r\nVR Controller: Swingable item"
  },
  {
    "game_name": "The Legacy: Forgotten Gates Collector's Edition",
    "game_description": "\"The Legacy: Forgotten Gates\" is a hidden-object adventure game packed with mini-games and puzzles, telling a story of a journey to another world, where danger and unexpected turns of events await around every corner!\n\r\nIt was late evening and the museum was almost empty. At the Maya artifact exhibition, one of the exhibits suddenly started to move. The sound drew the attention of a young woman named Diana, a museum employee and an expert in Mayan culture. When she came closer to the artifact she realized it looked like a portal... and suddenly some unknown power lifted her up and teleported her to an ancient temple! Now Diana has to figure out where she is, how she got there and how she's going to return home. The young woman encounters a civilization similar to the Mayan culture, but this is neither the past nor a parallel reality. It's another planet, connected to Earth centuries ago by some special gates. And now the gates have been activated again...\n\r\nOnly Shaash, the local shaman and gate keeper, can help Diana return home. But that will not be easy. Diana will have to face numerous tests, travel far through the Endless River Valley, encountering the strange people and wondrous animals of the other world, while trying to hide from all dangers and solving dozens of different challenges on her way.\n\r\n- Multiple wonderful locations and stunning graphics\r\n- Unexpected plot turns\r\n- Unforgettable characters\r\n- Fascinating mini-games and puzzles"
  },
  {
    "game_name": "Sir War-A-Lot",
    "game_description": "When Sir-War-A-Lot’s life of peace and tranquility is shattered by pesky monsters he tries to stay calm, but then one day they spilled his garbage and there are two things you never do to a man.You never kill his dog.And you never spill his garbage.Especially when that man is Sir War-A-Lot, a man with anger issues.Sir-War-A-Lot is a pixel 2D Indie  action platformer where you explore and fight your way through different levels in your quest to kill the monsters who wronged you.Along with hacking his enemies to death Sir War-A-Lot can also hurl his sword at enemies and recall it at will allowing him to slay over a distance and get creative.In Sir War-A-Lot, levels are not always traversable by traditional means, but luckily Sir War-A-Lot can use his sword as a make shift spring board to get around – a critical skill to master in order to get through this game."
  },
  {
    "game_name": "Art of Murder - FBI Confidential",
    "game_description": "New York is reigned by fear from a serial killer. The Police are trying to find any clues that would lead them to the murderer. Every time the Police find only a signature of the killer: he leaves artefacts from South America behind. A ghost-hunt begins.\n\r\nBecome Nicole Bonnet: a young female FBI agent and accept the challenge! Who is the murderer? A psychopath or maybe a meticulous and intelligent man? To solve the mystery you have to start thinking like the felon.\n\r\n- Classic point and click adventure game.\r\n- Tense plot and surprising turning points.\r\n- About 100 difficult tasks.\r\n- 200 detailed locations creating the atmosphere of the game."
  },
  {
    "game_name": "room13",
    "game_description": "Pick a FACE.  Build your KILL MACHINE.  Slaughter the DEAD.room13 is a thrilling combination of violence, extreme gore, amazing graphics, simple controls, fun and humor.  When you find yourself trapped in a mysterious house being overrun by the dead you do what anyone would.  Slaughter them, collect their organs, build some guns and kill some bosses.GameplayCreated by a one-man development team, room13 is an Action Platform horror game with heavy weapon building and customizing elements.  You start each run with a basic gun and a raw, half rotten face.  Travel room by room avoiding KillTraps, collecting weapon parts, and finding new faces to wear.  Fight your way through 12 Bosses and unlock the secrets of room13.Additional FeaturesNonstop pulse-pounding action13 uniquely dangerous rooms to survive with 13 even more uniquely dangerous bosses to battleThe ability to defeat a Boss and then wear their face and gain their powers.32 total faces to earn, unlock and wear as your own2 Game Modes (Story and Arcade)A customable kill machine with THOUSANDS of possible weapon configurations to assemble each time you playMelee weaponsOriginal soundtrack composed by Orb SoundwerxA reanimated Shark’s head because why not"
  },
  {
    "game_name": "Pocket Assault",
    "game_description": "In Pocket Assault you are pitted against infantry, snipers, jeeps, tanks, helicopters and drones. Hide behind protective barriers to stay alive while you aim and fire at enemy combatants. Some defeated opponents give you new weapons or additional health.\n\r\nIt’s a simple shooter that is easy to learn, and fun to play. Work your way through 13 progressively challenging levels while using every means at your disposal simply by tapping on the touchscreen of your chosen device.\n\r\nEach enemy you defeat increases your score and your mission meter. Fill your mission meter to complete each level. Precise timing and a quick aim are required."
  },
  {
    "game_name": "Enclave",
    "game_description": "Experience incredibly atmospheric and intense medieval combat action! Go ahead and enter a new world, the award-winning world of ENCLAVE!The people of Light and Darkness are divided by a bottomless rift that split the earth many millennia ago. The lands of light are an Enclave of truth and order surrounded by the twisted and barren lands of the dark, known as the Outlands. Over the centuries the rift has started to close…And now it is only a matter of time before the forces of Light and Darkness will clash in an unprecedented, merciless struggle for survival!Remember... When a storm comes up, for some it’s better to keep out of its way… while for others it’s time to block its path!FEATURES:Breathtaking combat actionAmazing 3D graphics with latest Shader technolgy support2 separate story driven single player campaigns: Light and Dark Campaign25+ highly detailed fantasy themed missionsSecret bonus games12 different playable character classes 5 mighty end bossesEpic musical score and impressive sound FX"
  },
  {
    "game_name": "Trenchfoot",
    "game_description": "Trenchfoot is just good clean local multiplayer fun for up to 16 friends. If you enjoy old-school multiplayer games like Bomberman, you're going to love Trenchfoot!Included in the current build of Trenchfoot is:Support for up to 16 local players9 powerups and itemsPlayers can place blocks. Blocks add a defensive aspect to the game. Blocks will stop explosions from spreading and can be used to shape dymanic ones.Flood explosions, these explosions will fill the space available to them. They flood around corners, scurry through bottlenecks and expand into open spaces. Players place tiles during the gameplay modifying the levelDestroyable blocks are the standard destroyable blocks players can place these. They create temporary barriers, and also continue to add powerups during gameplay.Water tiles are a player placeable tiles that stop explosions from spreading, but do not hinder player movementPipe tiles are a player placeable tile that funnel explosions and players through them. If an explosion gets into a pipe it will be directed through it until it exits. Once it exits it will continue to expand again until its magnitude is expended.Smaller maps built to support as few as 2 players with larger ones available for up to 16 players.The game now has music! It's a sweet upbeat happy tune made by a talented artist named Nom.Trenchfoot is a local multiplayer only game. There is no single content in the game."
  },
  {
    "game_name": "Antistatic",
    "game_description": "Antistatic is a crisp, uncompromising indie platform fighter built in a custom engine.Inside a crumbling digital world, atomic combatants carry out their programming in an endless series of battles over the remaining shielded landmarks.Online play — join one other player in online matches; online is still early in development, with much more in the worksFamiliar mechanics — shields, directional influence, lag-canceling, grabs, wavedashing, and moreFull GameCube controller support — play with the iconic platform fighter controller using the official adapter6 characters — all with different play styles, and more coming over Early Access10 stage layouts — some staples, and some newInternationalization AlphaRough machine translations available for: Spanish, French, Italian, German, Russian, Japanese, Korean, Simplified Chinese, and Traditional Chinese."
  },
  {
    "game_name": "Mark After Dark",
    "game_description": "Mark After Dark is a short dating-sim-esque rpg adventure about a normal guy just trying to find love.Based on real-life comedian Mark McCue, and heavily inspired by Leisure Suit Larry, Mark After Dark is a hilarious game where you must try to help Mark get laid.The game takes place in a fictional town in Alberta Canada, and you can follow actual Mark on Twitter!Features: Original artwork  18 Steam Achievements  11 Bad endings  3 Good endings Gameplay: Classic RPG style  Story-based / no battles  Short in length (that's what she said)"
  },
  {
    "game_name": "18 Wheels of Steel: Pedal to the Metal",
    "game_description": "Take your show on the road in the third installment of the 18 Wheels of Steel series! Drive your rig to make it big as you build your business. You’re not only a trucker, you’re a tycoon.You're the boss and you give the orders. You own up to 35 trucks, pulling your choice of trailers as you own the road.Dispatch 45+ cargo types. Keep this country movin’ while you build a trucking empire.Can you handle the big jobs? Damaged goods eat your profits. Keep it shiny side up maneuvering through dangerous changing weather conditions.Step on it. Stay one step ahead of the law as you rumble through 30 cities from Mexico to Canada and across rolling plains from sea to shining sea.You a hot head under pressure? Find out as you meet hazards head-on. Up against accidents, coppers, and Mother Nature, can you meet the deadline?Life on the road ain’t easy. Keep your 18-wheeler in tip-top condition, repair damage, and improve your rig with dozens of upgrades. Valusoft is a trademark of Ziggurat Interactive, Inc. All rights reserved. From big rigs to big business, you’re in the driver’s seat. Stop workin’ for the man. That fire in your belly is gonna take you straight to the top. Take risks, cash in, and upgrade your rig. Work hard and you might end up driving the whole show."
  },
  {
    "game_name": "House Flipper",
    "game_description": "You've got to earn it around here before you purchase your first property. No worries though! Luckily, there's plenty of work at your fingertips! Take job offers from nearby residents - clean up, paint walls, install heaters, showers, and air conditioners, or even furnish their whole property! Once the grateful clients pay you for your solid work, it's time to get your own house.Grab your hammer! It's time to take a bit of a rude approach and knock some walls down! Get rid of broken glass shards, litter, and leftover pieces of furniture, to prepare the place for a complete makeover! It's up to you to either meet every single requirement of specific buyers or make yourself a cozy office to grow your business in.Fortunately, you're not alone. The set of your trustiest tools is here with ya! With the help of your paint roller, window cleaner, plaster tool, mop, hammer, and of course, the mighty tablet, no renovation will scare you! Using those tools also gives you experience, which can be used to upgrade them and polish your skills, making your work even more pleasant.Regardless if you plan to create the house of your dreams, help the residents with their renovations or feel the need to smack some walls - House Flipper is here for You! So just sit comfortably, let go off your usual daily routine, and delve into the world of House Flipper... into your world!"
  },
  {
    "game_name": "Economica",
    "game_description": "A simulator of the real economy during a crisis.Briefly about the game - a helicopter with money.Reduce the number of unemployed and achieve economic growth.Use basic income, progressive tax, social payments, and if you don’t have enough money, print as much as you need!Inflation and deflation are unlimited!If you run the game you will see growth the number of unemployed, the deflation that will accompany it.I wonder if real GDP will slowly grow at the same time?When you get tired of watching this, try something! Features [/] various POPs, retirees and unemployed Real 3D map of nearby stars! demo version available![/]The continuation of the Economica will be a space 4x (read more \"Discounts(75%)&Announcements. Near Sol\")."
  },
  {
    "game_name": "Molecule Builder",
    "game_description": "This fun and engaging molecule builder will help you test out your chemistry knowledge. Feeling rusty?\n\r\nNo problem - we help you out with tips to refresh your memory.\n\r\nThere are three levels.\n\r\nFirst, you can practice your understanding of how atoms in a molecule bond. You will create the links between the atoms to form 3D molecules. You can even check if the molecule is stable before proceeding to the next step.\n\r\nOnce you are done building molecules. You can pick one and apply the VSEPR model to predict the molecule’s geometry. Maybe you know where we are going with this. This is an important first step in being able to predict the molecule’s Polarity.\n\r\nThe last of the exercises is to determine the polarity of the intermolecular bonds and hence, the overall polarity of the molecule. You’ll calculate the force of the vector between each atom as well as its direction.\n\r\nLook for the tips along the way. This is a fun way to get hands-on experience with all the theory in your textbook."
  },
  {
    "game_name": "King of the Dwarves: Underground City Builder",
    "game_description": "Build an epic kingdom inside a mountain and become the King of the Dwarves in this underground city builder! Allocate resources and units with easy-to-use but tough-to-master sliders and see your kingdom grow. Have your folk dig inside a mountain, discover various resources like iron and gold, build forges and research rooms, train warriors, smiths and engineers, forge weapons, defend against invading enemies and protect your people from natural disasters – all in a vast 3D world! Mine in every directionNow is the time for you to learn about real dwarven craftsmanship. Discover the art of digging long networks of corridors through massive mountain rocks. Explore all its nooks and crannies by creating not only horizontal tunnels but also descending from the very top of the mountain, going as deep as you can. Who knows what amazing treasures are hiding underground?Manage hundreds of dwarfsTake care of your dwarven community. Equip miners with sturdy pickaxes, warriors with shields and hammers, and to keep morale high, make sure you have enough barrels full of finest ale. Remember - as your dwarven community grows, new challenges will arise. To keep things in check, develop dwarven technology, build temple altars dedicated to the dwarven pantheon, and resolve feuds between clans.Protect your kingdomYour people aren't the only ones interested in harvesting mountain resources. The goblins and orcs will do their best to make your daily digging difficult. Mindless trolls are slow, but just a few are enough to decimate your warriors. Remember, not all threats will come from the settlement gate. Who knows what lives in the deep underground of the mountain. By any chance, are the legends of dragons sleeping on countless treasures true?Key features: Explore and inhabit a procedurally generated mountain. Mine and build in every direction. Manage hundreds of dwarves – Warriors, Builders, Miners, Researchers, Smiths and more! Gather resources, forge weapons and build a thriving economy. Tame lava rivers and waterfalls for your advantage. Protect your kingdom from orcs, goblins and other enemies. Make diplomatic decisions and establish trade routes to strengthen alliances. Research new weapons and technology to advance your kingdom. Survive world events like earthquakes, floods or famine."
  },
  {
    "game_name": "B-12",
    "game_description": "Thank you for your interest in procuring Brantisky Robotics products. Due to high demand -- and sociopaths using Brantisky products for nefarious purposes -- I will require you to complete this simulation in order to purchase my robots. I do not apologize for any inconvenience this may cause.-Tonarsk BrantiskyB-12 is a tough, third/first-person action-platformer with randomized levels and relentless robots with plasma cannons for hands.  It is inspired primarily by Mega Man X and modern rogue-lite shooters, although the mechanics differ somewhat from both of those.While various weapons and gear can be equipped, the style and depth of the game lean toward arcade minimalism rather than full-on RPG complexity. B-12 is geared toward speed-runners and those who like to play in short sessions.The mechanics are simple. Find and activate three switches in each of the 12 levels to power up the next teleporter. There are four groups of three levels with each group introducing a newer and more powerful generation of Brantisky robots. Can you make it to the final challenge and defeat 'evil' B-12?"
  },
  {
    "game_name": "GalaxySpace VR",
    "game_description": "New way single player space shooterExperience a stunning and highly realistic battle against numerous enemies in a beautiful universe through Galaxy Space VR!Galaxy Space VR, specialized in fully immersive HMD equipment, will provide a new experience full of tension and excitement that you have never experienced before.EASY and familiar operation, but a HARD challenge!Move the VR controller directly to quickly evade enemy aircraft's attacks, and aim your opponents to hit the enemy exactly to clear the stage.The more you learn about the attack patterns of various items and enemies through play, the higher the points you can earn. Try to score high scores!UpdatesJuly 27, 2020Now you can play 5 different stages.Added various enemies and patterns.Balance of weapon items are modifed.Added burst-fire item."
  },
  {
    "game_name": "There is No GreenDam",
    "game_description": "About the game This game is produced on a whimby a group of idle fanatics (perhaps),After so many years,We've finally ported her to Steam,During all those years,Have you forgotten those you worked hard for so far?Hope this game can not only evoke our spirit of youth,But also arouse your wandering heart.STAFFAuthor- 喵妖子Adapter- 萌点- 然然然Director- SunnyRx- 萌点Illustrator- nine汪汪Live 2D Artist- 天柱小逸Background Artist- 死神- 葡萄ＣＧ- nine汪汪ＣＶ- 新月冰冰Programmer- 甜尘Script- SunnyRx- project596- 甜尘Perform- project596- SunnyRxB G M- 蟹蟹子- 可乐君- TAM Music FactoryＵＩ- L罗Translate (EN)- 天柱小逸Prothonotary (mascot)- 猫猫Counselor - 老罗- 甜尘Responsible (trans-provincial) - SunnyRxPoster- DZS漫音PV- DZS漫音Sponsor - 136痴呆群主- GA- 开府仪同三司同中书门下平章事同知军国重事（新生合成食品及燃料化学工业公司）- 萌点- 喵之妖妖罗小黑- SunnyRx- 小绿的追随者 Present- 格林达姆136工程团"
  },
  {
    "game_name": "Rocky Planet",
    "game_description": "Rocky Planet offers a unique blend of sandbox, strategy gameplay, action, AI, dynamically changing environments and the infinite procedurally generated world. In Rocky Planet you create your own story! Key features:  The endless randomly generated worlds. The innovational mining system. The multi-way crafting system. Farming Breeding Day & Night Cycle Mobs"
  },
  {
    "game_name": "Bugz!",
    "game_description": "Venture into the world Bugz to capture, research and compete with your team of Bugz! Bugz is a turn based RPG where you capture a team of 4 Bugz and\r\nare working for a laboratory interested in studying the potential of monsters known as Bugz. The game is about 3-4 hours long and there are 4 arena competitions \r\nthat you must complete! Each Bug has it's own type and a few abilities that makes it different from other Bugz. The main focus is on experimenting with different captured Bugz to form the strongest team."
  },
  {
    "game_name": "Unishroom",
    "game_description": "Game OverviewUnishroom is a game in which the player plays as Unishroom to help him find him a new hometown. The player is required to avoid obstacles to reach the other destination. And through the levels a short cutscene will appear to tell the story to the player.The game genre is action/platformer. And the target audience is all ages. The flow of the game as an overall will start with a solid hard gameplay, and through the levels the game will become even harder.Gameplay & MechanicsThrough the early levels of Unishroom, the game will not have any type of progression other than the difficulty of the game. But as the player is completing each level, he should be rewarded with a new level, that gives a new experience. And this is done in Unishroom by creating unique levels that give the player a different type of atmosphere through the levels. And, after the story mode is done. The player unlocks new levels, that switches the gameplay of the game. To give the player a different feeling of progression.The mechanics of Unishroom are very simple, the player will use two buttons (Right or Left) to help Unishroom in avoiding obstacles. But, at a certain point in the game, in a level in which Unishroom will be dreaming, he will be able to jump “which he can’t do in real-life”. So, in this level, the player will use the “spacebar” to jump."
  },
  {
    "game_name": "MX Nitro: Unleashed",
    "game_description": "MX Nitro: Unleashed invites you to blaze into motocross racing nirvana! Tear through new urban environments at blistering speeds including mean streets and a bustling subway system.  Freestyle through the air with 55 death-defying tricks to earn Nitro speed boosts in your battles against new hardcore bosses. Crash your way through re-imagined levels packed with adrenaline-pumping ramps and obstacles.  MX Nitro: Unleashed expands upon the original MX Nitro with new tracks, new bosses, and new outfits. The game also includes several improvements from the original including improved visuals, from rider textures to the water, and new Easy difficulty mode."
  },
  {
    "game_name": "Towards The Pantheon: Escaping Eternity",
    "game_description": "A soldier wakes up in darkness with a headache - where is he, and how did he get here?Towards The Pantheon: Escaping Eternity is a prequel mystery game that follows the journey of this soldier before the events of upcoming full length RPG Towards The Pantheon. Players must solve puzzles, explore bizarre environments, and make sense of the the soldier's situation. Towards The Pantheon: Escaping Eternity is a unique top down pixel art experience that suggests at themes and lore that will be further explored in Towards The Pantheon. Towards The Pantheon: Escaping Eternity was developed by Connor O.R.T. Linning along with pixel art by Leandro Tokarevski."
  },
  {
    "game_name": "Magma Tsunami",
    "game_description": "Magma Tsunami is a frenzied arcade platformer game. Beat your records in 1P or Co-op mode, and don't get caught by the Magma Tsunami!!!\r\nCould you stay alive for more than one minute??"
  },
  {
    "game_name": "Square Route",
    "game_description": "Square Route Square Route is a puzzle game in which you must take control of the terrain by adding and removing platforms and placing tools to create a safe route for the Squares to get to their targets. There are between one and four Squares on each level, and left to their own devices they will happily bounce around on their own and turn around if they hit a wall. But not being the most intelligent or safety-conscious of creatures, they will not think twice (or not think at all) before falling off the edge of the level or getting themselves trapped.That means it's your job to keep them out of trouble. You can do this by helping them turn around, jump across gaps, climb ladders and reverse their gravity, or by altering their surroundings by removing existing platforms and building others. Combinations of such objects are often required, and the building of elaborate structures is frequently a necessity. They're gonna need all the help they can get!However, the catch (there's always a catch) is: you only get a certain amount of actions to perform on each level, so you'll have to work out how to hit all the targets efficiently with the tools you have available. On some levels it's possible to pick up more actions along the way, but you'll have to work out which ones you need, and whether it's worth getting them or trying to complete the level without them.With 120 levels, including a full 20-level tutorial, Square Route is a classic puzzler that is both addictive and frustrating in equal measures. There's also a level editor that integrates with the Steam Workshop and allows you to create and share your own levels using all the in-game components."
  },
  {
    "game_name": "Negative: The Way of Shinobi",
    "game_description": "MORE GAMESCheck this games from Art Games Studio:About the GameBecome a ninja prodigy, whose clan village was attacked by a mysterious sorcerer alongside the samurai army. Uncover ninja skills, use stealth or head-on approach. Reveal your father's secret intentions and stop the invasion. 1. Hardcore 2D platformer for skilled or stubborn players. 2. Heavy narrative-driven story.3. Different playstyles available.4. Stylized graphic design. 5. Hand drawn animations and backgrounds."
  },
  {
    "game_name": "BORE DOME",
    "game_description": "In the near future, human life has become perfect. Every aspect of life and existence has reached perfection. BORE DOME is a magical pill from the future, giving  humans the option of experiencing imperfection and moments of mediocrity. BORE DOME can be consumed as entertainment, medicine, or as a document of something exotic, distant and extinct.BORE DOME is a first person exploration game with puzzle elements, simulating awkward mundane, unhinged and weird human experiences. The player traverses through a series of levels that contain characters, artifacts and objects. With a repertoire of abilities that are inspired by real life senses as well as other human actions (eg. crying), the player’s objective is to visit rooms, observe, and interact with each given situation."
  },
  {
    "game_name": "When The Past Was Around - Prologue",
    "game_description": "When the Past was Around - Prologue is the opening chapter of an upcoming adventure point-and-click puzzle game about love, moving on, letting go, and the joy and pain of everything in between.The game is directed by Brigitta Rena, creator of A Raven Monologue and She & The Light Bearer.This is the story of Eda, a girl in her early 20s.Like anyone in her age, she’s lost.She lost her way in the journey to achieve her dreams.She lost her way in the journey to find love. That until she met The Owl.The man that would help her burn her passion,the man that would help her find the spark in a relationship,and also the man that would teach her about heartbreak.The game tells a bittersweet tale between a girl and her lover in a surreal world consisting of disjointed rooms from memories and time. With each gathered clue, solved puzzles, and unlocked door, the girl will find her way, unraveling the secrets between her and her lover, the secrets which she used to know.Features:Personal and ubiquitous. It's a game about overcoming the past and finding the selfOpen the treasure chest, drink tea, doing laundry. Various puzzles to solve and many mysteries to uncover in everyday familiar objects and activitiesA sweet and whimsical journey set in a series of hand-drawn, down-to-earth settingsAtmospheric violin music will accompany you from the peaceful days to the angstiest momentsThis game was part of #MojikenCamp, an internal upgrading program by Mojiken Studio to experiment with how to tell stories or to communicate an experience within the constraint of interactive art medium."
  },
  {
    "game_name": "Wunderdoktor",
    "game_description": "Join our community on Discord!About the GameRing the bell, meet the patients. Step into the role of the Wunderdoktor, a traveling doctor whose daily work is to cure rare and exotic diseases. Explore a world full of quackery, ghosts and addictive potions.Features:Your own private medical stone gargoyle assistant.Meet mysteriously beaked potion sellers and quacks.Harvest berry pimples & kobold eggs.Treat arachnocough & find a cure for ghostly maladies.Scoop out the innards of clams growing on criminal sharks."
  },
  {
    "game_name": "Grab Toy",
    "game_description": "In an ordinary children's room, the toys come to life and have a happy time every day, but an evil wizard doll is always causing trouble, the daring Dino the Dinosaur, has to work with the rest of the toys to stop him!\r\nDrag and reorder the blocks to climb up and reach the goal, Grab Toy offer more than 30 unique and fun puzzle levels to solve! With a variety of challenges, character customization, and impressive graphics. Grab Toy offer fun for all ages"
  },
  {
    "game_name": "Psycho Simulator",
    "game_description": "How does it feel to be a psychiatrist? How do you face every day challenging yourself to rescue people taken hostage by their own minds? How do you treat a schizophrenic like Alice from Wonderland, a sociopath like Joker or a fascist criminal closely resembling Hitler? How will you react to a sudden attack from a patient that truly believes you’re a spy of an evil organization? What will you do if another patient takes you for his long-lost father and will try to catch up on all those years that passed? How do you talk to them all? What medicine should you give them? What procedures should you apply? How do you handle your own strained nerves that demand soothing using the same vices you try to defend your patients from?Reality of a Psychiatric HospitalPsychoSimulator will take you to a tense reality of a Psychiatric Hospital where you will understand the risk and responsibilities involved with psychiatric and psychotherapeutic work. Your choices will define both your and your patients’ fate. It won’t be easy and it won’t be boring, that’s certain!See what the everyday life of a psychiatric hospital looks like, run various therapeutic sessions, prescribe medicine, carry out clinical procedures and collaborate with other personnel members (who can get symptoms just like your patients). But most of all: stay sane!Talk and healEvery patient has a story waiting to be discovered. Everyone needs an individual diagnosis and proper treatment. Talk to the patients and figure out their defense mechanisms to find the causes of their disorders. Ask the right questions, guess hidden motivations and skillfully provoke consideration."
  },
  {
    "game_name": "Beyond Extinct",
    "game_description": "Beyond Extinct is a First Person Shooter where you take on the role of a survivor in an underground facility where things have gone wrong, very wrong. Now you have to fight your way through waves of monsters to reach the surface of the planet. You will face a variety of monsters, and bosses, each with unique stats and random spawns. The higher you climb, the more difficult it will get. But fret not! For you are blessed with an arsenal of Weapons, unlockable Utility Items, and Perks to use against your enemies.KEY FEATURES:· Weapon Upgrade System: There are 24 guns and 4 knives that are separated into 4 tiers. You can collect Weapon Parts, and use them to upgrade your weapons. The higher you upgrade, the better weapons you will get. · Utility Items: Utility Items are active items. You can carry 2 different types of utilities at any given time, and each one has it's own unique effects when used, adding variety to the gameplay. There are 20+ Utility Items.· Perks: Perks are passive items. You can have unlimited amount of Perks and their powers will stack-up for your current run. There are 25+ Perks.· Character Classes: Pick from a selection of character classes, each with their own starting gear, passive skills, and one unique active ability. There are 5 different character classes.· Unlockables: Initially, you start out as a survivor with a limited selection of weapons, items and other means to wreak havoc. As you play the game you will unlock many new Utility Items, Perks and character classes. There are 50+ items and 5 characters beginning to be unlocked and unleashed.· Randomly Generated Levels: There are 10+ different themes with 450.000 different combinations for levels. Each time you start a level, a theme will be picked randomly, and with that theme, a level will be generated… randomly."
  },
  {
    "game_name": "Warzone 2100",
    "game_description": "In the late 21st century, the world's civilizations are wiped out by a series of nuclear strikes, seemingly caused by a massive malfunction of the new NASDA (North American Strategic Defense Agency) strategic defense system. While most of the survivors form scavenger bands to survive, you are a member of a group named \"The Project\", that is more organised and seeks to rebuild civilization using pre-war technology.Compared to other real-time strategy games, Warzone 2100 has a greater focus on artillery, radar, and counter-battery technologies, more frequent in-game cinematic updates as game play progresses, a massive research tree, as well as a vehicle design system. Features* Fully open source* Single player campaign with full FMV support* Single player skirmish modes* An extensive tech tree with over 400 different technologies* A vehicle design systemNotes:To play multiplayer online port 2100 needs to be fowarded.Please refer to your local router setting on how to do this.Source code is available from GitHub from this location:"
  },
  {
    "game_name": "Dark Romance: The Swan Sonata Collector's Edition",
    "game_description": "Your wedding day goes dark.. and your fiancée has no idea who's behind it all. You've come to seek your grandmother's blessing to marry a kind prince, but his very own court magician attacks! In this exciting continuation of the Dark Romance legacy, recapture your place beside your beloved prince... When you're not playing as him, that is. This game's unique feature shows there are two sides to every story. Enjoy gorgeous fantasy HOPs in fractured object, list, morphing, and interactive styles, too! The Collector's Edition version is chock full of extras: find feathers to spend on items in your boudoir, collect statuettes, look for pieces of a stained-glass window puzzle, gather notes, and more!\n\r\nThis is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:\n\n\r\nPlay as a mermaid in the bonus game!\r\nEarn special Achievements and find feathers everywhere\r\nGet the available Strategy Guide\r\nEnjoy soundtracks, wallpaper, and concept art\r\nPlay fractured, list, morphing, and interactive HOPs!\n\n\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point & click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles."
  },
  {
    "game_name": "Kick Them Out!!!",
    "game_description": "Kick Them Out!!! will test your dexterity.Control a customizable cumbrous ball through 40 challenging levels that requires skill, patience and self-control to cope with failure. Kick all green cubes off the platform! Beware of the black obstacles - the slightest contact and you will explode! Boom! Boom! Boom! Classical pieces of music you will soon learn to hate! Complete levels quickly to unlock new levels! Now with Steam Achievements!\"Hi I'm Max, the maker of Kick Them Out!!!. My aim was to create a challenging game within the time span of one month. You have to complete around 40 levels to beat the game. Every five levels, you will see some new items/objects/obstacles, so you have a progression in complexity and difficulty. I hope you have as much fun playing the game as I had creating it. Thanks!\""
  },
  {
    "game_name": "Murder In Tehran's Alleys 1933",
    "game_description": "A series of bitter and horrifying murders has tainted the ambience of Tehran. The situation is extremely alarming and there is nothing the police or the city security guards can do! The press slams the government and sarcastically talks about the alleys of Tehran turning into scenes from Western movies. Each day a new murder is committed, a new family mourns for its loved ones and more people are gripped by fear; fear of being the next victim… \r\nBut who are the victims of such heinous murders, anyways? The rich? The politicians? Or the upper class? “None”, is the answer. The victims are innocent children from southern neighborhoods; what wrong they have done to be drawn into this diabolical game is not known! There is no clue as to the murderer’s whereabouts.\r\nThe high degree of violence in these murders is what attracts the attention. Most victims are tortured before death and are then brutally sliced into pieces! Such unbridled violence increases social tensions even more. While the general situation in Tehran becomes more and more chaotic as days go by, Colonel Nasiri, the chief of police, assigns the case to one of his elite officers, detective Afshar, in hope of saving the people and city of Tehran by virtue of the intellect of this compassionate and patriotic officer.\r\nBut, is the murderer a mere crazy sadist? All evidence points to such a conclusion. However, a journalist, named Sarsalouki, has another interpretation in mind! He believes that some forces are working hand in glove with the murderer, meaning that, not only they are not unhappy about these events but are flaring up social rage and feeding off of the fear pervading the society! But who is the murderer, anyways?\n\r\n(This version of the game has been fully reviewed for redistribution on STEAM in terms of the translation of dialogues, scripts, and other localization segments in English and is different from the previous version)\n\r\nGame features:\n\r\n1.\tAn intriguing, engaging story in a noir atmosphere similar to that of serial killings\r\n2.\tLoyalty to the Adventure genre with more than 6 mini games and tens of environmental puzzles\r\n3.\tTens of graphic documents, newspapers, short stories, and old advertisements\r\n4.\tNarrated in more than 12 locations and 80 backgrounds with meticulous detail\r\n5.\t23 characters with more than 100 A4 pages of captivating dialogue.\r\n6.\tMore than 15 minutes of motion comic for a more detailed narration of the story.\r\n7.\t20 minutes of engaging noir music\r\n8.\t60 pages of completely interactive daily notes by the detective\r\n9.\tMore than 4 hours of gameplay"
  },
  {
    "game_name": "Purgatory",
    "game_description": "Most stories end with the death of the protagonist. For Xzus, death is where things started to get really interesting... Purgatory is a tactical turn-based strategy game akin to the Heroes of Might and Magic series. Guide Xzus through the immortal realm as he recruits spirits to the cause, takes on waves of increasingly-difficult foes and finally defeat the gatekeeper in order to return to the realm of the living! Featuring:Epic pixel art! Turn-based strategy! Explore the afterlife via an overworld map! Acquire and spend skill points on improving your character! Work your way through scores of spirit foes! Recruit spirits to your cause! Break out of Purgatory and regain life! A prequel to the acclaimed Data Hacker series!"
  },
  {
    "game_name": "Snacko",
    "game_description": "CommunityWe update frequently, so make sure to +Follow to keep up to date with our patch notes!We're always available to help and chat on our official Discord.Or, you can find answers to lots of question on our community maintained wiki.Snacko is made with love by recursive & enralis. We read each crash report, bug report, and feedback post submitted. Don't be shy, feel free to reach out!About the GameWelcome to Snacko Island!A place once abundant in resources and culture, Snacko Island now sits abandoned by its residents...Driven away by the cost of living, you and your childhood friend set off with the goal to turn things around and start a new life. Explore, gather, and build up the town from scratch into a place you'll be proud to call \"home\". From picking out shopkeepers to placing down new buildings, the future of the new Snacko Island is in your paws!All packed up and ready to goExplore the island and its four distinct biomesCustomize your journey by combining different gems for different tool effects - each tool and gem has a unique combination, allowing you to tailor your upgrades to your playstyleEasily manage your goodies and stamina by utilizing an array of tools and features, from auto-deposit to the Lunchbox for auto stamina restoreNever worry about the size of your rucksack when you're out! Craft from storage and the Overflow Storage lets you keep just the essentials on youGet comfortable with these quality-of-life featuresRunning out of time? After a long day out, simply use the Go Home button or camp outside with a Sleeping BoxYou can purchase items from shops when the shopkeeper is off duty - they trust you!Pick between built in World Themes such as low contrast or dark mode, complete with a dark mode UI and a slider to change the strengthDiscover higher drop rates of certain items during specific seasons, time of day, or weather. The longer you're looking for an item, the more likely it will appear. How lucky!Is it too dark at night...? Adjust the Night Time Strength to help you see better Dig deep into the world of SnackoUnlock items, learn more about your friends, and learn more about the island and beyond through unique questlinesUncover secrets with your new friends or just relax and fish with them on join questsWork through Guild Quests to learn crafting recipes, cooking recipes, and new crops. You might learn more about each Guild leader, too...Explore the Snacko universe at your own pace to a beautiful soundtrack by Dale North and CamelliaMeet someone newInvite shopkeepers and villagers based on personality, or work hard and build housing for everyone! With 26 characters of varying personalities (and species) to get to know, you're bound to find someone who clicks with youExperience romance with 21 characters with no restrictionsLearn more about each character through quests, dialogue, and cutscenesSomething for everyoneSpend your time collecting resources and crafting, cooking, fishing, decorating your house, or using up every square of your farm - how you spend your time and how you'd like to progress is up to youGo through each day slowly and unlock all the items, or simply enjoy the completed main story questline as you naturally progressDonate furniture, cooked foods, fish, and paintings to the Cultural Center and watch it fill up, or simply enjoy a relaxing afternoon in the Music HallBuild up your dream lifeA flexible build mode means you get to decorate how you likeSnap to grid, free rotate, undo and redo, float items, dye objects, no building restrictions, and a search box in your catalog for over 300 items to placeUtilize Screenshot Mode and undo/redo to record your own build timelapsesNudging objects while in Lock mode gives you finer control for decorating your surfaces with clutter... Or get creative and combine objects togetherExpand your house, change the wallpaper and floors, and dye each wall a different color!Get things done quicklyWith a variety of movement options like double jumping, using the kart, riding on arrows, sword dashing, or bouncing around with your pickaxe, there's always a faster way to get aroundSnappy animations can get cancelled by actions! Try watering your farm tile right after sowing a seed... It's super fast!Choose your time or your stamina: speed up your Furnace, Alembic, or Seed Maker by bonking it with your tool. Or, be patient and let it sit while you sleep"
  },
  {
    "game_name": "The Curious Tale of the Stolen Pets",
    "game_description": "ACCOLADESAbout the GameSolve the mystery of the adorable stolen pets and tackle engaging puzzles in amazing diorama worlds in this heartwarming VR game.A family-friendly VR adventureEmbark on a nostalgic journey through your childhood, revisiting cherished memories that have been lovingly reimagined as diorama worlds. Visit 5 fantastical locations, each with multiple environmental puzzles to solve. Uncover hidden critters and collectibles. The Curious Tale of the Stolen Pets is a warm, welcoming VR game that any member of the family can enjoy. Features:5 incredible diorama worlds, each with multiple puzzles to solve, pets to uncover, and collectibles to hunt.A warm, nostalgic story about family, childhood memories, and holding on to what matters most.Comfortable, immersive VR play for everyone: no artificial movement or camera turning. You remain fully in control of the experience. Play with controllers or discover one of the first VR games to fully support hand-tracking technology!"
  },
  {
    "game_name": "Fate Tectonics",
    "game_description": "Build up a world piece-by-piece using the power of the god-like Fates, while keeping them happy enough to avoid world-shattering temper tantrums!Fate Tectonics is a world-building puzzle game featuring a handcrafted pixel art style and a 16-bit symphonic soundtrack. Carefully place terrain tiles, piecing together the world in a way that will appease a growing number of god-like beings called Fates. One wrong move could mean angering the Fates, resulting in a chain reaction of destruction and chaos. Unlock the powers of the Fates to build a stronger and increasingly beautiful world and face off with final Fates for the ultimate world-crumbling finale.FeaturesEasy to pick up and play casually, but also offers deep challenge for more strategic players.Handcrafted in-game pixel art, a soundtrack of symphony & steam by composer Robby Duguay, and Twitter-shareable worlds! The powerful Book of Fate keeps track of your progress and chronicles your adventures! Two game modes—test your world-building skills in timed cycles of creation and destruction under Ragnarosa and Fortuna's vigilant watch, or take your time and build up a world as large as you can at your own pace, under the calming influence of Serenity. Accessibility options cater to gamers with motor skill, cognitive and vision impairments.Accessibility Options Include:Multiple control schemes, remappable keys and input optionsDesign and colour palette are resistant to 3 types of colour blindnessAdvanced options for cursor speed, font size, game speed and moreSeparate volume controls for music and sound effectsFull-screen and windowed modesAll menus and screens have a half-second cooldown between inputsIn-game hints and guidance for new playersAssistive tile auto-rotate feature that learns your preferencesComprehensive save system featuring overview of progress, multiple save states per save file, and thumbnails for each save state for a quick visual reference of progressWhat they're saying about Fate Tectonics“Last night, I decided to play Fate Tectonics [official site] for five minutes, just to get an idea about how its world-building puzzles worked. It was a long five minutes. Around an hour and a half, all told. (…) It’s rather good.”—ADAM SMITH, Rock Paper Shotgun“The combination of strategy and puzzle solving is certainly unique and makes for a very addictive gameplay experience.”—GAMERAMBLE“(The game) allows players to derive meaningful satisfaction from creating expansive worlds one piece at a time. It’s almost meditative during the early going. Then it starts to get a bit tricky.” - CHAD SAPIEHA, Post Arcade (Financial Post)“I personally found that it brought back a sort of childlike joy that came from building things with blocks or legos as a kid, then destroying it all in a cathartic burst of destructive control.”— ALEXX APLIN, Mod Vive.“My main piece of advice is be willing to fail. It has some of the best game over gameplay since Sim City of old.”—CHRISTOPHER DEMELO, The Snarge.“The strategic spin on a world-building game gives Fate Tectonics an added challenge many people won’t expect.” — CONOR BAILEY, The Spew.\"If you play only one real-time polytheistic tile-placement world-building strategy puzzle game, make it this one!\"—RAIGAN BURNS Metanet Software (N++)\"Has all the joys of creating with all the pains of having it crumble away around you.\"—JAMIE TUCKER, Asteroid Base (Lovers In A Dangerous Spacetime)\"Fate Tectonics is a beguiling game; it lures us in with the cathartic pleasure of clicking together puzzle pieces. The satisfaction in snapping the precise piece into the perfect place is matched only by games like Carcassonne. That is until you realize that you are actually playing a precarious game of house of cards with three angry toddlers stomping about.\"—JOHN Z. LINDVAY BigSushi.FMFate Tectonics is a proud GDC 2015 alumni of the Indie Megabooth."
  },
  {
    "game_name": "Divine Dust",
    "game_description": "Become a speed demon taking revenge on existence itself. Charge through a cold and unloving world like a force of nature, unfazed be their monumental architecture. Unimpressed by their life's work. Their time is over.You have come.The prophet announces the downfall as he delivers the final blow.Now it's all about destroying everything that moves, while dodging dozens of lasers. Frantic, high octane platforming and parcour await you!Destroy the guardians of this holy realm and turn them into nothing but dust! You will not just be their death, you will be the death of their entire civilization. Features:Kill enemies on a time limitDash and Jump around like a maniacUnique, Bold Artstyle and Shape languageLasers!6 different enemy typesDecay Is Inevitable... You Are Inevitable...The realm of the new gods has stood for aeons, but decline is inescapable as chaos intrudes their palaces and sacred gardens.As the ever-hungry ambassador of decay it is yours to seal their downfall and consume these relics into the eternal void. They can fight entropy, but they can't win.They can try to stop you, but nothing can match your everlasting hunger for Destruction!"
  },
  {
    "game_name": "Putt-Putt®: Pep's Birthday Surprise",
    "game_description": "Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon. About the GameHappy Birthday, Pep!It's Pep's birthday and Putt-Putt® wants to surprise him with his first birthday party ever! Join Putt-Putt® as he travels through Cartown, helping various residents, reaping rewards, and gathering supplies for the party. With new friends to meet and new problems to solve, kids will love helping Putt-Putt® get everything ready in time for the big surprise--a birthday cake, presents, decorations, and friends!Cartoon-style learning adventures where kids choose where the characters go.Over 20 fun locations to explore.The adventure changes each time the game is played.Kids have so much fun they don't even realize they are learning.Putt-Putt's® friendly and polite nature reinforces good social skills and manners.Encourages critical thinking, creative problem solving, and teamwork."
  },
  {
    "game_name": "The Light Empire",
    "game_description": "Welcome to TLE, you will be taking control of a spaceship as it's commander. Your goal will be to locate and destroy an enemy military platform. You must manage a crew who have specific needs and make decisions quickly! What will you do if your O² generator is damaged and it no longer produces enough oxygen for all of your crew? It is up to you to make the right decisions. All this in an open world with RPG elements. You are free to do what you want in a completely randomly generated universe, full of events that will benefit you or not ....Main Characteristics :  Evolved in a completely random world : - The world is randomly generated for each game and every game. Nothing is planned in advance, any events are generated as you choose your journey. Once you have selected a destination there is no turning back.  RPG system : - Each ship will have different basic statistics with the ability to grow in power as you level.  A living crew  : - You need to meet the needs of your crew Food, oxygen and not to mention their salary. Each crew member that can not be paid, will desert your ship. Every crewmember will have a special skill to improve your ship. Total freedom  : - Once in your new ship, you are free to advance in the game as you want. You will be hired or fired, but know that your ship will require improvements for you to survive, and therefore need money!  Random events  : - Each new destination will bring new challenges. Will you meet an enemy ship? Or a merchant ship? Pay attention and react accordingly!  A slow and painful death  : - Remember one thing. Once you are dead, it's over. No turning back, The slightest mistake or a bad decision and you will have to start over again! Upcoming Features :  Planetary exploration  : - You have the chance to get down on planets and explore randomly generated worlds. You must adjust depending on the gravity, atmosphere , monsters and NPC's that will be present.  Additional events  : - The space is unpredictable, other random events to come out over time. Dynamic events  : - Once the game is \"stable\", you will have updates that will include dynamic events, the occurence of flagship, or an enemy commander, for example, that will save a lot of resources if you can defeat him. It is very hard to survive in the world of TLE, and through these events you are going to be a big help, which can eventually make you win the game! To you to keep you informed, announcements will be made in advance so that you can prepare. Other surprises await you  : - I will not reveal the rest, but know that other additions are planned for the longer term[/]"
  },
  {
    "game_name": "The Crystal Nebula",
    "game_description": "Fly your spaceship from wormhole to wormhole, navigating dangerous space station obstacle courses and collecting crystals from the wreckage of fallen enemies. The Crystal Nebula demands your highest dexterity and accuracy in order to shoot and dodge your way through its waves of opposition! Prepare to take room-scale to its fullest as you steer your ship from bound to bound, traversing the many traps of the derelict space stations and flourishing to avoid enemy fire. Demonstrate your resolve with online leaderboards and special prizes for top fighters!"
  },
  {
    "game_name": "Spooky Spins Deluxe Steam Edition",
    "game_description": "Spooky Spins Deluxe is a 4x5 reel, 40 payline slot machine (pokie) with a Spooky theme oriented from left to right.\r\nThe game has 11 regular symbols that win if three or more are lined up in sequence on a payline, beginning from the leftmost position.\r\nFree game feature is awared when three scatters appear on any line.\r\nFree spins cannot be retriggered during free spins. Respin or Take Win Feature may be selected after free spins.\r\nNon win during free spins does not trigger Respin or Take Win Feature.\r\nGet 10, 12, 14 Spooky Bonus symbols anywhere on screen for Mini, Maxi and Major Jackpots.\n\n\r\nFeatures:\r\nkeyboard Shortcuts.\r\nSupports Mouse, keyboard, Trackball and Arcade Joystick with Ipac 2 Hardware.\r\nBuild your own custom controller using Ipac 2 keyboard Emulation Hardware.\r\nAttrack Mode Setting when leaving the game idle, adjustable from the setting menu.\r\nQuick access keyboard shortcuts: F4 = keyboard Shortcuts, F11 = Sound and Setting menu.\n\r\nThis is the closest slot machine simulation you can get to the real thing, with features like, Reserve Button, Call Attendant, Collect and Paytable.\r\nPlay Pokies4fun Slot Simulations at work or at home without losing a cent, Great Games Great Fun........"
  },
  {
    "game_name": "Chimpact 1 - Chuck's Adventure",
    "game_description": "Chimpact 1: Chuck's Adventure\n\r\nLuscious environments with a variety of delightful characters make Chimpact top of its class. Collect gems, medallions and bananas by chucking your chimp through stunning jungle landscapes. Use bananas to add abilities to your chimp and complete all levels perfectly.\n\r\n**** Game Features ****\r\n- Chimp chucking, gem collecting, banana popping, medal earning fun for all!\r\n- Simple, one-touch gameplay\r\n- Four stunningly lush worlds with 12 levels each\r\n- Two complete game modes to beat: Gem Quest and Totem Trail\r\n- 240 challenge medallions to earn\r\n- Eight abilities to earn and three chimps to unlock\r\n- Beautiful environments + cute characters\r\n- Watch your chimp monkey about when you collect full banana strings"
  },
  {
    "game_name": "Sightbringer",
    "game_description": "Control the character “Sight”, who is the hero of this forgotten civilization. Your mission is to explore the underground ruin and restore the fire in the brazier to bring light and peace back to this world.This is not going to be a safe trip. Ever since the great catastrophe, evil monsters who are fed by the dark energy have invaded this land and they will do whatever it takes to stop Sight from restoring light to the world. Luckily, with the help of some ancient artifacts, nothing can stop Sight from finishing his/her mission.“Life crystal” can protect Sight from the dark energy 3 times. “Flight crystal” can help Sight fly through the obstacles. “The Lantern of Bright” will re-lit the fire and guide Sight whenever he/she is lost in the dark energy.Along your journey you will encounter a friendly NPC “Touch” who can restore your life crystal and bring you back when you are severely damaged so you can continue your journey. She seems to be able to appear all over this ancient ruin along your journey. Some say her power is related to space and time. Her stories still remain to be discovered…Glide and wall jump through the ruinBoost yourself with the power of ancient crystalsBring light to the world with the lanternsThis game was developed as a student project at DigiPen Institute of Technology and was created for educational purposes only. Please check out our publisher page for more information."
  },
  {
    "game_name": "Hexa",
    "game_description": "Hexa is a easy to learn puzzle game with a unique concept. Use the different hex side types to get the beams to their destination. With a simple to use level editor you can create and share your levels with the Steam community.Key Features: Easy to learn yet complex puzzles Level Editor to create and share you levels on the Steam Workshop Simple controls 33 Carefully thought out levels with more getting added constantly Random level generator. Play unlimited random levels!Hex Side Types In Hexa the puzzles are solved using various types of hex sides.Link Hex SideA Link hex side lets you teleport projectiles from one place to anotherConverter Hex SideA Converter hex side lets you teleport projectiles from one place to another and also change the type of projectileSplitter Hex SideA Splitter hex side splits a stream of projectiles into two.Switch Hex SideA Switch hex side will only allow projectiles through if the switch is receiving projectiles of the requested type.CreditsTrailer Song cdk - Sunday by Analog By Nature (c) copyright 2016 Licensed under a Creative Commons Attribution (3.0) license."
  },
  {
    "game_name": "Infinite Way",
    "game_description": "Infinite Way is a deck-building roguelike where you travel, fight and survive in post apocalyptic world."
  },
  {
    "game_name": "Disney•Pixar Cars Mater-National Championship",
    "game_description": "Mater is holding a national race festival allowing racers from all around the world to challenge Lightning McQueen. Along with racing against the new characters, players can explore the world of Radiator Springs and Lightning McQueen's racing headquarters. There are also more than 20 mini-games to tackle, including Ramone's Rhythmic Rumble and Fillmore's Fuel Frenzy. Mike and Sulley from Monsters, Inc. make an appearance as well."
  },
  {
    "game_name": "Land of Puzzles: Castles",
    "game_description": "Now AvailableAbout the GameIn Land of Puzzles: Castles the king and queen need your help.  To avoid war the king has accepted a challenge of puzzles to solve.  He needs you to solve 15 sets of challenging puzzles and help him secure the kingdom.  Each set of these challenges contains a three by three and six by six puzzle.  To move on to the next challenge you will have to solve both puzzles in a row.  Each puzzle is randomly created so you can enjoy replaying with a new experience each play through.  In Land of Puzzles Castles you will enjoy hours of puzzle solving with a medieval castle theme.  Run into a hard puzzle?  Use the hint button at any time to overlay the finished puzzle to see what parts you're missing.  Land of Puzzles Castles needs you to save the kingdom, a true challenge for any puzzle enthusiast. FEATURES:15 Levels3x3 Rotation Puzzles6x6 Rotation Puzzles30 Puzzles totalRandom Puzzle CreationHint Helper"
  },
  {
    "game_name": "Global Conflagration",
    "game_description": "Europe is thrown into chaos once again by the actions of an elusive private military company. On the sidelines European states barely scramble to form a cohesive military union to confront the threat. Will the reformed EDU manage to overcome its bureaucratic barriers and pick up the fallen pieces? Or will the fresh nationalistic and pragmatic Carpathian movement fend of foreign infiltrators and unite eastern Europe under its iron fist? Play Global Conflagration to find out.Global Conflagration is a modern fast paced RTS that features three factions. Each has its own roster of tanks, infantry, helicopters and planes. Player and unit abilities. Overwhelm your enemy with called in airstrikes, carpet bombings and explosions!Shifting the Focus to the battlefieldCheckpoints reward players for their presence on the battlefield, while bounties provide an opportunity to come back into the fray if faced with a setback.Checkpoints progression makes sure sessions end in a decent time frame while also allowing for no limit on the number of units trained.Refund and Scrap systems act as a safety net countering early game snowball and creating more back and forth.Directional armor and Reverse Movement favors the player's smart positioning and tight micro skills.Various modern RTS Quality of Life mechanics to help ease the stress and fatigue of army management.Customize your unit pattern! Pick from an extensive list of camos and choose any color you like.Three modes:Multiplayer PvP, supporting 1v1, 2v2, 3v3, 4v4Skirmish vs AIAn upcoming campaign that will explore an unexpected military incursion in Europe"
  },
  {
    "game_name": "Dark Solitaire. Mystical Circus",
    "game_description": "Are you ready to be a part of extraordinary adventure?! Take a walk around the mysterious circus. Investigate different locations to find the hidden mysteries of this weird place! Complete the quests, find the mysteries of this place to help you reveal its origine!\r\nYou can expect memorable adventure with a number of complicated card layouts! It will require some efforts but you will manage it!\n\n\r\n- Prove yourself, do your best to complete all levels!\r\n- Solitaire card game – collect chains of cards!\r\n- Never a dull moment with super exciting levels!\r\n- Vivid graphics and a Pirate soundtrack make this Solitaire a win-win!\r\n- Get rid of cards faster with jokers, and increase the combo multiplier to earn more coins!\r\n- For daring players – special tasks and over 15 colorful trophies!\r\n- Let the fun take over!"
  },
  {
    "game_name": "Deep Race: Space",
    "game_description": "A CINEMATIC SPACE SHOOTER - WISHLIST NOW!About the GameINTRODUCTION:Deep Race: Space is Space themed single player racing game. Player can choose from several different unique tracks, where to drive against 3 other opponents which has different and unique ships and skills, like opponents has different top speed and handling.Player drives with powerful space racer which speed is 500km/h and using turbo button and hitting boostpads at track, top speed can reach over 700km/h, but then controls goes more harder. Player can also use airbrakes to control ship at tight cornersIf player drives out of track, he respawns to last checkpoint but also lost lot of time against opponents which alsocan drive out of track. When player reaches yellow colored line race will be end and some tracks has 2 lap racesRaces last 1-2 laps, depending selected track. Some tracks are like ovals and some have more tight corners and are longerSome tracks contains music, some only space ships soundsFEATURES:- 14 race tracks- 2 freeruns, where player drives alone and can test race ship movement and handling and other game features- Few Steam achievements- 3 different skilled ai opponents:    - Poor    - Medium    - Hard- 1-2 laps races- Checkpoints where player respawn after driving out of track- Boostpads which gives more speed- Turbo button which gives more speed, which can be over 700km/hALSO store page include quickref and manuals Controlsnew.pdf file which include controls"
  },
  {
    "game_name": "Shadow Empire",
    "game_description": "Major Update! New Planet ClassesAbout the GameShadow Empire is a deep, turn-based 4X wargame with a unique blend of military focus, procedurally generated content and role-playing features. Players take the seat of the supreme ruler of a small nation, with the goal of reconquering a devastated planet. Set in an alien universe, Shadow Empire immerses players in a dark and unforgiving future, where they take command of military conquests and engage in delicate diplomacy. Control the nation's budget, recruit and oversee governors and commanders, build the economy, and develop infrastructure. Every decision plays a pivotal role in shaping the fate of the empire.Shadow Empire is one of the most ambitious games VR Designs has ever made. It offers a rich experience and stands out as a truly unique game, one unlike anything players have experienced before. The game’s complex systems require players to make agonizing choices in response to events affecting the nation, the demands of leaders, or external pressures from factions like cults and crime syndicates. Stratagems offer the opportunity to craft responses to crises or create new opportunities for growth.Leaders with diverse skill sets can be recruited and become zone governors, council directors, army commanders or advisors. Leaders can have over 40 different skills and can receive Leader feats to augment their statistics.Political systems, including parliaments, senates, or politburos, can be established and evolve as the game progresses. Political bodies will vote on laws, which introduce new dynamics to gameplay. The outcome of these votes can have far-reaching consequences on the direction of the empire.Diplomacy with neighboring factions is also a key component of the game. Minor regimes can be coerced to become vassals. Major regimes can be tied down with pacts and deals, ensuring a peaceful coexistence or you can use your spies to manipulate their politics and reveal their military forces.Managing the expectations of both the populace and the ruling class is a delicate balancing act. There is a strong role-playing and human dynamics element to Shadow Empire, and mismanagement can lead to discontent, strikes, corruption, or even full-scale rebellion.Thanks to specialized procedural design, Shadow Empire offers extensive replayability, allowing players to experiment with various strategies. Detailed, procedurally generated planets that adhere to the rules of Astrobiology can be explored. Including detailed climate, rainfall, deserts, snow, glaciers, lava streams, deep forests, alien evolutions, mountain chains, resources, rivers, biohazard levels, respiratory hazard levels and more. The game features a huge variety of mining operations: water, metal, rare metals, oil and even radioactive materials. Prospecting is often necessary for discovering resources that could be mined and you‘ll need to scavenge through the ruins of fallen empires and discover rare artifacts from a lost age.There is also a separate system for discovery of technology, formations and units. Research and development paths are different in every game and this ensures that the route to success is different every time, too. More than 200stratagems can be explored and deployed. Stratagems are complete plans and series of actions that allow players to complete vast swathes of micromanagement tasks simply and easily. This system can also help respond quickly to crisis or unforeseen situations. It’s even possible to craft procedural Stratagems.  30+ different unit types such as light tanks, walkers, missile launchers, aircraft and much more can be designed to fit the needs of the army, choose their loadouts, balance speed and armor and create the exact land and air forces that the nation needs. Each unit type can be customized upon design by choosing its component parts like gun and engine type. Shadow Empire comes with over 100 different formation types, deploy Infantry regiments, Siege Battalions, Tank Divisions and so much more. Combat is deeply operational, with detailed resolution based on factors like readiness, morale, supply, experience, entrenchment, landscape, recon, rivers, weapon and armor technologies, concentric attacks, leader skills and posture stratagems. Strategic planning is essential to victory, as forces must be carefully managed across numerous specialized unit types and formations. Over 100 different fields of technology can be discovered. The game starts at a low level of technology as the nation drags itself out of the ruins of a galactic collapse, but at the end of the tech tree players will find knowledge that enables the construction of exciting advanced technologies such as ICBMs, laser guns, atomic missile launchers, walkers, shield-generators and more.Players have to manage a realistic supply chain that has real consequences: running out of ammo could mean that the military is unable to attack or defend itself. Running out of food could have even more dire implications.Logistical network capabilities can be extended by building roads or rails as well as constructing truck stations, maglev stations and supply base assets. The development of transport helicopters and cargo planes is essential to set up Air Bridges to support Invasions or to drop supplies into isolated positions."
  },
  {
    "game_name": "Kiitsu",
    "game_description": "In this beautiful low-poly world, the water of your village has stopped flowing... endangering all of your people ! \r\nYou'll need bravery, intelligence and observation to solve each puzzle and bring water back to Kiitsu. But will you be up to the task ? \n\r\nThanks to an ingenious world-switching mechanic, you'll have to travel accross the dimensions to progress. But you gotta go fast ! The clock is ticking...\n\r\n---\r\nKiitsu is a 3rd person platformer, composed of two levels, with enigmas and puzzles to solve. Quite hard to beat, according to us ! Our hero can switch between two connected worlds to progress through the game, but also pick up & interact with items to access other portions of the game.\n\r\n--- \r\nThis game was developed during a 6-months project. As a group of 6 friends, we had a great time making it, and we decided to publish it on Steam to share our love for this little game. We hope it'll bring you as much joy as we got making it !\n\r\nCheers,\n\r\nThe Kiitsu Team"
  },
  {
    "game_name": "Black Smith",
    "game_description": "I'm a blacksmith dedicated to working hard every day.I'm still a beginner, but surprisingly, I love my job.If I save enough money through my work, I go to the brothel. The girl I liked there before quit. I didn't have much money back then so I wasn't able to go very often.Now, there is a super cute girl who started working there. She's all I think about. Even while I'm working, I can't get her out of my head. I want to go see her every day but... money is a bit tight...I can't make enough selling poor quality goods to go to the store.I'll have to work hard to improve and save up enough money.■Work every day and if you save enough money, you can go and meet your girl■BlackSmith lower his hammer , Please click at the exact moment that the hammer lands. The better your timing is, the more experience points you'll get.■The higher your experience points, the more expensive you can sell your products to the merchants each week.★You can always change the name of the heroine★Supports English, Chinese, and Spanish.★No extra charge. You can experience every scene in the game with this package.★For SSD usersBlackSmith requires 2GB of free space on the DISK with windows installed during the game.If you use SSD and do not have 2GB free space, you need to move the [temp folder] to another drive.Please search how to move[tmp folder move windows10] on GooglePlease try the above, check the operation with DEMO, Thank you"
  },
  {
    "game_name": "Dungeon Siege II",
    "game_description": "It’s been a generation since you vanquished the evil that plagued the Land of Ehb, and now…a new menace has awakened. In Dungeon Siege II, the sequel to the best-selling RPG from Gas Powered Games, you will be called on to again wield sword and spell to save the world from a growing abomination many years in the making.\r\n\t\t\t\t\t\t A thousand years ago, the crusaders of Azunai crossed swords with the legions of Zaramoth in the final battle of a century-long rebellion. As the tyrannical god Zaramoth struck the final blow through Azunai’s trembling shield, the earth shook. In that moment, the forces of magic were unchained, and both armies were consumed in a brilliant cataclysm that stretched for leagues across the Plain of Tears. Only a scarred wasteland remained as final testament to the First Age of Man.\r\n\t\t\t\t\t\t And for a millennium, magic has continued to spread to the farthest corners of the world, freely flowing to any who would command it. But the tide of magic has begun to wane, heeding instead the call of an ancient legacy. From the Plain of Tears a new heir beckons, and with each day his strength grows. Consuming those who submit, eradicating those who resist. With none to oppose his ascendance, the circle will be complete, and an ancient age will begin anew.\r\n\t\t\t\t\t\t What fate will befall the Second Age of Man? The time for judgment is nigh."
  },
  {
    "game_name": "Squares Rage",
    "game_description": "Squares Rage is a minimalist style puzzle / \"rage\" game, in which the player is a square who must navigate through a series of puzzles that get increasingly more difficult. Use the arrow keys to navigate the square to the flag at the end of the level in as few deaths as possible! Press 'S' to self-destruct (if you need to)! Prepare your cheapest keyboard for this game too. You'll probably be throwing it across the room after dying so many times.There are four difficulties to play the game on* Easy: Unlimited Deaths allowed. Play on easy to get a feel for the game or just to practice the levels!* Medium: 50 Deaths allowed. If you surpass 50 deaths, you must start back from the beginning. If you don't want to smash your computer, I recommend playing on medium.* Hard: 10 Deaths allowed. If you surpass 10 deaths, you must start over. If you feel like getting angry today, this is the mode for you.* Impossible: Just as the name implies, this is probably impossible (or at least very, very, VERY difficult). You are allowed 1 death before you must start over. If you can beat the game in this mode, I salute you.There are 25 levels in all with several different themes to each of them. Don't let that fool you either, however. It will probably take several hours to get through them all flawlessly."
  },
  {
    "game_name": "Silver Vault",
    "game_description": "Silver Vault is a first person Dungeon Crawler that is meant to give you a feeling of adventure while traversing the halls of this dungeon, exploring, fighting and interacting with the other prisoners in this dungeon.  this game is still early access and is only still at the beginning of it's development, but we hope it make it into a full game packed full of adventure and mystery within the not so distant future!\n\r\nThe style of gameplay is a story driven RPG, but it is up to the player to decide how they are going to accomplish their goals and in what or they are going to fight the main antagonists, as Silver Vault is a free roam \"Open World\" game with the ability to let you make your own decisions and decide how best to approach the combat. Are Enemy spearmen giving you trouble? Try for a shorter weapon with a shield! Having doubts about getting past your opponent's defenses? Try using a Sickle Sword!"
  },
  {
    "game_name": "Sixth Grade Detective",
    "game_description": "Round up the usual suspects—the mean girl, the new kid, the bully, the nerd, maybe even your best friend! As the sixth grade detective, you'll spy on classmates for cash—will you keep their secrets or take the money?\"Sixth Grade Detective\" is a 109,000-word interactive young-adult novel by Logan Hughes, where your choices control the story. It's entirely text-based--without graphics or sound effects--and fueled by the vast, unstoppable power of your imagination.Match wits with the criminal masterminds of middle school! Solve mysterious disappearances and thefts, trace rumors, track down your best friend's stolen bike, and most importantly—get a date to the dance. Forge friendships, chase down thieves, or stick to your guns against bullies? Unmask them in public, or work behind the scenes to help a new friend? Will you protect the reputation of your clients, destroying evidence, or go so far as to hack your friend's cell phone to uncover his embarrassing secret? Investigate six mini-mysteries. Search for clues, question suspects, crack codes, dust for fingerprints, interview witnesses, and uncover your classmates' deepest secrets. Reveal the truth, or keep silent for the greater good… or greater profit. Shine in the classroom or cut school with the rebels. Lie to the adults--if you can get away with it Build friendships, create enemies, and find a date for the big dance. Play as a girl, boy, or neither. Date classmates of any gender, or avoid romance altogether. Find out who your secret admirer is"
  },
  {
    "game_name": "Monochrome RPG Episode 1: The Maniacal Morning",
    "game_description": "In this 1920s cartoon turn-based comedy RPG you'll take to the stage using a variety of toons to entertain foes in your way as you help Otto the shy comedian in their epic quest to...make it to work on time??? Are you ready to joke and laugh your way through a rowdy roommate, buff bees, and big bullies?Core FeaturesJourney through a 1920s cartoon worldGo on stage to outperform your foesGiggle through a pun-filled narrative Otto, a shy non-binary rabbit-like toon lives in the outskirts of the cartoon city of entertainment, Vaudeville after a terrible accident that crushed their hopes and dreams. Later rumors of dubious happenings have begun spreading across Vaudeville. As Otto wakes up to begin heading to work their morning begins to unfold in a maniacal fashion!"
  },
  {
    "game_name": "Artificial Extinction",
    "game_description": "Today, our scientists are inventing Artificial Intelligence and Lethal Autonomous Weapons (LAWS) simultaneously.  This game is about our future if we continue to allow these technologies to be developed and combined together. Artificial Extinction is a Sentry Defense game involving Real Time Strategy elements played from the First Person point of view. The story is very relevant to today’s topics of the race to invent Artificial Intelligence, LAWS, AI Murder Policy debate and  military’s implementing robotics and drones on today’s battlefield. Set in the future, you play a colonist seeking a peaceful planet for your new home. Your mission is to find a safe place on the planet for your family to join you in 9 days. The planet has had terra-forming robots working for decades in preparation for human colonization. But  the AI humanity invented has become an enemy and discovered this planet. Are the robots on the planet waiting for you hostile? You have 9 days to find a safe place on the planet. At the beginning of the day, the ship will drop you off on the planet and then orbit above you where it is safe. You have to setup a miner to collect fuel for the ship but hostile robots will advance towards you. You have Sentry  Weapons that you setup around you to provide you protection while the miner is collecting fuel. Once enough fuel is collected, your ship will descend to pick you up and you continue your journey looking for a safer place on the planet."
  },
  {
    "game_name": "The Devil's Shoes",
    "game_description": "When The Devil himself approaches you with an opportunity you cannot refuse a journey into your most perverse fetishes starts!The game features six amazing chapters for you to enjoy!Play six erotic stories, each about 10k words long\"The Massage\" features 18 different endings to unlock\"Working Friend\" features 10 different endings to unlock\"The Guest\" features 5 different endings to unlock\"Dream Girl\" features 4 different endings to unlock\"Rookie girl\" feature 6 different endings to unlock\"Hot tub\" features 7 different endings to unlockCustomize your name and the name of your love interest\"The Massage\" and \"Working Friend\" feature a M/F relationship, \"The Guest\" features a M/M relationship other stories will feature even M/F/F relationships"
  },
  {
    "game_name": "Sneaky Bears",
    "game_description": "The world is under attack...by evil teddy bears. Led by the evil mastermind bear Frank, they have seized control of a toy factory in which they are building an evil teddy bear army to take over the world. Armed with only your motion-controlled weapons, it is up to you to stop them and rescue the innocent panda bears that Frank and his minions have taken hostage.Fend off different kinds of bears and other challenges in 3 unique game modes using the weapons at your disposals such as the freeze ray, water gun, and shotgun. Make sure you look everywhere to keep those bears from sneaking up and attacking you!Can you survive, defeat the evil bear Frank, and save the world from destruction at the hands of the not so innocent cute and cuddly teddy bears?Features:Fend off evil bears and other challenges in 3 unique game modesTwo difficulty levels: cuddly & crazy Play through 5 rounds in each mode to unlock the boss level Different weapons at your disposal: toy gun, shotgun, water gun, and freeze gun Sarcastic, witty, humorous evil mastermind bear, Frank, leads the army against you with funny one-liners 80’s style art and expansive factory settings Fast-paced gameplay with bears who come running, flying, and rolling towards you Built exclusively for virtual realityGlobal leaderboards for each level Available for Arcades on SpringboardVR , SynthesisVR and via Steam Commercial Licensing."
  },
  {
    "game_name": "Fox! Hen! Bag!",
    "game_description": "In this short first-person adventure game, you have to bring your friends over to the other mountain by using a tramway car.\n\r\nBeware! Each friend has their own agenda. You have to talk to them to decide which order they should be moved in.\n\r\nYou navigate in the world by using the WASD keys on your keyboard and by moving the mouse around. \n\r\nFeatures:\n\r\n* A first-person adventure where you move the animals between mountains\n\r\n* Based on a classic riddle\n\r\n* Explore a small yet atmospheric world"
  },
  {
    "game_name": "Untitled Goose Game",
    "game_description": "It's a lovely morning in the village and you are a horrible goose.Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day.Featuring:A horrible goose (that's you)A town full of people just trying to get on with their day (you hate them)A dedicated honk button (!!!)AND ALSOOh dear! Two horrible geese!You can now enjoy Untitled Goose Game with a friend, in a new two-player cooperative mode. Play through the whole game as two horrible geese, honking twice as much, teaming up to plan pranks, and generally ruining everyone's day, together.A free update for all owners of Untitled Goose GamePlay through the entire game with two playersNew goose, new honk, still horrible"
  },
  {
    "game_name": "Burnin' Rubber 5 HD",
    "game_description": "What is it?Burnin' Rubber 5 HD is the version as it was intended to be! Battle over 30 challenges against the toughest opponents ever. Unlock new cars, buy new weapons and upgrades. It’s a massive 3D action arcade racing game, completely remastered. Jam-packed with all of the destructive goodness that made the previous games such a huge success!HistoryThe Burnin' Rubber games have been online since 2007 with over hundreds of millions of plays. At Xform we greatly enjoy developing new entries. Iterating upon the previous one and trying to get even more action and explosions in the new one.Since the games were originally developed for online play we always had to cut and tone down our content. Also, browsers are now phasing out the plugins that are required to play our awesome games! The released version was never the same as our 'development' version, but NOT for much longer. We would like to introduce you to the full HD remaster of Burnin' Rubber 5!Features:Full high resolution textures and audio.New, additional and updated visual effects.Single Player Campaign and Daily Challenges (unlock unique cars!).3 Challenge modes; battle with a team of 4 of your vehicles against another team!36 Challenges and the most epic end boss ever!50+ vehicles. Including, but not limited to; sportscars, trucks, classics and a horse! 20 Primary and secondary weapons. Including miniguns, railgun, homing missiles and fuel-air RPGs.6 Special weapons; Flak cannon, predator missile and redeemer etc.! Shoot and destroy!Hidden Packages for that very unique, odd vehicle.Partial controller support."
  },
  {
    "game_name": "Kill the Superweapon",
    "game_description": "What is Kill the Superweapon?Kill the Superweapon is a 3D Twin-Stick Action game.  The game uses a diorama-style perspective, allowing for twin-stick shooting, jumping, and 3D environments.In each of the game's levels, you must navigate a facility housing one of the bio-mehcnaically modified super-soldiers known as Superweapons.  You must search the facilities to find special ammunition that will let you take down the Superweapon.  However, the Superweapons are not content to just wait around for you.  They will roam from room to room in pursuit of the player.StorySamantha Kill is on a mission to take down the weapons manufacturer Abaddon Inc.  They are developing a series of Superweapons, bio-mechanically altered Supersoldiers who will be the weapons of the future.  They plan to bring about World War III, and sell their Superweapons to all sides.  Samantha Kill is armed with the Total Ablation Beam, an experimental weapon stolen from Abaddon Inc., and the only thing which can harm the Superweapons.  She must break into Abaddon's labs, find batteries to charge up the beam, and take out the Superweapons.  But, be warned, the Superweapons are not content to wait around for Samantha to find them.  They'll roam the level in pursuit of our hero."
  },
  {
    "game_name": "Maiden and Spell",
    "game_description": "Maiden & Spell is a one-on-one magical girl aerial projectile battler, featuring a colorful cast of ladies fighting with fantastic spells.Battling with magic is simple!  Fire your spells, hit your opponent, and don't get hit yourself!  Each maiden is color-coded and has a set of abilities unique to them, activated at a press of a button.  There aren't any complicated combos or intricate inputs or grabs or melee attacks or block buttons!  Just a 3-pixels-wide hitbox, a lot of shiny bullets, and your own dodging skills.You can fight against a friend in Versus Mode, or test your skill against a series of opponents and bullet hell boss attacks in Story Mode.An abyss on the edge of the map, said to be the most dangerous dungeon in the world... The Great Circle.  A group of young adventurers travel down into its depths in search of a powerful treasure.Awaiting them are cute monsters, nonsensical architecture, and an ancient city once known as The Kingdom of Stars.... A unique versus game with a whimsical fantasy aesthetic 8 cute maidens to play as, each with their own magical attacks, abilities, and playstyles Versus Mode, where you can play 1 v 1 matches against your friends Story Mode, fight against a series of opponents mixed in with 70+ challenging attack patterns to defeat Extra unlockables and optional challenges that will truly test your skills A JRPG-battle-theme inspired soundtrack by composer Steel_plus Online battling with lobbies and rollback"
  },
  {
    "game_name": "Hidden Expedition: Dawn of Prosperity Collector's Edition",
    "game_description": "Big Fish Editor's Choice! This title was chosen for its high standard of quality and amazingly positive reviews from our Game Club beta testers.\n\r\nEipix Entertainment proudly presents the continuation of the popular Hidden Expedition series! \n\r\nHello, Agent! We have another strange case for you. We've detected an unusual signal coming from the vicinity of an old weather station. Strange quakes have been detected there, though the area isn't an active earthquake zone. The nearby observatory is also showing signs of activity after years of being abandoned. We suspect something big – and possibly sinister – is happening there. Track down the signal and find out the truth! \n\r\nPlay interactive, list, picture, and morphing scenes as you solve a mountaintop mystery in this exciting Hidden Object Puzzle Adventure game! See what our Beta testers had to say:\r\n“Best in the series so far. I was disappointed when the trial ended. Very intrigued with where the elevator ended up. Will definitely buy to see what comes next.”  - Sela, Beta Tester\r\n“I really like the different types of HOs and puzzles. Not too easy and not too hard. The story line is very intriguing.”  - Christian, Beta Tester\n\r\nPlay as one of the wunderkind geniuses in the bonus game!\r\nFind globe collectibles throughout the world!\r\nReplay the HOPs and puzzles!\r\nGet the Strategy Guide!\r\nEarn special Achievements!"
  },
  {
    "game_name": "Balancelot",
    "game_description": "BALANCELOT IS NOW AVAILABLE!BALANCELOT RELEASE DATE: 23rd of MayA poor squire dream to attend and conquer the kingdom’s jousting tournament. But because he’s poor, he cannot afford a horse. The unicycle happens to be close enough so the epic journey may begin!Use your controller or keyboard to balance the clumsy but fully functional unicycle. Thrust the threatening mythical monsters with your sharpened lance as they sit on your way to glory. Climbing over the dead enemies with your unicycle may be the last climb you take. Crush your enemies, drive before them and hear the lamentation of your one-wheeler!FEATURESSurvive & balance through over 20 challenging levelsRelax or cut loose on changing medieval environments. From fairy grasslands to the darkest dungeons.Meet and fight mythical monsters from the past, where unicycle trials are taken to the extreme and lances sharpened like Monty Python jokes.Keep up with the twisted story with beautiful in-game cutscenesPrepare to balance... A LOT."
  },
  {
    "game_name": "Kane and Lynch: Dead Men™",
    "game_description": "Kane and Lynch: Dead Men is the new action shooter franchise by Io-Interactive, creators of the multi-million selling Hitman series. Kane & Lynch: Dead Men follows the violent and chaotic journey of two men -  a flawed mercenary and a medicated psychopath - and their brutal attitude towards right and wrong. This volatile partnership combined with innovative technologies allow for an unparalleled gaming experience. \t\t\t\t\tKane & Lynch: Dead Men immerses players in an emotionally intense crime drama with unflinching action.  Io-Interactive's proprietary technology delivers fluid high definition graphics and lighting; highly destructible environments; massive crowd AI; single, co-op, and squad-based combat; a cinematic interface; and non-stop dialog between Kane and Lynch.  The title also features innovative two-player co-op and groundbreaking online game play.   Tense and unpredictable experience - This is the violent and chaotic journey of two men: a flawed mercenary and a medicated psychopath. Each hates the other but must work together to save themselves and possibly the ones they love. Play Kane in single-player mode and either character in two-player co-op mode. Violence erupts in meticulously created 'safe' worlds - Realistic and responsive environments and crowds react when events get of out control. Crowded nightclubs and calm bank offices become scenes of sudden terror.  Manipulate the environments and crowds strategically to complete objectives. Wide variety of intense 3rd person game play - Rappel from buildings; fire on the run or from moving vehicles; launch surprise attacks, lay down cover fire, and shoot blind from around corners; and hurl smoke, tear, and incendiary grenades. Fast and intuitive combat - Lead a crew of criminal mercenaries to increase your chance of surviving and reaching your goals. You can also fight alone as your crew AI will automatically draw fire, throw grenades, lay down cover, and engage in close combat with their own signature moves.   Two-player co-operative game play - Team up and play the full story with a friend as either Kane or Lynch. On the big jobs, split the command of your crew.  At any point in the game you can choose to play the next, or previous, levels in co-op. Innovative multi-player levels based on the game's themes for up to eight players."
  },
  {
    "game_name": "Bring me a man, Santa",
    "game_description": "CHECK OUT OTHER GAMESAbout the Game2020 Xmas is coming and some of our guys got together to eat a juicy turkey. Now, while you take part in their night, you need to warm them up so that they can enjoy the best day of the year on their birthday suit, in other words, naked!To experience this, use your mouse and move the cursor over the characters' bodies trying to collect all candies. Stars will pop up, so take them to multiply your points. If you see a gift, get it as fast as you can! It's your opportunity to take off the guys' clothes!Features7 Hot Animated Boys;A one-hand game;Easy to play;CG Animated Gallery;"
  },
  {
    "game_name": "PixKeeper",
    "game_description": "World... It always holds secrets and discoveries that we will learn. A team of ordinary guys must fight against the mighty army of evil Lord Erlion, who is going to destroy the country of these brave heroes! Immerse yourself in a voxel 2.5 D world! Together with you, you will call your loyal friends who can protect you and your Homeland at the cost of their own lives. In battle, each team member reveals new abilities that they did not know about before! You will learn what incredible passive and active skills an archer, mage, and knight can learn! For each of them, you can play separately! You will need to develop your camp alone, or with friends online! Everyone will be able to develop individual abilities, and you also need to learn the unique style of the battle tower. For the tower, you will have three development branches available: defensive, attacking, and mixed. You will be able to develop individual characteristics of the tower. As the battle progresses, your scores will be updated on the leaderboard! You have to fight against a strategically developed enemy, so you need to awaken the same strategist in yourself! Each new wave will be stronger than the previous one! You will be able to keep a list of opponents, thanks to which you will know the weaknesses of each of them! Upgrade your tower, upgrade your heroes, upgrade your strategic points! Save the kingdom from defeat!"
  },
  {
    "game_name": "SOMOS",
    "game_description": "SOMOS is an action-arcade game with minimalist visuals, where movement is key to solving procedurally generated, living puzzles. Players switch their avatar between each side of the screen to avoid and/or destroy procedurally generated obstacles. Interacting with anything that is on the same side of the screen as the player's avatar will force the player to move to the other side, creating fast-paced puzzle solving.The core of the game is the many challenges that the player will have to accomplish. Each of them twisting the rules of the game to keep the experience fresh and interesting. Completing challenges unlocks new vibrant colour palettes which players can explore in the competitive Endless mode or Relaxation mode of the game.SOMOS is designed for PC and mobile, and suitable for advanced and casual gamers."
  },
  {
    "game_name": "Sex Simulator",
    "game_description": "Sex Simulator - a simulation game, the ultimate goal of which is to give you pleasure!You will be given a girl and you can do anything with it. Kiss, bite, slap and most importantly - have sex.Strip the girl and do what you want with her, because she is ready for anything!The clothes on the girl are randomly generated at each launch, but also a handy clothing editor is provided in the game, where you can dress as you want your future partner."
  },
  {
    "game_name": "Star Wars™ Pinball VR",
    "game_description": "Read our previews!“...I am a new believer in VR pinball.” – PC Gamer“Star Wars Pinball VR is easily one of the best Star Wars-themed VR games I’ve played on any headset.” – VRScout“a form of highly-concentrated nostalgia that absolutely works.” – Upload VR“This Is The Pinball Game You’re Looking For” - VRFocusController SupportStar Wars™️ Pinball VR supports Oculus Touch, or gamepad controllers and Oculus Rift and HTC VIVE headsets.About the GameFor the first time ever, Star Wars™ Pinball surrounds us in virtual reality! Star Wars Pinball™ VR collects 8 amazing tables: • The Mandalorian  • Star Wars Episode IV: A New Hope  • Star Wars Episode V: The Empire Strikes Back  • Star Wars Episode VI: Return of the Jedi  • Rogue One: A Star Wars Story • Star Wars Rebels • Masters of the Force • Classic Collectibles  Exciting new features exclusive to this release:  • The fully customizable FAN CAVE houses your “virtual” pinball table and items you earn • TOTAL IMMERSION MODE allows you to experience everything at table level • 360-DEGREE MINIGAMES surround you with iconic Star Wars set pieces  Other features from past Star Wars™ Pinball releases return:  • HAPTIC FEEDBACK for controllers so it feels like actual pinball • CAREER MODE for short, targeted gameplay sessions • FORCE POWERS to power up your play • A CANTINA JUKEBOX of John Williams music"
  },
  {
    "game_name": "World of Warships",
    "game_description": "Download and play World of Warships absolutely FREE — you can progress through the game’s countless ship trees simply by playing the game and accumulating experience.Naval warfare has never looked this good! Engage in thrilling battles between massive fleets across a multitude of gigantic maps where every maneuver, salvo, or push can mean the difference between utmost triumph and total defeat.From Bismarck and Yamato to Iowa and Hood… The most famous and historic warships of WWI and WWII have been recreated in breathtaking detail, making World of Warships the most extensive virtual naval museum on the planet!Every playstyle has its place! Take command of devastating but slow battleships, versatile but vulnerable cruisers, stealthy but lightly-armed destroyers, or quick-striking but fragile aircraft carriers — and everything in between!Choose your favorite branch among 12 in-game nations and battle your way up a comprehensive ship tier system following a natural historical progression.Install modifications on your ship to fit your playstyle, train your commanders to unlock special skills, and augment your fleet with camouflages, signal flags, and more.If the life of a lone wolf is not for you, invite your friends to a Division and put your co-operative skills to the test! If you're looking for a real challenge, join a Clan, climb to the top of the Clan league, and strive to be the best on your server!"
  },
  {
    "game_name": "Highly Likely",
    "game_description": "If we were to describe our game in a few words, they would be Ukraine, Moonshine and Oil! The game is inspired by the historical period of Prohibition in the US, the legendary Franklin County moonshiners with a modern twist and in a new place!The first part of the trilogy, Highly Likely, is a surreal Singleplayer 2D Side Scroller Adventure about a funny and somewhat naive character called Mikola who is trying to do all he can to save his homestead. The game is currently in Early Access.The story unfolds in a most ordinary Ukrainian farmstead near the Polish border, where the main character, Mikola, lives with his wife. In pursuit of his dream, he lands in tough circumstances and finds himself facing the threat of total ruin. It would seem that it's over, and there’s no hope. However, fate gives our hero a chance, albeit a very dangerous one, in the form of an “abandoned” oil pipeline. Realizing that he has nothing left to lose, Mikola, without thinking twice, decides to use it and, using various improvised devices, moonshiners style, starts a risky venture that involves him in incredibly amusing, sometimes dangerous and unpredictable adventures.Game Features:- More than 5 hours of relaxing gameplay.- A tragicomic realistic plot divided into acts.- A variety of quests.- Hand-drawn picturesque landscapes in 23 night and day locations.- Over 30 characters.- More than fifty interactive items.- More than a dozen types of vehicles: from a modern bicycle to a steam locomotive.- 130 unique animations of the main character.- Multiple movement paths that help to avoid obstacles and perform other maneuvers.- Original atmospheric music recorded with live instruments.- Family Friendly.- Narration: First of all, our beautiful game is a story with a fascinating and rich plot based on novel.  We really wanted the players to be able to fully enjoy the game process, so that they can fully appreciate its idea, and be able to emotionally empathize with the main character. For this reason, we employed a storyteller, who throughout the game narrates off-screen events, voices the thoughts of the characters, and conducts dialogs on behalf of the characters."
  },
  {
    "game_name": "BioShock™ Remastered",
    "game_description": "BioShock is a shooter unlike any you've ever played, loaded with weapons and tactics never seen. You'll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you'll also be forced to genetically modify your DNA to create an even more deadly weapon: you.Features:Museum of Orphaned ConceptsChallenge RoomsDirector’s Commentary: Imagining BioShock, featuring Ken Levine and Shawn RobertsonAchievementsFull Controller SupportHigh Resolution Textures, Models and Interface4K Resolution Support"
  },
  {
    "game_name": "Costa's Classic Cosmic Pizzas",
    "game_description": "Costa's Classic Cosmic Pizzas is a wacky 2D platformer about delivering pizza in space and saving the galaxy. Journey throughout the Omnicluster Space Station to deliver within the time guarantee and on limited oxygen supply.Jump, pick up objects, avoid traps and enemies. Navigate complex levels YOUR way.Use the environment to your advantage, interact with objects.Follow along as the story of galactic proportions unfolds in all of its glory. Start as an unassuming pizza delivery person whose only life ambition is to get their minimum wage, but as events unfold, you are hurled into a high stakes game of intrigue, espionage, political power play and a plot to subvert the entire galaxy to a single will.Do you have what it takes to save the galaxy?... Oh, OF COURSE you do! This is a video game and you are the protagonist! But it's the journey that matters. Come along for a spin!Every element of the game, from visuals to dialogue, has been carefully created to make you laugh, or cringe (whichever is more convenient at the time)."
  },
  {
    "game_name": "Legend of Long Night",
    "game_description": "Legend of Long Night hearkens back to the golden age of online real-time strategy games. Choose toplay on your own or with a team.Experience adventure, casual matches, challenging competition and survival!The four game modes provide endless replayability. Variouscore game features like fog exploration, resource gathering, building construction, and army battling gives Legend of Long Night the classic RTS feel.There are three races and dozens of heroes for you to select and combine. Creatingan intensely immersive and unsurpassed strategy game.\n\r\nFeatures:\r\n1.\tThe game features current popular game trend and adds a survival mode.\r\n2.\tGame pace has been spedup and the game operation has been simplified. The unnecessary time consumption and excessive operation frequency have been optimized.\r\n3.\tFocus is placed on the strategic level providing in-depth gameplay.\r\n4.\tIn 3vs3 game mode, we’ve created special racial strengths that complement and encourage cooperation.Grantingthe player a MOBA likeexperience.\n\r\nGameplay Instructions;\r\n1.\tAdventure Mode:\r\nThe splendid game story depicts a gratitude or resentment relationship among Chaos, Templar and the Gnomes. Play throughthe stories ofthe Nazgul King, Light Priest and Gnome Doctor. These kings of thethree races appear right beforethe arrival of the long night.\r\n2.\tCasual Mode\r\nInvite your friends and share resources with them to have a cooperative and casual game tour! In the casual mode, you can choose 1vs1, 2vs2 or 3vs3, either playing on your own or in a group. \r\n3.\tCompetition Mode\r\nAuthentic and classic RTS game type. Theperfect combination of strategy and operations grantsyouan amazing game experience. Show the power of your heroes and army to win the honor of becoming the strongest commander!\r\n4.\tSurvival Mode:\r\n20 elite squads will fight each other in the dangerous and toxic forest. Natural attacks, monsters and treasure chests will appear at random. Who will be the final winner?"
  },
  {
    "game_name": "The Cabin",
    "game_description": "AnnouncementHave added Fullscreen functionality along with cleaning up several bugs related to the menu's crashing the game under specific circumstances.Content UpdatesCleaned up the GUIIncreased loot spawn ratesFullscreen functionalityJust UpdatedIt's been over four years since the initial release of this game. What started as a micro project—a way to learn the game development process and complete a project—has evolved into something much greater. As a more experienced developer, I’ve decided to revisit this project and transform it into a game I can truly be proud of.In the coming weeks, I’ll be releasing a massive update that fundamentally evolves the game into what I’d now describe as a \"2D survival game with a highly simulated and interdependent world.\"This update represents a significant effort to design a world and gameplay experience driven by a dynamic, simulated environment. The focus will be on how the environment develops and how players choose to interact with it to survive. I believe this update will make the game fully deserving of its price tag.To those who originally played it: thank you for being the motivation to make it better and see it through to proper completion—especially those who rightfully tore it a new one.About the GameSet deep within Canada’s frozen boreal wilderness, The Cabin is a 2D survival game where every tree you fell and every cabin you raid has lasting consequences. Society has crumbled after a mysterious catastrophe swept through the South, and like many others, you've fled into the vast and unforgiving North—seeking solitude, safety, and survival in your remote family cabin.But you're not alone.🌲 Survive the WildThe harsh winter is only the beginning. You'll need to hunt, scavenge, chop wood, and manage your supplies carefully. The forest is rich with resources—but it's also alive. Overharvesting leads to environmental degradation, scaring off wildlife and leaving the land barren. Every decision affects the world around you. Will you live in balance with nature… or bleed it dry to survive?🔥 Resource Management Meets ConsequenceBalance your firewood, food, and ammunition. Store supplies for brutal cold snaps, cook meals, and maintain your cabin. But be warned—hoarding too much may attract attention from others trying to survive by any means necessary.⚔️ Trust No OneOther survivors wander the forest. Some are desperate. Some are violent. Some belong to the Cultists, a fanatical group that stalks the woods, whispering prayers to an unseen force. Raiding abandoned cabins might offer temporary relief, but if the owners are alive… they will come looking for revenge. Every encounter could be your last."
  },
  {
    "game_name": "From lamer to guru",
    "game_description": "The Game Will Take You to A New Body.Now you can feel yourself in the role of a programmer. Perform the appropriate work and create your own projects!To Succeed, You Need to Rise From the bottom!Be Very Diligent and Strive For Perfection.In This Game You Will: Climb the career ladder Monitor your health Update your personal computer Go to a part-time job Write programs Distribute projects via CD or Internet Protect your PC from viruses Create comfort in your home And much moreThis game is dedicated to people who just want a break from the hustle and bustle of life or love the game genre clicker."
  },
  {
    "game_name": "Rotatex 3",
    "game_description": "Rotatex 3 is a continuation of the fascinating story of the Rotatex cat. In the game you have to smoothly rotate the level and solve puzzles.Features of the game:Smooth rotation of the levelDoors and switchesAtmospheric musicProgressThe original storyThe player's task is to direct the Rotatex Cat to the teleport exit, and for this you have to solve puzzles related to physics and level rotation."
  },
  {
    "game_name": "SoulSet",
    "game_description": "You play as Mariko, who finds herself trapped in an eerie mansion with five other people who claim to have no recollection of their past. Who will you trust?  A total of 7 pursuable characters (both male and female)   Over 20 possible endings  100k+ words with an estimated 10-15 hours of gameplay  Multiple story lines with unlockable, alternative paths  Multiple route mystery (only by playing all of the routes will you be able to learn the entire story behind the game's events)\t  A fantasy setting where magic is a part of everyday life   Mystery, suspense, romance, comedy, fantasy   18 beautiful backgrounds, spiced with the arcane   Over 30 character sprites, including alternative outfits   A CG, BG and Ending Gallery to help keep track of your progress NoBreadStudio's debut indie title, made by a team of only 3 people! You find yourself in a world where magic is a common sight, dragons are rare but exist, spirits roam the lands and people's souls hold a lot more potential than one might expect. The player follows the predicament of Mariko Blairnot, a young woman who finds herself trapped in an eerie mansion with five other people who claim to have no recollection of their past. Mariko herself can only remember scattered bits and pieces of an event that supposedly happened years ago, involving the death of her mother and the appearance of a mysterious stranger who offered his help to her and her closest dragon companion, Isshin. With both of them nowhere to be seen inside of the mansion, Mariko and the rest of the cast investigate their surroundings, only to find more questions with no answers. When someone comes up with a way that could help in getting their memories back, Mariko is presented with the option to pair up with someone for the experiment.Who will you trust?"
  },
  {
    "game_name": "Monopolist: Technological Revolution",
    "game_description": "Imagine being a monopolist of the late 19th and early 20th centuries.\r\nIn the game Monopolist: Technological revolution - wins the one who will earn the first 50000$ or eliminate other players from the game, \r\nforcing them to go bankrupt.\r\nAI - artificial intelligence. \r\n• Merchant is a cautious player whose purpose is to lead a trade while avoiding losses. \r\nHe will not buy an enterprise if he has not enough money to keep his business. \r\n• The buyer is a pretty dangerous player. \r\nHe buys everything that can and may change your plans to create a monopoly. \r\n• The monopolist is the most dangerous type of player. \r\nHe carefully buys the firms that will bring him the most profits and willingly creates a monopoly.\r\nSet up startup capital and choose the color of your car and go ahead of monopolizing the city.\r\nAddition:\r\n• Get some images that you can use as avatars. Images are in the game's directory."
  },
  {
    "game_name": "Retro Racer",
    "game_description": "Retro Racer is neon lights, a fantastic city, synthwave, and the most vivid images of the 80s. Super cars, vhs effect, IBM computer graphics, glitches, analog synthesizers. Immerse yourself in the world of a neon future that will never come. Race on a retro futuristic supercar on a looped track, pick up speed and try to masterfully fit into turns and avoid any obstacles. Retro Racer offers recognizable visual and audio experiences that will undoubtedly cause nostalgia among fans, and those who are not familiar with this alluring image of the future will be able to learn about it.Main Features Four different tracks with different post effects Racing supercar! Neon atmosphere of Retro futurism"
  },
  {
    "game_name": "NOBUNAGA'S AMBITION: Zenkokuban",
    "game_description": "To commemorate Kou Shibusawa's 35th anniversary, the \"Kou Shibusawa Archives\" will be opened in the Steam Store. Here we will revive popular previously released titles. \r\nIn this second round of releases we offer \"Nobunaga's Ambition-Nation,\" the second release in the series and the first to be released outside of Japan (under the name Nobunaga's Ambition). \r\nPlayers take the role of one of the main characters of the period, Nobunaga Oda, Shingen Takeda, Kenshin Uesugi, or others and try to unite the 50 kingdoms of Japan, from Ezo in the north to Kyushu in the south, under their own rule."
  },
  {
    "game_name": "Averon Rising",
    "game_description": "SummaryAveron is a futuristic empire building game that gives players agency to create and direct a nation in anyway they want to roleplay. Empires exist in a persistent multiplayer world where nations exist and grow side by side. The entire economy and political climate of the world is driven by the actions of the player nations. The futuristic world of Averon has many advanced technologies to discover from war mechs to nano tech. When players battle, they control units on a micro scale to out maneuver their opponents. Key FeaturesWarPlayers can declare war on one another for any reason they see fit.Combat is controlled on a microscale.AIThere will be AI controlled raiders to keep the players on their toes.Custom Built MechsPlayers can not only purchase existing mech design but they are also able to modify.Open MarketPlayers can put items up for bid at an auction house or sell them for a set price on the open market. Players may directly trade with each other.Morale systemPlayers must keep their citizens happy to keep productivity high.Mercenary ContractsPlayer can offer and accept mercenary contractsResearchResearch through six specialized fields to unlock the ability to produce items.Raw MaterialsRaw materials are necessary to produce goods and equipment. Due to their limited quantities on the map they are a major source of warfare.Claiming TerritoryPlayers can grow their territory through exploration or conquest.Diplomacy Players make alliances or trade partnerships with no in game regulation."
  },
  {
    "game_name": "Swinger-Man",
    "game_description": "This is the Super Meat Boy of Spider-Man experiences. This is for all you hard-core swingers out there. Here the ropes are tight, the curves are smooth and the concrete WILL keep punishing your face until you get it right.Features Time trial: Get through the level as fast as you can and make sure to grab 3 stars all the way. Unleash your creativity: If you can bend the rules of physics and game design to find unusual routes to the goal, then fine, you win. Ultra-realistic physics: No-compromise swing mechanics. We even threw fun out the window for the sake of realism. Master the skills: That wall ain't going to avoid you hitting itself.  Beat your friends: Inflict pain on your dearest of friends by sending that oh-so-sweet screenshot of your score above theirs. Beat the world: If you are truly masochistic, put friends and family aside while you stride for the top of the leaderboards."
  },
  {
    "game_name": "Arx Fatalis",
    "game_description": "Journey to the World Of ArxExplore A Fantasy WorldThis critically acclaimed first-person RPG from Arkane Studios takes the player on an amazing journey into the fantasy world of Arx. Arx is wrought with turmoil, brought to the brink of destruction by a violent war. The sun has disappeared from overhead to shroud the world in eternal darkness, forcing communities to begin inhabiting underground mines. But as food and drink becomes scarce, the wars become even more violent as each race – from trolls, goblins, and rat-men, to humans – struggle for survival.  Now, evil has arisen in this sunless world in the form of the God of Destruction, Akbaa. It’s up to you to defeat Akbaa and save Arx from his reign of terror. You must use bravery and cunning to uncover the long hidden secret of Arx. As your epic quest unfolds you will explore ancient temples, bustling cities and abandoned mines; unearth legendary artifacts and face terrifying foes.Build Your ChampionYou will become the hero of an underground world. Create a customizable character and allocate skill points in categories such as spellcasting, weapons, armor, and stealth to build your champion.Wield Powerful MagicTake out enemy creatures with an innovative casting system featuring 50 powerful spells. Using the mouse, draw runes in mid-air and combine gestures to unleash powerful magical abilities.Forge Your Own Path Through An Immersive WorldArx Fatalis mixes intelligent storytelling with nonlinear gameplay and challenging puzzles, and every choice you make in the game could have drastic impacts on the world. In true Arkane fashion, the game allows you choose your own playstyle and path, with several different possible endings awaiting you based on your decisions."
  },
  {
    "game_name": "Naked Puzzle: Girls",
    "game_description": "\"Naked Puzzle: Girls\" is an puzzle game, where the goal is to get all the girls undressed.Match the pieces and unlock new stages. Each level with less and less clothing.No need to move pieces around, just rotate them! Plow your way trough all the mosaics.Game Features: 🍑 19 auto generate puzzles.  🍑 6 girls. 🍑 20 achievements. 🍑 Lots of cool backgrounds. 🍑 Navigation that enables close ups. 🍑 Each stage gets more challenging. 🍑 Don't ever get stuck! Use the sneak peak ability to uncover the missing pieces! 🍑 If in a hurry, press Ⓧ. (The game shows naked breasts and genitals)⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩ ⇩Thank you very much for supporting this game.If you like this game, please recommend it.Thanks to you, we can improve the quality and make more interesting erotic games! Thank you again!💗 💗 💗 💗 💗⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧ ⇧"
  },
  {
    "game_name": "Headspun",
    "game_description": "Cortex is in ruins.After waking from a five week coma, Theo Kavinsky finds his life in disrepair, and with no memory of the accident, it’s up to Ted and Teddy – the conscious and subconscious voices in his head – to work out what happened, and put his life back on track.  Headspun is an FMV/Adventure hybrid which puts you in the shoes of Ted: the Director of Cortex - the rational, intelligent voice in Theo's head. What Ted thinks is best for Theo isn't necessarily a view shared by Teddy, however; the primal, emotional subconscious voice... In the process of repairing Cortex, re-hiring a team and finding out what happened the night of the accident, Ted and Teddy must cast aside their differences and learn to work together. Headspun is a game about recovery, discovery, and the ongoing battle between logic and emotion. Rich FMV story-tellingBranching dialogue - sway the outcome of your interactionsRebuild Cortex - earn Neuros to hire staff and commission renovations Retreive Lost Memories and work out what happened the night of Theo's accidentOriginal Synthwave Score from Soho Loop"
  },
  {
    "game_name": "The Bard's Tale IV: Director's Cut",
    "game_description": "Special EditionsAbout the GameHidden in the shadows, an evil has waited patiently. Until now. Who will face the darkness if not you? A heroic adventure featuring 50+ hours of gameplay, 350 speaking parts, a Legacy Mode for returning fans, and over 100 pieces of incredible music!The Director’s Cut brings more character customization options, new items, new enemies, revised UI, and a free expansion dungeon.Customize How You PlayDefine the way you play, using sliders on numerous options such as saving (including “save anywhere”), the mini-map, waypoint markers and many more. Whether you seek a hardcore challenge, a lighter experience, or something in-between, the choice is yours.Create the Hero You Want To BePlay as Bard, Fighter, Practitioner, and Rogue, each featuring 60-70 skills and collectively unlocking 21 unique classes. Build an array of characters to make every playthrough a unique experience.Craft your Party, Your WayStart your party with a single character, recruiting or creating new heroes to bolster your ranks. Build a party that suits your play style!An Adventure Around Every CornerExplore towns full of quest givers, fight your way through dark and deadly dungeons, and navigate beautiful rolling hills, dense forests, and icy wastes.Outsmart Evil Battle your enemies in dynamic, intuitive turn-based tactical combat, that rewards clever thinking. Use superior strategies, thoughtful positioning, and deadly combos to bring down your foes!Unlock the Secrets of the PastUnravel challenging mysteries. If your enemies don’t get you, the devious riddles and dangerous traps just might.The Blade’s TaleThe sense of discovery and mystery doesn’t stop with the environment. Gain ancient Elven weapons containing secrets which you’ll need to uncover by carefully examining them.New Song of Exploration “Strugglers’ Lament” Whether you just want to explore and fight or if you get stuck, simply play this song to skip mandatory puzzles."
  },
  {
    "game_name": "Gratuitous Tank Battles",
    "game_description": "Gratuitous Tank Battles (GTB) is a unique hybrid of tower-defense, strategy, simulation and RTS. Set in an alternate history timeline where World War I never ends, you are the commander of allied forces fighting right up to the year 2114, where Mechs and lasers are used alongside tanks and rifles. The war continues across Europe, with the allied commanders still locked into the optimistic patriotism of the 1900s.A tower-defense game where you can play as the attacker has been done before, but GTB lets you play the same maps as attacker OR defender, and even lets you save out your attack as a recording to defend against. An online-challenge system lets you upload your custom maps and custom units and attacks for other players to fight against. Speaking of custom units, GTB doesn't have simple pre-built units, but allows you to build them from individual components, and even design the appearance and colors of every single unit. An unlocks system gradually reveals more modules, abilities and unit 'hulls' to experiment with.GTB also features an integrated map editor that lets you trivially change and tweak existing maps, or create entirely new ones, and the process of sharing these custom maps with friends is built right into the game. Combine it with Steam achievements, community, cloud support and more, and you should be kept busy fighting over Europe for another two hundred years./>Key Features Alternate History Tower Defense: Fight a 200 year war to save Europe Play as attacker or defender on any map, even custom ones Fight with Infantry, Tanks, Turrets and Mechs Optional Adaptive AI adjusts to your play style and tactics for endless variety Customizable units allow you to design your own personal army Built-in level editor makes creating a new map a breeze Save out your attack and play against it as the defender Online map and challenge-sharing system allows you to fight your friends armies"
  },
  {
    "game_name": "Larcenauts",
    "game_description": "\"This is the VR team-based class/hero shooter VR needs!\" —Gaming Trend\"A Slick, Rich Shooter For Competitive Play\" —Upload VRHeart-pounding thrills in majestic locales… Concerted mayhem and lawless mischief… Welcome to the Tern system.Choose from 9 different Specialists each with unique weapons and skills to compete in thrilling 6v6 matches. Game modes include territories-style Refuel, capture-the-flag-style Uplink and classic team Deathmatch across 4 different maps. And now an all new payload-style Heist mode featured on the new map—Thunderhead. Advance your characters through a deep progression system and cosmetic upgrades.Captain Eleanor Kas has put together a heist crew of epic proportions for a series of heists. The Specialists are the best in the galaxy and come from all walks of life. The crew will need intel and supplies before attempting the heists and there will be opposing forces every step of the way.To the victor Go the Spoils… and the notoriety."
  }
]